{"pages":[{"title":"“β-阻断剂在制备用于治疗血管瘤药物中的用途”发明专利权无效宣告请求案","text":"来源：中国知识产权报 作者：潘 珂 陈龙飞 案情介绍涉案专利名称为“β-阻断剂在制备用于治疗血管瘤药物中的用途”（专利号：ZL200880111892.5），专利权人为波尔多大学，无效宣告请求人为亚宝药业集团股份有限公司。 婴幼儿血管瘤是婴幼儿最常见的良性肿瘤，在本专利申请日之前尚缺乏有效的治疗方法。萘心安原是一种传统的治疗心血管疾病的β-阻断剂类药物。2008年，发明人意外发现萘心安可用于治疗婴幼儿血管瘤，该新用途的发现被业界公认为开启了婴幼儿血管瘤治疗的新篇章。 本案审理过程中涉及多个法律问题，包括权利要求中特定技术术语的理解，说明书是否充分公开了萘心安在治疗婴幼儿血管瘤疾病的治疗效果，以及对已知药物的新用途发明的创造性判断等。经审理，国家知识产权局作出第46004号无效宣告请求审查决定，在专利权人提交的修改文本的基础上维持专利权有效。 典型意义本案综合考虑专利说明书的记载和现有技术公开的内容，从相关证据中梳理技术发展脉络，从而确定提交申请时特定技术术语在该技术领域中的含义，并据此廓清权利要求的保护范围，为类似案件的处理提供参考借鉴。本案还阐释了对于“老药新用”类发明在创造性评判时，需要全面考虑体内生理环境的复杂性、致病机理的多样性和不确定性等因素，避免出现沿着已知药理学、病理学的蛛丝马迹而反推本专利技术方案的“事后之明”。 案件评析已知药物的新医药用途（或称已知药物第二用途）是医药生物领域重要的一类发明，其意义往往并不亚于发现全新化学药物，受到各界的高度关注。本文通过对一个无效宣告请求案件的审查思路进行梳理，尝试从技术术语的理解、技术效果的确认、技术启示的判断几个方面给出合议组的思路和相关观点，希望为此类发明合理的撰写、客观的审查和全面的保护提供借鉴。 专利权维持有效萘心安又称普萘洛尔，属于β-受体阻断剂，能阻断β1-受体，减慢心率，降低血压，可用于治疗心律失常、冠心病和高血压等，临床应用史较长，其体内药物代谢、药动学和毒理学研究较为透彻，安全性较强，用药对象包括婴幼儿等。而婴儿毛细血管瘤（简称IH）是一种常发病于面部的良性肿瘤，由于常发病于面部从而对患儿家长造成极大心理负担，已知的治疗手段主要为外科手术或激素治疗等，有效治疗手段匮乏。 涉案专利的发明人在针对患有IH的心脏病患儿用萘心安治疗心脏疾病时，意外发现对IH产生了疗效，并在此基础上进一步验证了此效果，基于此在中国申请了涉案专利的萘心安的第二制药用途发明专利申请并获得授权，授权的12项权利要求均为制药用途权利要求，主要包括萘心安及其盐用于治疗血管瘤、毛细血管瘤、毛细血管婴儿血管瘤的制药用途。 针对前述专利权，请求人提出了无效请求，其理由涵盖权利要求是否清楚简明、权利要求是否能够得到说明书支持、说明书公开是否充分、权利要求相对于相关证据是否具备新颖性、创造性等，并提交了系列证据。专利权人先后两次修改了权利要求书，经过两次修改后保留了11项权利要求，修改后的权利要求1要求保护萘心安或其药物盐在制备用于治疗毛细血管婴儿血管瘤药物中的用途，同样提交了系列反证反驳请求人的观点。国家知识产权局成立合议组对本案进行了审理，在修改的权利要求的基础上维持专利权有效。 技术术语的理解本案中焦点之一在于修改之后“毛细血管婴儿血管瘤”的含义是否清楚，是否能够得到说明书的支持。 请求人主张：“毛细血管婴儿血管瘤”不清楚，其可能是草莓状血管瘤，也可能是葡萄酒色斑（一种血管畸形）。专利权人主张修改后的“毛细血管婴儿血管瘤”即现有技术中的草莓状血管瘤。 合议组展开了如下分析： 首先，考察专利本身记载可知，修改后权利要求1中将针对的疾病限定为“毛细血管婴儿血管瘤”，对应于说明书中记载的婴儿毛细血管瘤，说明书中记载“婴儿毛细血管瘤(IH)是最常见的婴儿软组织肿瘤，……IH由细胞类型的复杂混合物组成，包括大多数的内皮细胞，与外膜细胞相关的、树突状细胞和肥大细胞。……IH内皮细胞表现出独特的分子表型，其特征为免疫组织化学阳性……在IH的生长期，组织学研究显示内皮细胞和间质细胞均处于增殖状态(MIB1染色强阳性)”；实施例1、2中的两个患儿在用萘心安治疗之前均接受激素治疗。 其次，梳理现有技术可知，现有技术中分别记载了血管瘤、婴儿血管瘤、毛细血管瘤等的定义、分类等。例如有证据将新生儿血管瘤分为毛细血管瘤等三种，在毛细血管瘤下又分为焰色斑（葡萄酒色斑）、莓状毛细血管瘤（strawberry mark；capilliary-cavernous hemangioma）即毛细血管海绵状瘤，指出对莓状毛细血管瘤可用激素进行治疗。还有证据则将血管瘤分为毛细血管型瘤血管瘤、海绵状血管瘤等，又将毛细血管型瘤血管瘤分为杨梅样毛细血管瘤（或称莓痣）和葡萄酒斑毛细血管瘤。还有反证指出婴儿血管瘤（Infantile hemangioma）又称草莓状血管瘤，应与海绵状血管瘤和鲜红斑痣（又称毛细血管扩张痣或葡萄酒色痣）的鉴别诊断相区分。从这些证据来看，该技术领域的分类和认识较为混乱，但综合现有技术内容可知，申请日前已经对草莓状或莓状婴儿毛细血管瘤的含义、形态学，临床诊断和治疗上，整体上存在较为清晰的认知，该疾病属于具有增殖特性的婴儿毛细血管瘤，可用激素治疗，据此可与葡萄酒色斑区分开来。 通过对现有技术的整体考量，合议组认为：综合说明书中记载信息，涉案专利中的IH指的是具有增殖特性，可用激素进行治疗的IH，基于本领域技术人员在申请日时的前述认知，可确认该疾病对应于草莓状血管瘤，而非葡萄酒色斑。 作为本领域的标准或权威著作的部分申请日后公开的反证进一步对包括婴儿毛细血管瘤在内的各种婴儿血管瘤进行了定义、分类，并介绍了此类疾病的认知发展。结合对血管瘤类疾病的认知发展史的脉络的梳理，进一步佐证了合议组的内心确认，在申请日时毛细血管婴儿血管瘤应理解为草莓状血管瘤，该术语含义是清楚的。 技术效果的认定本案中，请求人主张：说明书未提供毒性实验，说明书提供的具体治疗病例数量过少，实施例1-2均同时施用激素，血管瘤还可能自愈，无法预期治疗效果是萘心安实现，据此主张说明书公开不充分。 涉案专利说明书中记载了包括如下三个实施例在内的内容： 激素治疗的2月龄IH患者，发现阻塞性肥厚型心肌病，引入萘心安治疗心脏问题，意外发现IH迅速好转，继续施用萘心安，14月龄时IH已完全扁平。 激素治疗无效的1月龄IH患者，引入萘心安，12小时病变软化，7天IH显著好转，9月龄停药，IH未重新生长。 2月龄IH患者，接受萘心安治疗，7天后IH变小，7月龄IH扁平消退，8月龄停药，无任何反弹。 对于说明书中未提供毒性试验的问题，考察涉案专利记载，并梳理现有技术，合议组认为，涉案专利属于已知药物的新用途发明，在申请日前，β-阻断剂萘心安的安全性、毒副作用能得到本领域技术员的确认，说明书中对此未提供实验数据予以验证，不会导致说明书公开不充分。 对于说明书记载是否足以证实萘心安疗效的问题，虽然激素是治疗IH患者的药物，但从实施例1来看，激素治疗无效且产生了较严重的副作用，在此情况下引入萘心安，产生了疗效；从实施例2来看，激素治疗无效且IH反而扩大，引入萘心安后迅速产生疗效，据此本领域技术人员不会认为属于激素产生的疗效；实施例3单独使用萘心安治疗，同样验证了疗效；据此可确认说明书实施例反映出发明人从意外发现到重复验证再到扩大适用的实践历程，足以令本领域技术人员确信萘心安治疗IH的疗效。现有技术证据显示，IH患者确实有自愈的可能，但一般在2岁至3岁消退，5岁至6岁消失，在出生后1个月至2个月内出现，1岁内生长活跃，针对前述三个病例的患者，发病均在1岁之内，因此无法认可请求人提出的疗效可能因为自愈的主张。说明书所记载的实验数据足以令本领域技术人员确信萘心安对IH的疗效。 技术启示的判断本案中，请求人主张的创造性评述方式包括证据A结合证据B破坏涉案专利的创造性。认为证据A公开了婴儿血管瘤的消退似乎涉及增加的凋亡，血管瘤的自然消退与增加的凋亡同时发生，触发增生的内皮细胞凋亡的试剂可以成为威胁生命的血管瘤的有效治疗剂，因为这些肿瘤由内皮细胞组成。而证据B公开了成年大鼠暴露于β阻滞剂（比如萘心安）诱导的肺组织纤维化应答，实验结果显示单独的毛细血管内皮细胞的β阻断似乎诱导这些细胞凋亡。据此可知，萘心安能够促进毛细血管内皮细胞凋亡，为此能够用于减弱毛细血管瘤的增生并加快其退化，从而将萘心安或其药物盐用于制备治疗IH的药物。 合议组注意到，首先，证据A仅是基于作者通过观察血管瘤样本切片中的细胞凋亡和细胞增生，发现婴儿血管瘤的消退似乎涉及细胞凋亡的增加，由此提出对于婴儿血管瘤生长和退化的调控的机制，提出了相应的设想，推测内皮细胞中引起凋亡的抗血管生成剂可以减弱婴儿血管瘤的增生期并加快其退化过程。然而，从本领域技术人员视角出发，无论是婴儿血管瘤和普通肿瘤，还是内源性血管生成抑制剂和外源性细胞凋亡剂都存在很大差异，这种设想尚不足以如请求人所述能明确教导本领域技术人员将促进凋亡的试剂用于治疗婴儿血管瘤。另一方面，考察证据B的整体内容，则可以看出，单独的毛细血管内皮细胞β阻断诱导这些细胞凋亡，但是同时阻滞血管内皮细胞以及成纤维细胞时，则可保护内皮细胞免于凋亡，而体内情况更为复杂，婴儿毛细血管瘤不但包含内皮细胞，还包含证据11中提及的成纤维细胞以及外膜细胞、肥大细胞和巨噬细胞等，据此无从判定萘心安在体内复杂情况下到底是诱导凋亡还是阻断凋亡。因此，本领域技术人员并不能显而易见地根据证据A和证据B得到将萘心安用于制备治疗IH药物的技术方案。 创造性的评判我国专利法第二十五条第一款第（三）项规定：疾病的诊断和治疗方法不授予专利权。《专利审查指南》第二部分第十章第4.5.2节规定：物质的医药用途权利要求可撰写为“在制药中的应用”“在制备治疗某病的药物中的应用”等属于制药方法类型的用途权利要求。物质医药用途发明从撰写、审查到保护均存在一定特殊之处，对于已知药物的新制药用途类发明，验证药物疗效等技术效果的实验数据应要求到何种程度，如何客观判断其创造性，“本领域技术人员”的站位对于得出客观的结论非常重要。 对于药物针对的疾病术语，当现有技术存在不一致，甚至混乱矛盾时，应基于专利本身的记载，梳理各项证据中反映出的技术发展脉络，还原到申请日时本领域技术人员的合理认知，从而客观认定疾病术语的含义。对于技术效果的证实，亦应结合对特定技术领域的发展水平，基于本领域技术人员的合理认知予以客观确认。 对于此类发明的创造性评判，作为传统药物，其药理、药化等方面的研究通常也相对较为透彻。基于此，从现有技术中很容易搜集到各种蛛丝马迹的文献，比如一篇文献提及此类药物和某些体内机制相关，而其他文献又提到了某些体内机制和某类疾病相关。在此前提下，本领域技术人员是否能够根据前述现有技术显而易见地得到药物的新用途，通常应首先确定发明因其技术方案的选择所实现的技术效果，比较专利相对于最接近现有技术的区别，基于所述区别所取得的技术效果和实际解决的技术问题，再对现有技术进行整体梳理和客观把握，站位本领域技术人员，合理认知申请日时现有技术的整体发展状况，尽可能还原发明得出的过程，基于此客观判断本领域技术人员为了解决发明实际解决的技术问题是否能够显而易见地得到该发明。","link":"/Patent-Reexamination-and-Invalidation/2020-01.html"},{"title":"“板材上下料装置及手机玻璃加工中心”发明专利权无效宣告请求案","text":"来源：中国知识产权报 作者：张 虹 杨克非 案情介绍涉案专利名称为“板材上下料装置及手机玻璃加工中心”（专利号：ZL201520396790.X），专利权人为苏州恒远精密数控设备有限公司，无效宣告请求人为深圳市创世纪机械有限公司。 制造业是实体经济的主体，在发展方式由规模速度型向质量效益型转变过程中，技术创新起到至关重要的作用。涉案专利涉及一种手机玻璃加工装置，专利权人和请求人均是全球最大的手机玻璃面板生产商伯恩光学的产品供应商。双方的专利纠纷微观来看影响着涉案两家公司及其上下游产业链和销售链，宏观上看是制造业发展方式转变过程中技术创新和专利发挥作用的缩影。 本案审理过程涉及对权利要求技术方案的理解，创造性技术启示的判断，以及使用公开证据链的认定等诸多法律问题。经审理，国家知识产权局作出第35297号无效宣告请求审查决定书，维持该专利权有效。 典型意义本案阐释了在创造性的审查过程中，要从现有技术“整体”考量是否存在技术启示，而不能将现有技术中的手段进行简单叠加或拼凑。如果最接近的现有技术本身不存在改进的基础，那么即使另一份现有技术公开了能够实现相应作用的区别技术特征，本领域技术人员也没有动机将上述现有技术进行结合。本案还深入分析了在专利无效程序中如何判断使用公开的证据是否构成完整的证据链。 案件解析本无效宣告请求案涉及名称为“板材上下料装置及手机玻璃加工中心”的实用新型专利权（专利号为ZL201520396790.X，下称涉案专利），请求人为苏州恒远精密数控设备有限公司，专利权人为深圳市创世纪机械有限公司。 涉案专利涉及一种手机玻璃加工设备的板材上下料装置，其背景技术中的玻璃加工设备取放料和加工步骤是逐步进行的，取放料时间长，生产效率低。为了解决上述技术问题，涉案专利提出了一种具有共用料槽的手机玻璃加工中心，其中的板材上下料装置包括转动杆和转动块组成的转动机构，在转动块的前后两侧设置取放部，可以通过转动杆和转动块一次180度的转动，在加工台上实现待加工板材和已加工板材的快速换料，解决了现有技术中取放料时间长的技术问题。 涉案专利权利要求1要求保护该板材上下料装置，具体限定为，“板材上下料装置，其特征在于，包括：用于将板材竖立排列放置且待加工板材与已加工板材共用的料槽，具有转动杆的转动机构，用于承载转动机构在板材排列方向和上下方向运动的第一驱动机构，及安装在所述转动杆上的转动块，转动块的前后两侧均安装有用于取放板材的取放部，转动机构安装在第一驱动机构上且转动块位于料槽上方，位于板材排列方向上设有用于对板材做进一步处理的加工台”。 请求人主张涉案专利权利要求1相对于多份专利文件的结合不具备创造性。关于创造性，双方当事人的争议焦点主要在于对涉案专利权利要求1保护范围的解读以及对最接近现有技术的理解。 请求人认为，作为最接近现有技术的证据1公开了一种通过支轴、搬送机械手及其吸盘、临时放置台、升降机及其吸盘等部件的配合，实现高生产率加工板材的装置。证据1的搬送机械手绕支轴转动（摆动）90度，在从支轴向下方垂下的竖直姿势和从支轴向加工机侧延伸的水平姿势之间摆动。由于搬送机械手绕端部的支轴发生90度的转动（摆动），其在吸取收纳壳体C中的板材时，始终由搬送机械手下侧的吸盘朝向未加工板材进行吸附，而在实现工作台上的板材移动时，始终由搬送机械手上侧的吸盘与升降架进行未加工板材的交接，由搬送机械手下侧的吸盘与工作台进行已加工板材的交接，因而收纳壳体C和工作台之间必然需要设置一个临时放置台，才能实现其作业目的。 事实上，在请求人提出权利要求不具有创造性主张的同时，请求人还提出了涉案专利权利要求1缺少转动杆“转动角度180度”的必要技术特征，认为权利要求1中对于转动杆和转动块的记载，仅仅在于“具有转动杆的转动机构”“及安装在所述转动杆上的转动块，转动块的前后两侧均安装有用于取放板材的取放部”，基于涉案专利权利要求1对转动杆和转动块的记载，不能解决其板材同时上下料的技术问题。继而在创造性的主张中提出，证据1记载了支轴装配有绕该支轴转动（摆动）90度的搬送机械手，因而证据1公开的支轴和搬送机械手对应于涉案专利的转动杆和转动块。项庄舞剑，意在沛公，从请求人的上述主张可以发现，其提出的非三性条款是为后续的创造性主张做的铺垫，请求人以上述渐进的方式，旨在提出涉案专利权利要求未记载转动杆和转动块的转动角度，因而转动杆和转动块的转动角度可以理解为任意角度，该权利要求具有较大的保护范围，从而就权利要求的保护范围和创造性与专利权人博弈。 针对请求人的主张，专利权人坚持认为，涉案专利权利要求1虽然没有明确记载其转动角度，但是权利要求1的上下文暗含了转动杆转动角度180度的技术内容；另一方面，证据1公开的上述支轴和搬送机械手的结构，并不对应涉案专利的转动杆和转动块。 对权利要求保护范围的理解不仅包括对权利要求中记载的每一个技术特征的准确理解，即准确理解每一个技术特征的自身含义以及其所在语句的含义，还包括对权利要求中的所有技术特征之间的相互关系的准确理解以及对相互关联的技术特征所共同限定的含义作出合理解读。 具体到涉案专利，其权利要求1不仅记载了前述的转动杆和转动块的技术特征，还记载了“用于承载转动机构在板材排列方向和上下方向运动的第一驱动机构”以及“位于板材排列方向上设有用于对板材做进一步处理的加工台”。本领域技术人员基于权利要求1限定的转动杆、转动块、取放部、加工台等技术特征可以清楚理解所述板材上下料装置通过转动块前后两侧的取放部取放板材，因而所述转动杆以及其关联安装的转动块的转动角度应该为能够实现所述转动块通过上述两侧的取放部在加工台进行已加工板材和待加工板材取放换料作业所需的转动角度。即基于涉案专利权利要求1限定的板材上下料装置的组成部件，以及组成部件之间的结构、位置等关系的技术特征，结合权利要求整体， 可以确定该权利要求涵盖的正是一种转动杆和转动块可以转动180度而实现在加工台上对已加工板材和待加工板材取放换料作业的技术方案。 因而，请求人提出涉案专利权利要求1缺少转动杆“转动角度180度”的必要技术特征，并没有达到能够将权利要求1转动杆和转动块的转动角度解读为任意角度的目的。也就是说，在将证据1公开的支轴和搬送机械手与涉案专利的转动杆和转动块进行技术比对时，并不能因为涉案专利权利要求1没有直接记载转动杆和转动块的转动角度，而将权利要求1的保护范围界定为其转动杆和转动块的转动角度为任意角度，不能因此将证据1公开的可以转动（摆动）90度的搬送机械手和支轴对应为涉案专利的转动块和转动杆。 并且，对于权利要求中限定的“转动块”，该术语在本领域有其常规含义，且涉案专利说明书中并未对该术语作出特殊定义，因而本领域技术人员对于该术语的理解应当基于其在本领域的常规含义进行理解。证据1公开的一端为L型杆状、另一端为扁平方形体、作业时发生90度摆动的搬送机械手，不能定义为所属领域的“转动块”。证据1公开的上述结构和作业方式的搬送机械手以及支轴结构，事实上构成了一种摆臂结构，且由于该结构使得其必须经过临时放置台、升降机的辅助，才可以实现已加工板材和待加工板材的换料。因而证据1和涉案专利的取放板材的结构并不相同，两者的工作原理也不同，证据1不能解决涉案专利的技术问题、达到涉案专利的技术效果，虽然证据1的搬送机械手于对置的两侧设置有吸盘用于取放工件，但是其并不能如涉案专利转动杆和转动块那样转动180度即可实现已加工板材和未加工板材的取放换料。因而，转动杆以及转动块构成了涉案专利权利要求1和证据1的区别特征。 请求人进一步提出另一份现有技术即证据3公开了转动杆和转动块的结构，且作用相同。然而，从证据1附图3来看，其支轴穿设于升降机中，搬送机械手的一端成L型连接于所述支轴，这样的结构使得其只能发生前述90度的摆动，从证据1附图3公开的上述摆臂结构来说，本领域技术人员不容易想到将其穿设于升降机内部的支轴和搬送机械手的结构改变为转动杆和转动块的结构，因此，即使证据3公开了与涉案专利的转动杆和转动块作用相同的结构，由于作为最接近现有技术的证据1的限制，本领域技术人员也无法将证据1和证据3结合获得涉案专利权利要求的技术方案。 因而，在适用创造性判断的三步法进行权利要求与最接近现有技术的技术比对时，首先应当合理界定权利要求的保护范围，这往往也是无效程序中双方当事人的争议焦点。权利要求的保护范围由其记载的技术特征限定，因此对权利要求中的每一个技术特征的自身含义以及其所在语句的含义都应当进行准确理解。然而对权利要求保护范围的解读并不局限于对各技术特征的理解，权利要求中作为一个整体，其各技术特征彼此之间的关系以及相互关联技术特征的共同限定作用，也是合理解读权利要求保护范围不可或缺的内容。另外，对现有技术公开的技术内容的理解，对于专利文献类证据，应基于整个说明书（包括附图），对其公开的整体结构进行全面分析，综合考虑其要解决的技术问题、达到的技术效果，依据整体考量的结果来确定。在通过权利要求与最接近现有技术的比对确定发明实际解决的技术问题后，进一步判断现有技术整体上是否存在技术启示时，如果最接近现有技术不存在改进的基础，那么即使另一份现有技术公开了能够实现相应作用的区别特征，也不能认为现有技术整体上存在相互结合的技术启示。","link":"/Patent-Reexamination-and-Invalidation/2020-03.html"},{"title":"“一种驱动液态镜头的音圈马达及其镜头组”实用新型专利权无效宣告请求案","text":"来源：中国知识产权报 作者单位：国家知识产权局专利局复审和无效审理部 周雷鸣 季晓晖 张晔 案情介绍涉案专利名称为“一种驱动液态镜头的音圈马达及其镜头组”（专利号：ZL201820385939.8），专利权人为爱佩仪（东莞）光电科技有限公司，无效宣告请求人为华为技术有限公司。 本案涉及可应用于移动通讯设备等领域的液态镜头。液态镜头是近年来逐渐发展起来的新型镜头，不仅能在对焦和防抖方面提升图像质量，而且占用空间小，可实现手机轻薄化设计，是手机镜头未来的发展方向。 本案的主要争议焦点在于美国临时申请能否作为中国专利申请的优先权基础，以及本专利和对比文件的技术方案是否相同。由于涉及新兴技术，可供参考的背景技术资源较少，对比文件的公开日期与本专利的申请日非常接近，对技术方案的理解和把握存在一定困难和挑战。经审理，国家知识产权局作出了第46459号无效宣告请求审查决定，在专利权人提交的修改文本的基础上维持专利权有效。 典型意义本案详细阐释了美国临时申请可以作为中国专利申请的外国优先权基础的理由。本案还阐述了在新颖性评述中，应该基于本领域技术人员对技术发展一般规律的认知，注重技术方案的整体性，准确把握技术方案的实质，从而分析判断两者技术方案是否相同。 案件解析本案涉及名称为“一种驱动液态镜头的音圈马达及其镜头组”的实用新型专利（专利号：201820385939.8），专利权人为爱佩仪（东莞）光电科技有限公司，无效宣告请求人为华为技术有限公司。 涉案专利涉及液态镜头的相关技术，其保护的驱动液态镜头的音圈马达相对于对比文件1的摄像装置是否具备新颖性是本案的审理要点。对比文件1是一篇中国专利文献，其申请日晚于涉案专利的申请日，对比文件1还要求了美国临时申请文件（下称临时申请）作为优先权，优先权日在涉案专利申请日之前，因此，对比文件1是否构成涉案专利的抵触申请以评价其新颖性，首先取决于对比文件1的优先权是否成立。请求人提交了美国临时申请文件及其译文和美国专利商标局网站公开的临时申请附图的放大图，请求人认为，对比文件1的技术方案可以直接从临时申请整体记载中得出，因此对比文件1的优先权成立，同时，对比文件1公开了涉案专利的技术方案，因而涉案专利不具备新颖性。专利权人认为，临时申请与对比文件1记载的文字不同，技术方案不相同，因此对比文件1的优先权不能成立，并且对比文件1与涉案专利的技术方案也不相同，因而并不能破坏涉案专利的新颖性。由此可见，本案争议焦点实质上是：对比文件1的优先权是否成立，以及对比文件1是否公开了权利要求1的技术方案。 优先权审查中相同主题的判断根据专利法第二十九条的规定，相同的主题是核实外国优先权的判断标准之一。如果作为优先权基础的外国在先申请（即本案的临时申请）与在后申请（即本案的对比文件1）不属于相同的主题，则可以判定对比文件1的外国优先权不成立。 根据《专利审查指南》第二部分第三章第4.1.2节的规定，专利法第二十九条所述的相同主题的发明或者实用新型，是指技术领域、所解决的技术问题、技术方案和预期的效果相同的发明或者实用新型。对比文件1公开了一摄像装置，其包括液态镜片、塑性组件和驱动模块，驱动模块可使液态镜片与塑形组件之间产生相对移动，使液态镜片产生变形，改变液态镜片的焦距，实现变焦和防抖的功能，这与临时申请文字中摄像对焦装置的技术领域相同、技术原理相同、解决的技术问题相同、实现的技术效果相同。对于对比文件1说明书记载的摄像装置还包括诸如第一电磁驱动组件、第二电磁驱动组件、固定件等部件及部件之间的位置关系、连接方式以及塑型组件的大小关系等，虽然这些结构在临时申请中并没有相应的文字描述，但是文字记载方式的不同并不直接导致主题不同，技术领域、所解决的技术问题、技术方案和预期的效果相同，并不意味在文字记载或者叙述方式上完全一致。 同样，《专利审查指南》还规定，核实作为要求优先权的基础的在先申请是否涉及与要求优先权的在后申请相同的主题，即判断在后申请中所述的技术方案是否清楚地记载在上述在先申请文件（说明书和权利要求书，不包括摘要）中。具体到本案，在先的美国临时申请实际上没有采用一般专利文件所采用的权利要求书、说明书及其附图的表现形式，其通过较少的文字和较多的附图描述了摄像对焦装置的工作原理、解决的技术问题和实现的技术效果，部分部件的功能、部件之间的位置关系、大小关系、连接方式等需要借助附图来解读，此时需要站位本领域技术人员，以其整体记载的内容为准来进行判断。根据《专利审查指南》的规定，所有能够通过阅读附图直接地、毫无疑义地确定的内容也是临时申请整体记载的内容，根据整体记载的内容得到的技术方案虽然没有以文字的形式记载在临时申请中，但是如果该技术方案以附图与文字结合的形式整体表示出来，则应当认为临时申请清楚地记载了对比文件1的技术方案。当然，如果临时申请对技术方案中某些技术特征只是做了笼统或者含糊的阐述，甚至仅仅只有暗示，而对比文件1的技术方案中增加了对这些技术特征的详细叙述，以至于所属领域技术人员认为该技术方案不能从临时申请中直接、毫无疑义地得出，则不能认为两者属于相同主题的发明创造。 根据上述判断思路，对比文件1中图2A、2B、4A-4C、10A、10B记载的摄像装置与临时申请记载的摄像对焦装置两者文字存在差异、附图相同，本领域技术人员在整体阅读临时申请后能够直接地、毫无疑义地确定出对比文件1的摄像装置就是临时申请记载的摄像对焦装置，其中第一电磁驱动组件、第二电磁驱动组件、固定件在对比文件1附图中对应的部分与临时申请附图中标识的部分结构相同、位置关系相同、连接关系相同，所起到的功能相同，临时申请附图所示的塑型组件之间的大小差异与对比文件1文字记载的相同，因此对比文件1的摄像装置已记载在临时申请中，两者属于相同主题的发明创造，对比文件1的优先权成立。 新颖性审查中同样发明创造的判断根据专利法第二十二条第二款的规定，新颖性需要判断是否属于同样的发明创造。如果在先申请（即本案的对比文件1）与在后申请（即本案的涉案专利）相比，技术领域、所解决的技术问题、技术方案和预期效果实质上相同，则认为属于同样的发明创造，在后申请不具备新颖性。 《专利审查指南》第二部分第三章第3.1节规定，在进行新颖性判断时，审查员首先应当判断被审查专利申请的技术方案与对比文件的技术方案是否实质上相同，如果专利申请与对比文件公开的内容相比，其权利要求所限定的技术方案与对比文件公开的技术方案实质上相同，所属技术领域的技术人员根据两者的技术方案可以确定两者能够适用于相同的技术领域，解决相同的技术问题，并具有相同的预期效果，则认为两者为同样的发明或者实用新型。具体到本案，涉案专利权利要求1是驱动液态镜头的音圈马达，其包括座体、液态镜头、驱动装置等，其中还描述了座体的第一容纳腔、第二容纳腔与其他部件之间的位置关系，以及载体上挤压液态镜头的部件是凸出的凸环等技术特征；对比文件1的说明书（包括附图）公开了座体、液态镜片、驱动模块，但是没有第一容纳腔、第二容纳腔与其他部件之间位置关系的记载，以及挤压液态镜片的凸出的凸环。在判断新颖性时，本领域的技术人员可以借助于对比文件的附图和文字描述整体确定出技术方案，其中包括了隐含的，可直接地、毫无疑义地确定的技术内容，还包括可以借助下位概念、所属技术领域的惯用技术手段置换得出的技术内容，可以将该技术方案与涉案专利权利要求1的技术方案进行对比，如果相同，则可认为涉案专利权利要求1的技术方案已被对比文件公开。 本案对比文件1没有两个容纳腔的记载，即便本领域的技术人员根据对比文件1的技术方案人为地划分出两个容纳腔，基于其他部件的工作原理和安装方式，仍然不能够直接地确定出与涉案专利两个容纳腔与这些部件之间具有相同的位置关系；并且对比文件1仅公开了液态镜片上连接有近似环状的部件，对比文件1中缺少挤压液态镜片部件的相应描述，即便认为采用凸出的凸环结构能够带来更好的技术效果是容易想到的，也不能认为对比文件1公开了该容易想到的技术方案，这已经超出了新颖性的判断范畴。因此，对比文件1与涉案专利权利要求1的技术方案实质上并不相同，对比文件1不能破坏涉案专利的新颖性。 优先权与新颖性判断标准比较及带来的启示基于上述审查思路可知，优先权需要判断两者是否属于相同主题的发明创造，即两者的“四要素”是否相同，审查新颖性时则需要判断两者是否属于同样的发明或者实用新型，具体到技术方案则是判断两者的技术方案是否实质上相同。笔者认为从本案审理思路可以得到以下启示： 第一，不论是优先权还是新颖性的审查都需要站位本领域技术人员对技术领域、技术问题、技术方案、技术效果等“四要素”进行对比。在优先权相同主题的判断中，“四要素”的判断顺序没有明确的要求，实践中可能存在先判断是否属于相同的技术领域，再判断是否属于相同的技术方案、解决相同的技术问题、具有相同的技术效果，也会因为技术领域不同而终止其他要素判断；在新颖性同样的发明或者实用新型的判断中，《专利审查指南》规定了应当先判断技术方案是否实质相同，再判断是否适用于相同的技术领域、解决了相同的技术问题、达到了相同的技术效果。 第二，在优先权审查和新颖性审查中，均是与在先申请或者对比文件整体记载的技术方案进行比较，同时两者对于技术方案内容的判断原则存在差异。从本案看，优先权成立时临时申请与对比文件1的技术方案必须相同，这种相同不是指文字描述上完全相同，而是指对比文件1的技术方案，是临时申请中客观存在的技术内容，是能够从临时申请中直接地、毫无疑义地确定的技术内容，不包含任何依靠放大附图推测的特征、通过测量附图中尺寸得到的特征以及惯用技术手段置换得到的特征；而新颖性判断中技术方案实质上相同，可以是与对比文件文字或附图记载的内容不相同的技术方案，包括采用下位概念，惯用技术手段的直接置换以及落在数值范围内的技术方案等。","link":"/Patent-Reexamination-and-Invalidation/2020-04.html"},{"title":"“利用直流&#x2F;DC电源的分布式功率收集系统”发明专利权无效宣告请求系列案","text":"来源：中国知识产权报 作者：顼晓娟 唐向阳 傅 玉 案情介绍本系列无效宣告案件共涉及两项专利权，名称分别为“利用直流电源的分布式功率收集系统”（专利号：ZL200780045351.2）和“使用DC电源的分布式功率收集系统”（专利号：ZL201210253614.1），专利权人均为太阳能安吉科技有限公司，无效宣告请求人均为华为技术有限公司。 光伏产业是近年来发展迅速的新兴产业。近几年，两公司在国内外发起了多起无效宣告和侵权纠纷，对业界产生了广泛影响。本系列案件审理过程中涉及两个疑难问题，一是如何准确合理地理解权利要求中的争议技术特征，二是如何客观把握技术启示的判断，以最大程度地避免在创造性判断中带入主观因素。经审理，国家知识产权局作出第47398号和第47400号无效宣告请求审查决定，宣告上述两项专利权无效。 典型意义本系列案诠释了在专利确权程序中，对理解存在争议的技术特征，应站位本领域技术人员，以专利公开的内容为基础，以本领域的通常含义来理解，在充分考虑双方当事人意见基础上作出准确认定。这样既可以厘清专利发明构思的应有之义，又可以保障公众的信赖利益。本系列案还诠释了在判断技术启示时，如何考量其他现有技术与最接近现有技术之间是否能够架起技术上结合的“桥梁”，最终实现对权利要求创造性的客观评判。 案件解析本系列案涉及专利号为ZL201210253614.1、发明名称为“使用DC电源的分布式功率收集系统”（下称614号专利无效案）以及专利号为ZL200780045351.2、发明名称为“利用直流电源的分布式功率收集系统”（下称351号专利无效案）的两个发明专利的无效宣告请求，无效宣告请求人均为华为技术有限公司，专利权人均为太阳能安吉科技有限公司。 权利要求的理解如果权利要求的保护范围未能准确确定，那么创造性的评判将成为空中楼阁，经不起推敲和检验。因此，准确理解权利要求，进而准确确定权利要求的保护范围，是新颖性、创造性评判的基础。 在614号专利无效案中，在对权利要求1创造性进行审查的过程中，双方当事人首先对于权利要求1中“接收来自温度传感器的温度信号，所述温度传感器连接到所述控制器的输入端且适合于测量所述功率变换器中的或所述功率变换器的环境中的温度；以及基于所述温度信号来减小所述输入端子处的所述输入功率”的理解产生争议。专利权人认为，上述技术特征应理解为，在基于温度信号减小功率变换器的输入功率的前提下，根据实际情况使功率变换器的输入功率尽可能大；由此，基于温度信号的输入功率不再是太阳能电池板的最大功率点，而是视情况尽可能地保持输入功率最大化。而请求人对此持有不同意见，认为“最大化”和“尽可能大”是两个不同的概念，本专利的“最大化”功率是指太阳能电池板的最大功率点。本专利说明书既没有公开“尽可能大”的技术方案，也没有描述如何实现“尽可能大”的技术手段。因此，614号专利无效案的争议焦点在于，如何理解权利要求1的上述争议技术特征从而准确确定权利要求1的保护范围。 合议组站位本领域技术人员，通过阅读权利要求书、说明书及其附图，在充分了解本专利技术方案的基础上，依据本领域通常含义理解，必要时参考双方当事人的意见，对上述争议技术特征如何理解进行了详细审查。合议组经查认为，本专利说明书关于上述争议技术特征主要存在三处相关记载。根据说明书的三处相关记载，结合本专利的发明构思可知，涉及上述争议技术特征的技术方案为，使用温度传感器测量功率变换器中或者功率变换器的环境中的温度，根据测量的温度信号，调节功率变换器的输入功率，当温度信号处于正常范围时，直接将功率变换器输入端的最大化输入功率转换成输出功率；当温度信号异常时，基于温度信号，减小功率变换器的最大化输入功率，降低功率变换器的温度，提高系统可靠性。由此可见，本专利主要关注基于温度信号调节功率变换器的最大化输入功率，因此上述争议技术特征应理解为，基于温度信号减小功率变换器输入端的最大化输入功率。本专利并未公开专利权人解读的“尽可能大”的技术方案，专利权人的上述解读延伸了争议技术特征限定的技术内容，引入了本专利从未公开的技术手段，这种不合理的延伸损害了公众的公示信赖利益，因而合议组不予接受。 综上，614号专利无效案的启示在于，在专利确权程序中，如果对权利要求某技术特征的理解存在争议，则首先需要准确理解这些技术特征，进而确定权利要求的保护范围，以避免因理解的差异造成对新颖性和创造性的误判。对权利要求的理解，应站位本领域技术人员，以专利公开的内容为基础，以本领域的通常含义来理解，在充分考虑双方当事人意见基础上作出准确认定。这样既可以厘清专利发明构思的应有之义，又可以保障公众的信赖利益。专利权人也应当在合理的范围内对争议技术特征进行解读，如果专利权人意图通过过度解读争议技术特征，以规避现有技术，或者引入专利文件从未公开的技术手段，则不仅不利于准确确定专利保护范围，而且还损害了公众的信赖利益，合议组将不予支持。 创造性评价中对技术启示的判断在351号专利无效案中，通过阅读本专利和证据1，我们可以梳理出本专利的技术发展路线，本专利背景技术中的传统太阳能发电系统包含单个MPPT模块，这种传统技术存在如下技术缺陷，即每个太阳能电池板无法工作在其最大功率点下，实现太阳能电池板的最大功率输出。为了最大化地提取来自太阳能电池板的输入功率，太阳能发电系统改进为包含多个MPPT模块，为每个太阳能电池板均提供一个MPPT模块。此时，将存在两种技术发展路径，路径一为将包含MPPT模块的多个功率变换器串联连接到逆变器，路径二为将包含MPPT模块的多个功率变换器并联连接到逆变器，这两种技术发展路径均为本专利背景技术所记载的现有技术。随着技术进一步的发展，为了防止逆变器输入电流增加，在逆变器中设置控制部分，用于将逆变器输入电压保持为预定值。沿路径一在功率变换器串联连接的基础上，结合逆变器输入电压保持为预定值，发展成为本专利的技术方案，沿路径二在功率变换器并联连接的基础上，结合逆变器输入电压保持为预定值，发展成为证据1的技术方案。 基于此，权利要求1与证据1相比，其主要区别在于每个变换器包括与其它变换器串联连接的输出终端，从而构成了一个串联串以及与串联串连接的能量供应器。基于上述区别技术特征，权利要求1实际解决的技术问题是提供低复杂度、可靠、灵活的控制方式，使其功率输出最优。而证据3公开了上述区别技术特征，并且证据3中的该特征也起到了与上述区别技术特征相同的作用。由此可见，351号专利无效案的争议焦点是证据３是否给出将区别技术特征应用于证据１以解决本专利实际所要解决技术问题的技术启示。 关于是否存在技术启示，专利权人提出了两个意见。意见一为，权利要求1的技术特征“MPPT模块的最大功率输出”与“逆变器输入电压保持在预定值”需整体考虑，不能割裂。对此，合议组经审查认为，应在把握专利发明构思的基础上，分析权利要求中各技术特征在能够解决的技术问题、采用的技术手段、实现的技术效果等方面是否相互依存，确定各技术特征间是否存在协同配合的关系，从而合理划分区别技术特征。在本案中，基于MPPT模块的工作原理，MPPT模块的最大化功率输出是由太阳能电池板输出的电流和电压决定，而逆变器输入电压保持为预定值由功率变换器的输出电压决定，即便逆变器的输入电压未保持在预定值上，功率变换器仍然可以基于MPPT算法实现最大功率输出，反之亦然。因此，经过对权利要求1技术方案的整体考量，权利要求1的上述两个技术特征由于实现的技术手段、解决的技术问题以及产生的技术效果彼此相互独立，不存在协同配合关系，因此在划分区别技术特征时不必捆绑为一个区别技术特征。专利权人的意见二为，证据1的逆变器输入电压为固定值，而证据3中的逆变器输入电压不是固定值，因此证据1的控制方式与证据3的控制方式彼此背离，存在技术结合障碍。对此，合议组经审查认为，证据3公开了将串联的功率变换器连接在360V稳压直流总线，之后连接逆变器，并且功率变换器串联串的输出电压必须相等。由此可知，证据3的逆变器的输入电压也为固定值。可见，证据3和证据1均能将逆变器的输入电压保持在预定值，证据3与证据1之间的控制方式相同，不存在技术结合的障碍。证据3公开的技术方案能够引发本领域技术人员对证据1产生改进的动机，在证据1与证据3之间能够架起技术结合的“桥梁”，即证据３给出了将区别技术特征应用于证据１中以解决本专利所要解决的技术问题的技术启示。 综上，本案例的启示在于，创造性判断“三步法”中最关键也是最易于带入主观因素的判断步骤在于第三步“判断要求保护的发明对所属技术领域的技术人员来说是否显而易见”，即判断其他现有技术是否给出了将区别特征应用到最接近现有技术以解决发明实际所要解决的技术问题的技术启示。为了最大程度地避免在创造性判断中带入主观因素或者引入后见之明，保证创造性判断结论的客观性，在判断第三步的技术启示时，要着重考虑其他现有技术与最接近现有技术之间是否能够架起技术结合的“桥梁”。对于是否能够架起技术结合的“桥梁”，不仅要考虑其他现有技术公开的技术手段与区别技术特征是否实质上相同，其他现有技术公开的技术手段在其他现有技术的整体技术方案中所起的作用与区别技术特征在本专利中实际所要解决的技术问题是否客观上相同，由此是否引发本领域技术人员对最接近现有技术产生改进的动机，还要整体考量权利要求技术特征之间是否存在协调配合关系以及考虑其他现有技术与最接近现有技术之间是否存在技术上结合的障碍，最终实现对权利要求是否具备创造性的客观评判。","link":"/Patent-Reexamination-and-Invalidation/2020-02.html"},{"title":"“无线通信系统”发明专利权无效宣告请求案","text":"来源：中国知识产权报 作者：程 华 案情介绍涉案专利名称为“无线通信系统”（专利号：ZL01819676.4），专利权人为夏普株式会社，无效宣告请求人为OPPO广东移动通信有限公司。 通信领域技术发展快、社会影响大，专利“战火”连绵不断。2020年，夏普先后在多地发动针对OPPO的一系列专利侵权诉讼。为应对夏普“意在市场”的专利诉讼，OPPO针对相关专利提交了多件专利权无效宣告请求。该系列专利纠纷因涉及专利数量多、经济利益大，受到了业界的广泛关注。本案即是双方专利大战中的一件。 本案审理过程中，专利权人对权利要求作出了修改。双方的争议焦点在于无效程序中关于权利要求中明显错误的认定，以及如何理解和把握我国《专利审查指南》中“权利要求的进一步限定”式修改的要求。经审理，国家知识产权局作出第46741号无效宣告请求审查决定，宣告涉案专利无效。 典型意义本案涉及在无效程序中对权利要求中明显错误的修改的审查标准，即修改后的内容应该是根据说明书和权利要求的记载可以直接、毫无疑义确定的唯一答案，并不存在作其他解释或修改的可能。本案还从《专利审查指南》中对“权利要求的进一步限定”式修改的目的与要求出发，结合涉案专利的技术实质，充分论述了该修改方式不仅要求在形式上增加新的技术特征，而且要求在实质上针对授权公告权利要求的主题作出进一步缩小保护范围的修改。 案件解析OPPO广东移动通信有限公司（下称请求人）就专利权人夏普株式会社的第01819676.4号发明专利提出无效宣告请求。针对无效宣告请求人提交的无效理由和证据，专利权人将保护主题为无线通信系统的权利要求1中有关同步装置限定的技术特征补入到保护主题为基站的权利要求4中，并对权利要求4、6中认为是明显错误之处进行修正。请求人认为上述修改不符合现行的专利法实施细则第六十九条的规定。本案的争议焦点之一就是专利权人对权利要求所作修改是否满足《专利审查指南》（下称《审查指南》）关于修改方式中对权利要求进一步限定的要求，专利权人认为的“明显错误”是否明显。本文结合该无效宣告请求案，重点讨论具体如何掌握关于权利要求进一步限定的判断标准，并对明显错误的认定提供借鉴。 在无效审查阶段，针对请求人提出的无效理由，为避免专利权被宣告无效，专利权人希望以更加灵活的方式，将发明对现有技术做出贡献的技术特征限定到权利要求中，从而使其权利更稳定。出于维护授权专利权利要求的公示作用、平衡专利权人权利和社会公众的信赖利益等多方面考虑，专利法实施细则第六十九条以及《审查指南》第四部分第三章4.6节无效宣告程序中对专利文件的修改中对修改原则、修改方式及其限制作出规定。 专利法实施细则第六十九条规定：“在无效宣告请求的审查过程中，发明或者实用新型专利的专利权人可以修改其权利要求书，但是不得扩大原专利的保护范围。”具体如何修改，《审查指南》第四部分第三章4.6.1节“修改原则”中规定：“发明或者实用新型专利文件的修改仅限于权利要求书，其原则是：（1）不得改变原权利要求的主题名称。（2）与授权的权利要求相比，不得扩大原专利的保护范围。（3）不得超出原说明书和权利要求书记载的范围。（4）一般不得增加未包含在授权的权利要求书中的技术特征。” 4.6.2节“修改方式”中规定，在满足上述修改原则的前提下，修改权利要求书的具体方式一般限于权利要求的删除、技术方案的删除、权利要求的进一步限定、明显错误的修正。权利要求的进一步限定是指在权利要求中补入其他权利要求中记载的一个或者多个技术特征，以缩小保护范围。 专利权的保护范围以权利要求的内容为准，为保有其专利权，专利权人通常会在无效程序中采用进一步限定的方式修改权利要求，或者对明显错误进行修正。根据上述规定，权利要求的进一步限定，允许以补入其他权利要求中记载的技术特征的方式修改权利要求，并不等于允许对权利要求书中记载的技术特征进行任意的组合，其要求修改必须在实质上达到在授权权利要求保护范围的基础上进一步缩小原有保护主题的保护范围。关于明显错误，审查指南第二部分第八章5.2.2节“允许的修改”中对于符合专利法第三十三条规定的修改给出了规定，其中在第5.2.2.2节“对说明书及其摘要的修改”中对“明显错误”规定：“（11）修改由所属技术领域的技术人员能够识别出的明显错误，即语法错误、文字错误和打印错误。对这些错误的修改必须是所属技术领域的技术人员能从说明书的整体及上下文看出的唯一的正确答案。”基于相同的原则，权利要求中的明显错误也应是所属技术领域的技术人员明显就能够识别出的，并且其修改应当是唯一确定的。 本案中，现有技术存在移动站间直接通信和基站与移动站间通信的帧不同步，导致用户需要在两种模式间频繁切换的技术问题，涉案专利的移动站利用基站与移动站间通信的控制信息实现使基站与移动站间通信和移动站间直接通信的帧同步。授权专利的权利要求，其第一组权利要求保护的主题是“一种无线通信系统”，第二组权利要求保护的主题是“一种无线通信系统中的基站”。在无效程序中，专利权人对第二组权利要求中的权利要求4和6进行了修改。本案的审理焦点之一在于对无效审查文本的确定。 “权利要求的进一步限定”的修改要求——“缩小保护范围”授权专利权利要求4要求保护一种无线通信系统中的基站，限定了在基站处执行的资源分配。虽然专利权人新增的有关同步装置的特征是本专利授权文本其他权利要求中记载的一个技术特征，从行为上看，满足了“权利要求的进一步限定”的形式要件，但从该修改行为带来的结果上看，仍需进一步分析这种限定是否实质上“缩小保护范围”。具体而言，专利权人在权利要求4中新增加了关于同步装置的技术特征，而有关同步装置的特征是对无线通信系统的限定，所谓的“同步”实际上是移动站根据基站移动站间通信所使用的控制信息来校准以达到移动站与基站、移动站与移动站之间的帧同步，“同步装置”的操作实际上是移动站完成的，移动站是否完成同步操作无需反馈基站，针对移动站的“同步”操作，基站也并不需要做出相应的调整以配合移动站的“同步”操作，同步操作也并不会对基站后续的资源分配造成影响。也即，基站实质上仍旧只是完成根据请求执行资源的分配，新增的技术特征并没有对与基站的构成或功能等有具体的限定作用，并不能有效地限缩保护主题为基站的权利要求4的保护范围。 考虑到授权公告的权利要求的公示作用：公示专利权人所拥有的排他性权利的范围，社会公众据此可以明晰专利权利边界，预测、评价自身行为是否侵犯专利权。如果权利要求在修改的基础上被维持有效，则该修改后的权利要求对社会公众而言也应当是可以预见的，即有脉络清晰的修改预期。根据授权专利权利要求的内容，社会公众并不能预见到在对要求执行通信资源分配的基站的保护中还应当包括有移动站执行与基站同步的装置，也就是说，专利人的这种修改并不是社会公众可以预期的合理修改方式。 从实体的技术内容上把握对明显错误的认定在行政程序和司法程序中，均允许专利权人对属于明显错误之处进行修正性解释，现行审查指南中也明确规定可以对明显错误进行修正。如果属于明显错误，本领域技术人员应当是能够识别并唯一确认的，但在实际审查过程中，某些专利权人认为非改不可的内容并不都属于明显错误的范畴。对明显错误的认定需要结合具体的技术内容来把握。 具体到本案，首先，根据本领域技术人员对涉案专利技术方案的整体理解，权利要求4、6中的“帧内频带”，权利要求6中的“根据进行移动站间直接通信的终端的组合和分配给基站移动站间通信的上述第一频率，来选定分配给进行移动站间直接通信的终端的上述第二频率”无明显的语法错误、文字错误或打印错误。 其次，“帧内带”不是本领域的公知术语，涉案专利说明书中也没有对“帧内带”做出具体的解释限定，根据专利权人的主张，本领域技术人员也无法直接地、毫无疑义地将“帧内带”具体理解为帧内的时间区域。权利要求4中仅限定了两种通信方式所使用的频率不同，权利要求6进一步限定根据进行直接通信的终端的组合情况和分配给基站移动站间通信的第一频率，来选定分配给直接通信的终端的第二频率，即具体分配的依据，并无矛盾或逻辑错误。专利权人将“帧内频带”修改为“帧内带”，将权利要求6的 “根据进行移动站间直接通信的终端的组合和分配给基站移动站间通信的上述第一频率，来选定分配给进行移动站间直接通信的终端的上述第二频率”修改为“根据进行移动站间直接通信的终端的组合和分配给基站移动站间通信的上述第一频率的帧内带，来选定分配给进行移动站间直接通信的终端的上述第二频率的帧内带”，上述修改后的内容并不是根据说明书的整体及上下文能唯一确定的技术手段，还存在作其他解释或者修改的可能。因此，上述修改并不属于《审查指南》规定的能够允许修改的明显错误的范畴。 由于专利权人对权利要求所做修改不能被认定为是对权利要求的进一步限定，或是对明显错误的修正，因此，其修改不符合专利法实施细则第六十九条的规定，合议组对专利权人提交的权利要求修改文本未予以认可。本案合议组经审理，在涉案专利授权公告的权利要求书内容的基础上，详细论述了涉案专利权利要求不具备新颖性、创造性的理由，并作出第46741号无效宣告请求审查决定，宣告本专利全部无效。 综上，权利要求的进一步限定是专利权人在无效程序中采用的会影响权利要求保护范围的主要修改方式，对无效审查文本的确定，是无效审理的基础。为克服权利要求可能存在的缺陷，更好地保护发明创造，现行《审查指南》规定了专利权人在无效宣告程序中可采用进一步限定的方式修改授权专利的权利要求，但专利权人做出的这种被动修改也需要受到一定的限制。在审查实践中合理适用专利法、专利法实施细则以及《审查指南》关于无效程序中对专利文件修改的相关规定，既在较大程度上维护了专利权人的利益，鼓励发明创造，又兼顾了权利要求的公示作用，保护社会公众的信赖利益。","link":"/Patent-Reexamination-and-Invalidation/2020-05.html"},{"title":"“用于移动通信终端的图形用户界面”外观设计专利权无效宣告请求案","text":"来源：中国知识产权报 作者：陈淑惠 樊晓东 案情介绍涉案专利名称为“用于移动通信终端的图形用户界面”（专利号：ZL201830455426.5），专利权人为北京金山安全软件有限公司，无效宣告第一请求人为上海触乐信息科技有限公司，第二请求人为上海萌家网络科技有限公司。 本案专利涉及一种输入法的图形用户界面。随着移动终端应用商店中输入法应用的大量出现，围绕输入法应用的GUI专利纠纷也燃起战火。2019年，金山公司主张触乐公司、萌家公司、北京智慧章鱼有限公司输入法产品的GUI侵犯其专利权，提起侵权诉讼。随后，这3家公司先后多次就涉案专利提起无效宣告请求。 本案涉及GUI外观设计专利的多个判断难点，包括如何确定GUI的保护范围、是否属于专利法保护的客体、设计特征的组合能否成立、静态GUI和动态GUI如何判断等。经审理，国家知识产权局作出第44580号和第44582号无效宣告请求审查决定，宣告涉案专利设计1至7无效，在设计8至10的基础上维持专利权有效。 典型意义本案阐明了在现行法律框架下，确定没有显示图案的GUI空白区域的保护范围时，其界面视图（特别是空白区域）和交互方式的确定需要结合图片和简要说明作客观分析和判断。本案的指导意义在于，指引创新主体进行GUI外观设计专利申请时需根据GUI类型明确其保护重点，以便清晰界定其保护范围。 案件解析针对专利权人北京金山安全软件有限公司的名称为“用于移动通信终端的图形用户界面”、专利号为ZL201830455426.5的外观设计专利，上海触乐信息科技有限公司（下称第一请求人)、上海萌家网络科技有限公司（下称第二请求人）先后提出了无效宣告请求，国家知识产权局经审理，作出第44580号和44582号审查决定，宣告涉案专利设计1至7无效，设计8至10维持有效的结论。 涉案专利包含10项相似设计，设计5是基本设计。第一请求人和第二请求人均主张涉案专利没有体现具体的交互方式，不属于GUI保护的客体，不符合专利法第二条第四款的规定，同时，第一请求人提交22个证据，使用67种组合方式，第二请求人提交11个证据，使用539种组合方式，主张涉案专利不符合专利法第二十三条第二款的规定。本案的争议焦点主要在于：一、涉案专利保护范围的界定；二、GUI中能够用于组合的设计特征的特点；三、静态GUI和动态GUI视觉效果的判断。本文通过还原该案的审理过程，围绕这几个争议焦点对案件进行全面的解读和分析。 涉案专利保护范围的界定专利法第五十九条第二款规定了外观设计专利权的保护范围，对于包括GUI的产品的外观设计，如果涉案专利其余部分的设计为惯常设计或现有设计，其GUI对整体视觉效果更具有显著影响。此外，在界定GUI保护范围时，和实体类产品不同，GUI不仅需要确定界面视图表示的内容，还需要明确其交互方式，但是由于GUI具有多层级框架的特殊性，其界面视图（特别是空白区域）和交互方式的确定往往需要结合参考图和简要说明进行客观判断。 具体到本案，涉案专利包含移动通信终端的形状及GUI设计，双方当事人对终端外形为现有设计均无异议，因此图形用户界面对整体视觉效果更具有显著影响。结合其简要说明，涉案专利设计1至7要求保护静态GUI界面，设计8至10要求保护动态GUI界面。对于设计1至10的上部留白区域，主视图均显示该部分为空白，仅以参考图说明该部分可能为显示区域，会随着其他区域输入内容变化而变化；对于下部留白区域，设计1至6、设计8、设计9中主视图均显示该部分为空白，但结合参考图和简要说明可以确认该部分为未显示键盘的键盘输入区域；设计7和10中主视图显示该部分为显示键盘的键盘输入区域；对于交互方式，结合参考图和简要说明，设计1至7为使用者连续点击键盘区域时可以控制进度条变化，设计8和9中键盘、进度条、金币图标产生关联动态效果，设计10中键盘、进度条、金币图标产生关联动态效果，并在金币图标全产生扩散效果后切换到弹出框界面。很明显，设计1至10具有明确的交互方式，但是静态GUI界面和动态GUI界面中金币图标的交互方式并不相同,金币图标在静态GUI界面中只能视为单纯的图案，而在动态GUI界面中金币图标则和键盘、进度条等具有关联动态效果。 因此，虽然参考图不能对GUI界面的保护范围进行限定，但是可以通过参考图进一步解释视图和简要说明中明确的GUI交互方式，意即如果交互方式的操作属于GUI的常见操作，即使该过程未通过主视图予以体现，若一般消费者通过参考图示范的使用场景，并结合简要说明已经可以清楚理解涉案专利所示界面的实现方式，那么就可以认为已经体现并明确了交互方式；参考图可以用于说明其使用方法、使用场所等，但其具体内容并非涉案专利的保护范围。另外，如果提交的视图中某个区域为空白区域，应该认为它的设计内容为空白，而不能认为只要用途相同的界面就落入它的保护范围。 GUI中能用于组合的设计特征GUI的特点在于：一是在三维空间存在多个层级；二是其静态界面通常采用网格化布局的框架结构，因此具有相同或相近用途的同一层级或区块的设计特征以及GUI的常见控件通常可以进行组合；三是其动态界面往往是多个设计特征关联产生，组合时还要考虑交互方式及效果。故而对于GUI的组合，需要依据一般消费者的知识水平和认知能力，综合考虑其界面用途、区域模块布局、交互方式、层级结构等多方面进行判断。 具体到本案，在众多的组合方式中，如果是静态界面的图案之间的替换，那么因具有明显启示可以组合。例如证据2.1为进度条输入界面，其左侧为可伸缩变化的进度条，右侧为外方内圆的图标，视图中未体现且简要说明中也未解释该图标的具体交互方式，应将其视为单纯图案。证据2.2为一张涉及GUI的素材图片，其上每一个素材都应视为单独的图案。由于证据2.1右侧图标为图案设计，一般消费者在其主视图界面基础上很容易想到将右侧图标使用其他图案进行替换，因此存在将证据2.1和证据2.2中的某一个图案进行组合的启示，二者可以组合（参见图1）。但是如果交互方式和动态效果明显不同，那么则因不具有启示不能进行组合。例如证据1.3为进度条界面，会随着下方手写输入区域中的输入文字的变化而变化，证据1.11是游戏界面，其下方是游戏操作区域，上方是游戏状态表现区域，其上方的进度条、星星等图标会随着下方操作区域的变化而变化，证据1.3和证据1.11的区域模块划分和动态效果均完全不同，二者不能进行组合（参见图2）。 静态GUI和动态GUI的判断对于静态GUI，应当考虑区域模块布局、交互方式、层级结构以及各区域的具体设计。具体到本案，以涉案专利设计1为例，由于设计1主视图界面与组合后界面的区域模块划分相近，交互方式、进度条设计区域中进度条所处位置相同，形状相近，右侧均有三个并行排列的类圆形图案，上述相同点已经使得二者形成了较为接近的整体视觉效果，其区别点尚不足以对整体视觉效果产生显著影响。因此涉案专利设计1与现有设计特征的组合相比不具有明显区别，不符合专利法第二十三条第二款的规定。 对于动态GUI，应当考虑整个动态变化过程，不仅包括能够产生动态效果的各个模块设计，还包括相互之间形成的变化趋势、动态界面的设计特征、变化过程等，作为一个整体设计不可分割。具体到本案，以涉案专利设计8为例，将设计8与组合后界面对比时，尽管二者主视图界面的设计有相似之处，但由于二者的动态变化过程，即具体的动画联动效果明显不同，体现在中间具体界面的内容以及呈现给最终消费者的动画效果亦会随之不同，不仅影响消费者的视觉观感，也使得二者的整体视觉效果差异显著。因此涉案专利设计8与现有设计特征的组合相比存在明显区别，符合专利法第二十三条第二款的规定。 通过分析本案，可见在GUI外观设计的无效审查中，首先，应当明确其保护范围，其界面视图和交互方式的确定往往需要结合图片和简要说明进行客观判断。只有清晰界定保护范围，才能明确其是否属于GUI保护的内容，并在具体判断时有的放矢，对判断客体进行针对性的比对。其次，无效请求人在提出无效理由时，应当深入分析各个特征，选择合适的无效理由。组合方式并非越多越好，排列组合虽然增加了无效理由的数量，但是并不会增加无效的可能性，是否能够组合，应当根据涉案专利的类型，综合考虑其界面用途、区域模块布局、交互方式、层级结构等多方面进行判断。最后，关于GUI外观专利的整体视觉效果，应当基于不同类型的GUI有所不同。比如，对于单个静态的GUI界面来说，主要考虑区域模块布局、交互方式、层级结构以及各区域的具体设计。如果视图中未体现，且简要说明中未解释某区域图标的具体交互方式，则将其视为单纯图案。而对于多界面的GUI及动态GUI，单个界面的布局往往并不能对整体视觉效果有决定性影响， 应当考虑整个动态变化过程，不仅包括能够产生动态效果的各个模块设计，还包括相互之间形成的变化趋势、动态界面的设计特征、变化过程等，作为一个整体设计不可分割。","link":"/Patent-Reexamination-and-Invalidation/2020-06.html"},{"title":"“丁苯酞环糊精或环糊精衍生物包合物及其制备方法和用途”发明专利权无效宣告请求案","text":"来源：中国知识产权报 作者：姜小薇 案情介绍涉案专利名称为“丁苯酞环糊精或环糊精衍生物包合物及其制备方法和用途”（专利号：ZL02123000.5），专利权人为石药集团中奇制药技术（石家庄）有限公司和石药集团恩必普药业有限公司，无效宣告请求人为张艺颖。 涉案专利涉及国产创新药丁苯酞，该药是我国第三个自主研发的一类新药，是全球第一个以“缺血性脑卒中治疗”为主要适应症的全新化学药物。丁苯酞系列药物曾获“国家战略性创新产品”证书。丁苯酞注射液受到医疗界和患者的广泛认可。但丁苯酞本身呈油性，将丁苯酞制成注射剂，必须首先解决其不溶于水的问题。 涉案专利使用羟丙基-β-环糊精包合丁苯酞，制成了一种改善丁苯酞水溶性的包合物，解决了丁苯酞难溶于水的问题。本案中双方的主要争议焦点在于对其创造性的认定。经审理，国家知识产权局作出第43478号无效宣告请求审查决定，维持专利权有效。 典型意义化学药品的价值很大程度上取决于技术效果，技术效果是判断化学药品发明创造性的重要因素。本案在深入理解现有技术的基础上，挖掘实验数据背后所反映的技术信息，站位本领域技术人员恰当认定药物所具备的医学价值，对准确评价化学药品发明的创造性，尤其是对于已知化合物的改进型发明如何评价其创造性具有一定的借鉴意义。 案件解析涉案专利“丁苯酞环糊精或环糊精衍生物包合物及其制备方法和用途”（专利号：ZL02123000.5）涉及我国脑血管病领域第一个拥有自主知识产权的I类创新药物“丁苯酞”，其适应症为缺血性脑卒中（即脑梗死）。专利权人为石药集团中奇制药技术（石家庄）有限公司、石药集团恩必普药业有限公司。丁苯酞本身呈油性，因此化合物本身只能制备为胶囊剂口服给药，起效较慢。涉案专利中，使用具有空腔结构的羟丙基-β-环糊精包合丁苯酞，很大程度上提高了丁苯酞的水溶性，从而制备出丁苯酞氯化钠注射液，通过静脉给药使其能够快速抵达人体脑部，重构血液微循环，广泛用于救治急性缺血性脑卒中病患。 2010年，丁苯酞氯化钠注射液被评为中国“十大重磅处方药新品种”之首；2013年“十二五”重大科技专项丁苯酞氯化钠注射液Ⅳ期临床试验项目取得了突破性的进展，并荣获“国家战略性创新产品”奖项；2014年，恩必普药业也因丁苯酞产业项目获得中国工业大奖。2020年，丁苯酞系列药品的销售额已经超过70亿元，其中注射剂销售额约为47.4亿元。 针对涉案专利，专利权人在2018年的确权程序中对其权利要求的保护范围进行了限缩，将用于包合丁苯酞的物质具体限定为羟丙基-β-环糊精。 本案中，无效请求人提起无效请求的理由为全部权利要求不具备创造性，国家知识产权局经审理，作出第43478号无效宣告请求审查决定，维持该专利权有效。 涉案专利的权利要求1保护一种丁苯酞环糊精衍生物包合物，其特征在于：含有丁苯酞和环糊精衍生物，丁苯酞与环糊精衍生物的分子摩尔比为1:1-10；环糊精衍生物为羟丙基-β-环糊精。 本案焦点集中在创造性的判断，请求人共使用了3组证据。在第一组证据使用方式中，最接近的现有技术是证据1。 证据1公开了芹菜甲素（即丁苯酞）具有广谱抗惊作用，证据1还公开了芹菜甲素在制备预防和治疗脑缺血引起的疾病，尤其是缺血性脑神经元损伤和坏死的药物中的应用。涉案专利权利要求1与证据1相比，区别在于：证据1未公开丁苯酞由羟丙基-β-环糊精包合；证据1未公开丁苯酞和环糊精衍生物二者分子摩尔比为1:1-10。 根据涉案专利说明书的记载，无论是治疗因脑缺血引起的各类疾病，还是治疗血栓，都无一例外地需要所使用的药物制剂具有快速释放、迅速达到治疗效果的目的，采用静脉滴注是临床上对于急性病症的最常用方法，由于丁苯酞呈油性，只能将其简单地制成软胶囊供口服使用，因此将丁苯酞制成注射剂，必须首先解决其不溶于水的问题。涉案专利通过环糊精或环糊精衍生物对丁苯酞的包合作用，来提高丁苯酞的水溶性，解决了丁苯酞水溶性低，不能直接用于注射剂型的欠缺，经测定在25℃时，丁苯酞羟丙基-β-环糊精包合物在水中的溶解度达924mg/100ml。可见，基于上述区别，权利要求1实际解决的技术问题是提供一种改善丁苯酞水溶性的包合物。 请求人主张，大量证据表明，羟丙基-β-环糊精或类似的环糊精及环糊精衍生物可以用来包合多种药物，解决药物水溶性差的技术问题，因此本领域技术人员根据这些证据给出的技术启示能够想到使用羟丙基-β-环糊精包合丁苯酞，从而得到涉案专利的包合物。对此，合议组分别考察了这些证据，由于篇幅限制，仅以证据2和证据4为例来展开讨论。 证据2涉及“药物的溶解性可以通过转化为无定形态或通过以环糊精包合而得到改善”的技术内容，其要解决的技术问题是获得稳定的无定形态药物，有效阻止药物结晶。证据2给出了34种药物通过羟丙基-β-环糊精等环糊精衍生物增溶效果的数据，其中包合后的药物溶解度最大为238mg/ml，最小为0.2mg/ml，相差1000多倍，而且不同药物包合前后溶解度的变化情况也差异巨大，增溶作用从增加不到1倍到增加到三个数量级不等，增溶效果参差不齐。而且，这34种药物绝大多数为固体形态，在结构上与丁苯酞也并不相近。 请求人认为，924mg/100ml的溶解度在证据2的记载当中不算是增溶倍数很高的技术效果，因而这一技术效果并没有达到预料不到的程度，对此，合议组认为，对于不同的药物而言，其溶解度增加程度的意义和价值是各不相同的，而这种意义和价值，取决于药物、剂型的医学价值，能够治疗疾病的严重程度，是否具有其它可替代药物，以及增溶后药物使用的安全性等诸多方面的因素。对于丁苯酞而言，这种程度的溶解度的增加，直接为将丁苯酞制备成静脉给药的针剂剂型提供了可能性，对于临床治疗而言，医学价值巨大。 证据4公开了环糊精对几种药物溶解度和稳定性的研究，请求人认为其具体公开的环糊精包合阿司匹林中阿司匹林的结构与丁苯酞相近，对此，合议组认为，丁苯酞的结构中，在苯环旁并有一个内酯环，该内酯环上还有一个丁基取代基，而阿司匹林的结构中，只有一个苯环，没有其它的环状结构，此外，苯环上还带有一个羧基和一个乙羰氧基，这两个化合物在结构上存在明显的差异，一个环和两个环的空间结构就有所不同，而且是否带有羧基导致化合物的拉电子性能、形成氢键的能力也会有差异，因此，本领域技术人员不会得出这两个化合物结构相近的结论。此外，证据4明确记载了“表3列出了一些CD（即环糊精）对药物的增溶作用。CD对难溶性药物在水溶液中的增溶作用与所用的CD及被增溶的药物分子的结构和性质有关。要预测某一CD分子对一种药物的增溶作用的程度是困难的，至今只有一些经验性的认识”。可见，证据4记载的技术信息也印证了丁苯酞增溶之后的效果是难以预测的。 本案涉及医药领域创造性的判断，在该领域中，如何站位本领域技术人员，客观评价技术效果是尤为重要的工作。本案中，合议组对技术效果的考量分为三个方面：一是关于技术效果的可预期程度。在专利权人提交的反证9《药剂学》这本教材当中，有一个关于“注射液”的章节，其中记载了对于不溶或难溶于水或在溶液中不稳定的药物，常用乙醇、甘油等非水溶剂制备注射液。此外，该书还记载了作为注射液的增溶剂是吐温20等表面活性剂。可见，在本领域技术人员欲将丁苯酞制备成注射液时，有多种可选的技术路线，并非直接就聚焦于环糊精辅料上。此外，如上所述，请求人提交的证据当中不同药物被增溶后效果参差不齐，差异巨大，因此丁苯酞被包合之后的效果难以预测。二是关于技术效果的医学价值。这是最为核心、最为关键的判断因素。本案当中，合议组了解到，急性脑梗患者发病后，有半数患者的吞咽功能都会受到影响，在这种情形下，口服药不仅存在起效慢的问题，更严峻的是无法顺利完成给药的问题。这更加凸显了丁苯酞增溶后制备成注射液直接静脉给药的医学价值。三是关于商业上的成功。专利权人主张其获得了商业上的成功，合议组认为，医药领域关乎社会公众的生命健康，能够在这一领域获得商业上的成功，其背后需要有过硬的治疗效果作为支撑，所以商业上的成功实际是对上述第二点医学价值的直接印证。 综上，在本案进行技术效果的判断过程中，合议组深挖证据背后的技术信息，在双方证据碰撞交互的过程中对技术进行梳理归纳，客观评价，最终认为药物领域中优良助剂的出现仅仅提供了制备优良制剂的可能性，不能将这种可能性直接等同于确定性。而涉案专利提供了一种确定且效果优异的丁苯肽包合物的技术方案，它所相应的产品在临床上有着巨大的医学价值，已广泛用于救治急性脑梗病患。此外，本案属于改进型发明，其技术着力点的选择恰到好处，成功突破了技术壁垒，为已知药物的使用提供了更便捷、更高效的使用途径，不仅推动了技术的发展，也为企业带来了高收益，其高价值专利形成的创新思路也值得医化创新主体借鉴。","link":"/Patent-Reexamination-and-Invalidation/2020-07.html"},{"title":"“一种移动电源的租借方法、系统及租借终端”发明专利权无效宣告请求案","text":"来源：中国知识产权报 作者单位：国家知识产权局专利局复审和无效审理部 乔凌云 案情介绍涉案专利名称为“一种移动电源的租借方法、系统及租借终端”（专利号：ZL201580000024.X），专利权人为深圳来电科技有限公司和北京博合智慧科技有限公司。针对该专利，深圳街电科技有限公司、挚享科技（上海）有限公司和深圳市云充吧科技有限公司分别提出了无效宣告请求。 涉案专利涉及共享充电宝领域的基础技术，是共享充电宝系列专利纠纷的重头戏。自2017年8月1日起至今，本专利先后8次被提起无效宣告请求，其审理结论对市场具有较大影响。本案的审理焦点在于对商业规则和方法相关的发明专利的审查思路，是新业态新领域专利保护的生动实例。经审理，国家知识产权局作出第44977号和第44984号无效宣告请求审查决定，维持专利权有效。 典型意义本案对新业态新领域商业方法类发明专利的创造性判断标准具有示范作用。针对此类专利进行创造性判断时，如果区别特征为商业规则和方法特征，不应将其与技术特征简单割裂开来，一味地否定商业规则和方法特征的作用，而应从两者是否存在相互作用的角度进行考量，判断商业规则和方法特征与技术特征之间是否通过相互支持、相互作用解决了相应的技术问题并能够带来相应的技术效果。本案体现了涉及商业方法的微创新发明创造的创造性判断思路，对类案的审查具有指导意义。 案件解析随着互联网、大数据技术的广泛应用，新业态新领域逐渐发展起来，这不但使原有的行业模式产生了根本性变革，同时也催生了很多新兴行业，与之相关的专利申请也呈快速增长的态势，此类申请的发明重点在于大数据技术的具体应用。涉案专利涉及移动电源的租借方法、系统及租借终端，即生活中常见的共享充电宝，涉及新兴技术领域，是共享技术与充电技术领域的融合，涉案专利属于商业方法相关专利案件，与当下的共享单车、电动车、雨伞、快递柜等技术相类似。共享技术近几年发展迅速，共享充电宝技术的发展是否能够撑起共享技术的一片天成为大众的期待。 2017年以来本案专利权人深圳来电科技有限公司与国内多家公司发生专利侵权诉讼，诉讼标的高达1700多万元，作为回击，涉案专利先后多次被提起无效，自此，本案专利的诉讼战开启并愈演愈烈。2017年8月1日至今，涉案专利先后7次被提起无效宣告请求，经审理，其中的3次作出维持专利权有效的审查决定，2次被主动撤回，1次视为撤回，还有1次正在审理中，经历如此多次的无效审理，本案引起了当事人及社会各界的广泛关注。由于涉案专利涉及到新业态新领域，其技术要点涉及共享充电宝设计的基本思路，因此，本案的审理过程也受到了业界广泛关注。 审查理念的转变与创新涉及商业方法相关专利申请案件的审查，历年来，存在着多种审查方式，究其原因，一方面与我国不同阶段的审查标准执行有关，另一方面对于此类申请不同国家和地区的审查方式也存在差异。经研究，目前对于此类申请已逐渐形成了相对统一的审查方式：对一项涉及商业方法的专利申请进行审查，首先考察其是否属于专利保护的客体，之后再对该申请的新颖性、创造性进行评判。审查流程为： 第一步，判断是否属于专利保护客体。从本领域技术人员的角度出发，理解专利申请的实质，确定其请求保护的权利范围。如果权利要求请求保护的方案属于单纯商业方法，不包含任何技术手段，则该申请不属于专利保护的客体。 第二步，新颖性审查。如果权利要求请求保护的方案包含技术手段，则属于专利保护的客体，则应当按照《专利审查指南》第二部分第三章的规定，审查其是否具备新颖性。 第三步，创造性审查。如果权利要求请求保护的方案具备新颖性，则应当按照《专利审查指南》第二部分第四章的规定，审查其是否具备创造性。在创造性的判断过程中，基于区别特征确定该方案实际解决的问题，如果该问题不属于技术问题，则该申请没有对现有技术做出技术贡献，因而不具备创造性；如果该问题属于技术问题，则判断解决该技术问题的方案是否显而易见。 对于该类申请，在第三步创造性审查时，判断与现有技术进行比对后出现的区别特征使得其实际解决的问题是否为技术问题成为难点。原因是上述区别特征通常包含技术特征、非技术特征及二者的融合，特别是对于技术特征与非技术特征融合后的区别特征能否解决了技术问题成为争议的焦点。非技术特征是否只能独立于技术特征而孤立存在，其作用能否与技术特征等同，或与技术特征共同解决技术问题等等都是实际审查过程中亟待解决的，也是申请人比较关注的重点，对上述问题的认定决定了该类申请的结论走向。随着大数据与互联网技术的发展和普及，特别是随着新业态的发展，基于互联网技术与各类商业规则融合形成的发明创造逐渐增多，此类专利申请数量也随之增大，对于此类案件的审查关系到对涉及商业方法类专利申请的审查标准的把握和与时俱进，也会成为推动新兴产业良性发展的新动力。下面通过对本案审理思路的介绍，探讨此类申请的审查标准。 规则与技术的融合涉案专利的专利权人为深圳来电科技有限公司，发明名称为一种移动电源的租借方法、系统及租借终端，授权公告日为2017年3月15日。涉案专利要解决的技术问题是随着多种功能的各类电子产品的普及，其功耗逐渐加剧，及时充电需求剧增，现有技术中没有提供自助从移动电源租借终端租借移动电源的技术，无法给用户提供灵活的充电服务。对此，涉案专利提供一种移动电源的租借方法、系统及租借终端。该租借方法是在移动终端、云端服务器、移动电源租借终端三方之间实现的移动电源的租借，具体包括在租借过程中的第一、第二、第三借入移动电源的指令在三方之间进行的发送与接收，还包括如何通过身份识别号码识别移动电源、移动电源租借终端的身份以及根据上述数据信息进行移动电源租借的具体过程。 请求人提交的证据分别涉及基于手机APP的自行车租赁管理方法和系统、充电器租售机（未联网）、用户终端控制自动售物设备售物的控制系统以及方法、用于收集充电和分配如电池之类的电力存储设备的装置方法及物品、一种基于二维码的自行车公共租赁系统及租赁方法、充电站及充电系统等。以上证据中基于手机APP的自行车租赁管理方法和系统，通过手机、服务器、锁车车墩（站点控制器）三方的配合实现自行车的快速租赁，同时通过二维码识别锁车车墩，通过在自行车上设置识别芯片实现手机用户与自行车的绑定，并通过数据信息在三方之间发送和接收实现自行车的租赁过程，其公开了通过手机、服务器、锁车车墩的三方架构实现自行车的快速租赁的方案，而涉案专利权利要求1是在移动终端、云端服务器、移动电源租借终端三方之间实现的移动电源的租借，虽然二者均是通过移动终端、服务器、相应的租借设备的三方架构形式实现的事物的网上租赁，但应用场景差异较大，该证据中的自行车租借过程是租赁人在能够观察到被租物品的情况下完成被观察的自行车的租用，与涉案专利权利要求1中的移动电源租借不同，用户租用的移动电源是在云端服务器的控制下包括核对移动电源的相应状态信息后得到的，也就是说之前用户并不知晓所借电源的情况，完全由权利要求1中的移动终端、移动电源租借终端、云端服务器组成的技术架构进行判断、选择和提供，因此，二者的处理过程存在较大的差异。 尽管该证据与本案均采用了租赁商业规则，但该证据的具体应用场景与本案存在差异，这种差异表现在数据信号的处理上，这种处理导致在实际应用过程中产生了不同的技术效果。该证据涉及的是自行车的共享，用户在该场景下租赁自行车时，可以通过自身的观察或实践租赁到合适的车辆，此过程依赖于用户的操作。而涉案专利的移动电源的租赁，无需用户过多的参与即可实现符合条件的电源的租赁，该过程由服务器及租借终端本身确定，包括租借终端、电源本身的状态、可用情况等等，用户无需进行干预，使得电源租赁过程变得可靠、高效，改进了以往租赁过程的多种不足。因此，在不同的应用场景下，二者产生了完全不同的效果，这种效果是技术与所述场景的融合带来的。该证据与涉案专利相比在技术架构及租赁规则方面类似，但这种租赁规则应用于不同于涉案专利的应用场景中，本案中所述规则与所述应用场景中的处理过程相互支持、相互作用，使得该处理过程中的信号走向、信息控制方式发生较大变化，进而导致该处理过程产生了较大的差异，且这种应用能够获得不同于现有技术的有益效果，则该应用具有创造性。本案涉及到了与现有技术相比区别特征包含了非技术特征的情形，上述非技术特征与技术特征共同作用、相互支持，共同解决了应用场景中的技术问题并获得了有益的效果，因此，当区别特征为非技术特征时，应从其与其他特征的相互作用角度进行考量，判断各特征之间是否通过相互支持、相互作用解决了相应的技术问题及达到了相应的技术效果，对其进行客观认定，而不能一味地否定非技术特征的作用。 共享技术的出现较早，产生的应用场景有很多，比如本案证据中的自行车共享、租赁机柜、自动售货、蓄电池租赁等等，它们均是基于租赁相关的商业规则，上述应用场景的共同点是，该类场景在实现的过程中要么不关注被共享事物的个体属性，要么不联网，要么依赖于用户操作，导致上述场景在实际应用过程中，使用效果并非十分可靠，而涉案专利的应用场景无需用户过多参与，即能达到可靠的技术效果，这种效果并非是商业规则本身能够达到的，而是该规则与相应技术进行融合，二者相互支持、相互作用达到的，因此，二者密不可分。在实际审查的过程中，不应将规则特征与技术特征进行强行剥离，而应从二者的相互作用关系出发，审查其整体上是否能使得保护方案解决技术问题并带来技术效果。 本案审查决定给出了涉及商业方法相关专利申请的微创新案件的创造性审理思路，对今后此类案件审查标准的制定及审查指南的修改具有一定的借鉴意义，同时，对新领域新业态知识产权保护制度的建设具有参考价值。","link":"/Patent-Reexamination-and-Invalidation/2020-08.html"},{"title":"“平针针织机”发明专利权无效宣告请求案","text":"文章来源：中国知识产权报 作者单位：国家知识产权局专利局复审和无效审理部 李伟伟 谭 远 案情介绍涉案专利名称为“平针针织机”（专利号：ZL201610534695.0），专利权人为H.斯托尔股份两合公司，无效宣告请求人为株式会社岛精机制作所。 我国是世界上最大的纺织品服装生产和出口大国。本案专利涉及的平针针织机是纺织行业内一种重要的生产设备，能够生产图案丰富的高附加值产品，市场竞争激烈。因市场竞争关系，双方当事人分别针对对方专利权提起了多个无效宣告请求，本案即是其中之一。 本案涉及多个争议焦点，包括涉案专利说明书是否充分公开了要求保护的技术方案、权利要求是否清楚，以及相对于现有技术是否具备新颖性和创造性等。经审理，国家知识产权局作出第47197号无效宣告请求审查决定，维持专利权有效。 典型意义正确理解权利要求是专利授权确权审查的基础，本案明确了在说明书未对某术语给出特别界定的情况下，对权利要求中术语的理解应当考虑所属领域的通常含义，以及在涉案专利语境下，该通常含义与本领域技术人员根据说明书及附图得到的内容是否一致。同时，对于技术术语的理解，可进一步结合涉案专利的“内部证据”，例如优先权文本，探知其真实含义。本案通过对专利权的保护范围进行明确界定，给予专利权人与其创新高度和贡献程度相适应的保护，体现出确权程序中既严格保护知识产权又维护社会公共利益的审查理念。 案件解析涉案专利名称为“平针针织机”，专利号为ZL201610534695.0，专利权人为H.斯托尔股份两合公司，无效宣告请求人为株式会社岛精机制作所。 该案专利权人是一家成立于1873年的企业，其创始人发明了世界上第一台编织双反面组织的手摇针织横机；无效宣告请求人是一家后成立的日本企业，其产品目前在电脑横机领域的占有率居世界第一。双方当事人作为针织横机领域的两大巨头，对技术创新和专利保护都非常重视，基于市场竞争等原因，提起本次无效宣告请求。涉案专利涉及的平针针织机是纺织行业内一种重要的生产设备，能够生产图案丰富的高附加值产品，市场竞争激烈，行业关注度高。 该案涉及多个争议点，包括专利说明书是否充分公开要求保护的技术方案、权利要求是否清楚以及相对于现有技术是否具备新颖性和创造性。就说明书是否公开充分而言，该案的核心在于，如何准确把握“以所属领域技术人员能够实现为准”这一标准，说明书中未公开的技术内容是否必然导致权利要求的技术方案未被充分公开。就权利要求是否清楚、相对于现有技术是否具备新颖性和创造性而言，该案的核心在于，如何准确理解权利要求中非通用技术术语及有歧义之技术特征的含义。 经审理，国家知识产权局作出了第47197号无效宣告请求审查决定，维持专利权有效。 准确判断说明书是否公开充分我国专利法第二十六条第三款规定：“说明书应当对发明或者实用新型作出清楚、完整的说明，以所属技术领域的技术人员能够实现为准。” 判断说明书是否公开充分，核心在于准确把握“以所属领域技术人员能够实现为准”这一标准，说明书中对发明或实用新型的说明是否足够清楚和完整，最终应归结于说明书中记载的内容是否达到了使所属领域技术人员能够实现该发明或实用新型的程度。即在判断时，应当站位于所属领域技术人员，除了说明书记载的内容之外，所属领域技术人员还应知晓申请日或优先权日之前所属技术领域的普通技术知识，了解所属技术领域的发展状况；而对于现有技术已知的、或所属领域技术人员根据所掌握的知识即能够知晓的技术手段，即使说明书中未详细公开其结构细节，也不影响该领域技术人员理解和实施该发明。 具体到本案，其焦点在于说明书中未记载实现权利要求1中所限定的“两种纱线引导器的布置方式”所用的具体电气结构和其他细节的机械结构，是否会导致所属领域技术人员无法实现其技术方案。 通过涉案专利说明书的记载可知，其发明点在于对两种类型的纱线引导器的相对位置关系的布置提出改进，从而实现更经济地生产更复杂图案的技术效果，且在说明书和附图中对上述布置方式也有相应的文字记载和图示，同时专利权人在口头审理中也明确涉案专利的纱线引导器、纱线引导器轨、随动装置、电气驱动装置仍然采用现有技术已知的结构。因此，所属领域技术人员根据说明书公开的技术方案结合现有技术已知的驱动机构和机械机构，能够清楚地知晓如何布置两种类型的纱线引导器，进而能够实现涉案专利的技术方案。 准确理解权利要求中非通用技术术语及有歧义之技术特征的含义对权利要求的理解和解释一直是贯穿专利行政程序、司法程序各环节的难点问题，且其与专利的可授权性条款均存在着联系。由于各程序的定位、目的以及价值不同，在专利确权程序中，对于权利要求的理解又有别于其他程序。总体而言，专利确权程序中对权利要求的理解仍然以《专利审查指南》的规定为基础。《专利审查指南（2010）》第二部分第二章第3.2.2节规定：“每项权利要求所确定的保护范围应当清楚。权利要求的保护范围应当根据其所用词语的含义来理解。一般情况下，权利要求中的用词应当理解为相关技术领域通常具有的含义。在特定情况下，如果说明书中指明了某词具有特定的含义，并且使用了该词的权利要求的保护范围由于说明书中对该词的说明而被限定得足够清楚，这种情况也是允许的。” 根据上述规定，在判断权利要求中某一术语或技术特征的含义时，一般应当站位于所属领域的技术人员根据其字面含义理解其在所属领域的通常含义，或者当说明书对于该术语或技术特征有特别界定时，可依据说明书的记载进行理解。但是，由于专利所涉及的技术领域纷繁复杂，加之文字语言表述的弹性，当权利要求出现非通用术语和有歧义的表述时，如何理解其具体内涵仍需结合具体案情。基于多年的审查实践，在专利确权程序中，对于上述情形的权利要求，既要站位于所属领域技术人员，结合涉案专利说明书和附图所记载的技术方案来理解其用词，也需借助涉案专利的“内部证据”（包括专利文件、审查档案等）和/或“外部证据”（包括教科书、字典、行业手册等）来综合判断，最终目的都是指向对权利要求所保护的技术方案作出唯一正确的解读。 具体到本案，其焦点之一在于权利要求1中的“针织锁扣”并非本领域的通用术语和公知部件，且在说明书中对其也没有任何定义的情况下，该术语是否会造成权利要求1的保护范围不清楚；焦点之二在于，在评述新颖性和创造性时，如何解读权利要求1中所记载的技术特征“交替地彼此平行地布置”的真实含义。 对于术语“针织锁扣”，由于涉案专利要求有德国优先权，合议组首先查看了优先权文件中相应的用词，是德文词语“Strickschlösser”，通过查阅字典可知，“针织锁扣”这一中文名称是对上述外文词语的直接翻译。因此，通过优先权文件这一内部证据首先明确了该词的来源。而该词具体所指是何种部件仍需进一步审查。除了权利要求的记载，在涉案专利说明书中还载明：针织锁扣位于滑块的前部和后部，用于触发针织工具；附图示出了针织锁扣在平针针织机中的具体位置，由此，所属领域技术人员能够明确针织锁扣位于滑块的前部和后部，用于触发针织工具。即，根据专利文件中说明书和附图的记载，可以明确针织锁扣的具体位置、作用以及与其他部件的相对关系。再进一步调查该技术领域的教科书可知，在所述位置通常设置的部件是三角座滑架。因此，所属领域技术人员依据其所掌握的普通技术知识，通过阅读专利说明书和附图，能够知晓涉案专利的“针织锁扣”实质上相当于所属领域中常见的“三角座滑架”这类部件，且专利权人在口头审理中也对此进行了明确确认，故在综合查证所有事实的情况下，所属领域技术人员可以明确非通用术语“针织锁扣”的唯一且合理的解释，不会造成权利要求1保护范围的不清楚。 对于技术特征“交替地彼此平行地布置”，双方当事人的分歧在于“交替布置”到底包含哪些情形，按字面意义虽然包含了两种纱线引导器可能是具体各个部件相互交替布置，但也可能是某类部件组成的整体相互交替，亦或两种情形均包含。回归涉案专利记载的技术内容本身可知，其发明目的是既能生产丰富的织物产品又能合理利用机器内部空间，采用的具体的技术手段是设置两种类型的纱线引导器并交替布置，并且说明书附图中示出具体的交替方式，即自给自足的纱线引导器布置于随动纱线引导器的间隙中。所属领域技术人员基于专利说明书和附图的记载可知当采用一种类型的纱线引导器整体布置在同一侧这种形式时，并不能解决涉案专利所要解决的技术问题，且在涉案专利的说明书中也没有一个实施例是按照上述形式来进行排列的，故对涉案专利权利要求1中的“交替布置”的理解应当与说明书和附图的记载相一致，即，两种类型的纱线引导器一一间隔交替布置。对于“一种类型的纱线引导器全部设置在同一侧，另一种类型全部设置在另一侧”的情形，不包含在本专利的保护范围中。基于此，作为现有技术的证据并不能破坏涉案专利的新颖性和创造性。 启发及意义本案审理过程中，立足专利文件是技术语言表达的技术载体这一特性，深入理解和分析了专利的技术细节；在客观准确认定技术事实的基础上，对专利授权确权审查中重要法条所涉及的法律问题、审查标准和判断规则给出阐释。通过本案的审理，可以看出无论在判断说明书充分公开还是正确解读权利要求时，都应站位所属领域技术人员。在判断说明书充分公开时，应当综合考虑发明所要解决的技术问题、采用的技术手段，牢牢把握发明的技术核心，始终以“所属领域技术人员能够实现”为核心判断要素。在正确解读权利要求的用语和技术特征时，要注重结合技术领域的特点，根据说明书和附图的记载，在综合考虑“内部证据”和所属领域技术人员所掌握的普通技术知识的基础上探知其真实含义；避免脱离发明实质、脱离所属领域技术人员的水平，对权利要求的用语做字面地、机械地理解以至于不恰当地扩大或限缩权利要求的保护范围。 本案通过专利无效程序，对权利要求做出正确的解读，更加清晰地界定了专利权的保护范围，对于后续可能出现的专利侵权纠纷明确了权利客体的边界，给予专利权人与其创新高度和贡献程度相适应的保护，体现出行政确权程序中既严格保护知识产权、又维护社会公平正义的审查理念。","link":"/Patent-Reexamination-and-Invalidation/2020-09.html"},{"title":"“取代的噁唑烷酮和其在血液凝固领域中的应用”发明专利权无效宣告请求案","text":"来源：中国知识产权报 作者单位：国家知识产权局专利局复审和无效审理部 李婉婷 案情介绍涉案专利名称为“取代的噁唑烷酮和其在血液凝固领域中的应用”（专利号：ZL00818966.8），专利权人为拜耳知识产权有限责任公司，无效宣告请求人为南京正大天晴制药有限公司。 本案专利涉及一种新型口服抗凝药物“利伐沙班”，原研药由拜耳与强生公司联合开发。2019年，南京正大天晴成为国内首个拿到“利伐沙班片”仿制药上市资格的厂家。利伐沙班原研化合物专利已于2020年底到期，但拜耳对原料药销售和许诺销售行为的大力维权举措仍在进行，涉案专利的有效性仍是争议焦点。作为专利侵权诉讼的当事人之一，南京正大天晴于2019年12月针对涉案专利提起了无效宣告请求。本案涉及化合物创造性判断中的诸多焦点问题。经审理，国家知识产权局作出第45997号无效宣告请求审查决定，在专利权人提交的修改文本的基础上维持专利权有效。 典型意义本案诠释了化合物领域如何适用创造性的审查标准，即从寻找最接近现有技术出发，探究药物化合物发明的起点，分析要求保护的化合物与最接近现有技术的结构差异，进而基于这种结构改造所获得的用途和/或效果来确定专利实际解决的技术问题，从而确立创造性三步法中显而易见性判断的基础。本案对于化学领域的专利授权确权审查具有指导作用，同时有助于创新主体深入了解类案审理思路，进而有效地保护其合法权益。 案件解析案件背景利伐沙班是一种新型口服抗凝药，主要通过抑制凝血因子 Xa 的活性发挥抗凝作用。目前，利伐沙班已广泛用于静脉血栓栓塞性疾病的预防与治疗，以及非瓣膜性房颤的卒中预防。与同类药物华法林相比，利伐沙班具有起效迅速、疗效可预测、颅内出血发生率低、无需常规凝血监测和常规调整剂量等优势。在该药物上市之前，主要是非口服的药物如低分子肝素以及维生素K-拮抗剂，占领抗凝药物市场主导地位，对于皮下/胃肠外注射的抗凝药，其具有非选择性抗凝和口服无效的缺陷，而华法林等已有口服抗凝药又存在起效慢、治疗指数窄和出血风险高的严重问题。因此，利伐沙班这种口服Xa抑制剂上市后，迅速占领市场。利伐沙班原研由拜耳/强生联合开发，强生负责美国市场，拜耳负责美国以外的全球其他市场。利伐沙班专利授权日为2006年7月6日，最早于2008年9月获得欧盟批准上市，2009年3月，利伐沙班在国内获批上市，同年，利伐沙班进入国家医保目录，限用于下肢关节置换术后的患者。2017年，国家医保目录调整，利伐沙班又进入了新医保报销范围，临床医保报销的科室从外科扩大到了心血管内科。2020年利伐沙班全球销售额达74.98亿美元。2019年8月5日正大天晴仿制药上市申请获得国家药品监督管理局批准。截至目前，已有17家国内知名药企拿到了利伐沙班仿制药上市批件。 从专利角度来说，拜耳公司利伐沙班原研化合物专利已于2020年底到期，然而，拜耳公司针对仿制药的专利维权仍在进行，侵权诉讼涉及到多家国内知名药企，该专利成为众多仿制药企上市该品种无法回避的阻碍。多家药企为了全面扫除上市阻碍，于2019年8月开始先后针对该专利提出无效宣告请求，其中包括石药欧意、正大天晴、南京天晴、南京生命能、南京恒生等公司。本案涉及的是南京天晴于2019年12月针对该专利提起的无效宣告请求。国家知识产权局经审理，于2020年9月3日作出第45997号无效宣告请求审查决定，维持该专利权有效。该案的审理焦点集中于化合物的创造性审查中对于最接近现有技术的选取、化合物核心结构的确定，以及如何寻找技术启示的问题，上述问题也是药物化合物专利审查的难点所在。 案情聚焦本文受篇幅所限对于决定涉及的其他无效理由不作讨论，将重点聚焦于对创造性的判断。请求人使用了较多证据组合方式，均以证据3的化合物A作为最接近的现有技术。请求人认为涉案专利要求保护的化合物与化合物A结构接近，在涉案专利并没有证明其具备预料不到技术效果的基础上，涉案专利实际解决的技术问题仅在于提供一种结构类似的Xa抑制剂。由于二者结构上存在4个取代基上的区别，请求人分别采用不同证据主张现有技术对这四个位点给出了基团替换的技术启示，从而得出不具备创造性的结论。而专利权人则认为，涉案专利要求保护的化合物与化合物A结构不接近，由此涉案专利解决的技术问题是提供一种不同母核的Xa抑制剂。然而，现有技术所有证据都不能就涉案专利的化合物母核结构给出技术启示，因此，涉案专利具备创造性。双方当事人对涉案专利实际解决技术问题的认定所引发的化合物创造性问题的判断产生了较大争议。 据此，本案合议组遵循化合物创造性评述的三步法原则。首先对涉案专利和现有技术化合物结构进行比对和分析，根据案中大量现有技术，分析了本案化合物的活性必需基团以及与现有技术中化合物的结构差异，并基于对这种结构改造所获得的用途和/或效果进行构效分析的基础上确定发明实际解决的技术问题；继而分别对各个证据是否给出了进行相应结构改造可以获得相应技术效果的技术启示作出分析，最终对是否具备创造性作出判断。具体为： 涉案专利权利要求1涉及如下结构的化合物或其可药用盐或水合物：（即利伐沙班化合物）。 证据3公开了具有Xa抑制特性的一类苄脒衍生物，其中请求人主张的最接近现有技术方案即化合物A 结构如下： 分析涉案专利化合物与证据3的化合物A的结构。二者相同点在于都具有苯基噁唑烷酮结构，区别在于：（1）权利要求1中噁唑烷酮右侧为5-氯噻吩-2-基，而化合物A为4-氯苯基；（2）权利要求1中酰胺基氮原子上为氢，而化合物A为甲基；（3）权利要求1中亚苯基对位上为3-氧代吗啉-4基，化合物A为甲脒基；（4）权利要求1中噁唑烷酮环是S异构体，化合物A未公开构型。 考察涉案专利和证据3的用途和效果。涉案专利提供了一种口服具有良好Xa抑制活性的化合物，其中利伐沙班是实施例44制备得到的化合物IC50为0.7nM，表1中公开了在动静脉分流模型（大鼠）中口服或静脉给药后的抗血栓活性，口服ED50值为3mg/kg。证据3也记载其化合物具有Xa抑制活性，虽提供了多个制备例，但并未提供效果例和具体实验数据。证据3公开的化合物通式为： 其中R1可以是-C(=NH)-NH2，R3是R5或-[C(R5)2]m-COOH5，R3与X一起还可以是-CO-N-,由此形成五元环,其中R3是-C=O,X是N；可以看出证据3通式中R1的定义均为苄脒基或其前体结构，且制备例中的化合物均是苄脒基。由于X和R3基团有多种定义，不是所有化合物均具有与涉案专利化合物共有的苯基噁唑烷酮部分。化合物A对应于通式中R3与X一起形成五元环的情形，证据3公开的制备例中一半以上化合物均没有噁唑烷酮结构。基于此，证据3给出的技术信息是该类具有苄脒结构的化合物具有Xa抑制活性。可见，虽然涉案专利和证据3的化合物具有相同用途，但根据上述构效关系的分析，不难发现，证据3中苄脒基是其发挥Xa抑制活性的必需基团，而涉案专利化合物具有吗啉结构而非苄脒结构。基于此，涉案专利实际解决的技术问题是，提供一种新型结构的Xa抑制剂。 综合考量现有技术是否给出对证据3的化合物结构进行相应改造而具备同样活性的技术启示。如上所述，证据3是一种苄脒基为活性基团的Xa抑制剂，本领域技术人员从该现有技术出发，为了获得更多不同结构的化合物，通常会选择尝试将苄脒基结构以外的其他位点取代基进行改进，而不是将其中的甲脒基替换为涉案专利化合物的吗啉基。证据4和证据7均为Xa抑制剂的综述类文章，其中列举了肽类、苄脒、双苄脒、非脒抑制剂；特别采用口袋理论指出苄脒抑制剂S1和S4口袋的苄脒结构是获得Xa抑制活性不可缺少的部分，而证据3即为该类型抑制剂。除此之外，涉案专利化合物属于非脒抑制剂，对此现有技术并未给出采用吗啉基结构替换甲脒结构的技术启示。证据6、9-13均涉及苄脒抑制剂，证据8涉及双苄脒抑制剂，进一步佐证了证据3中苄脒基团不可或缺的事实。此外，证据5是一种酰胺类Xa抑制剂，请求人主张将其实施例1的吗啉基和实施例7的氯代噻吩基分别与证据3的化合物A拼凑，但是这种对于无共同结构单元的化合物基团的替换缺乏理论依据。以上证据均指向了同一个事实，即证据3中苄脒结构是Xa抑制活性的必需基团，因此，该苄脒基中的甲脒是其不可或缺的基团，而现有技术并没有给出将该甲脒基替换为涉案专利化合物中的氧代吗啉基的技术启示。 如上所述，本案所有证据都未教导对化合物A结构进行改进，将甲脒基替换为吗啉基得到如涉案专利中化合物的噁唑烷酮并且仍具有良好的Xa抑制活性。通过以上分析，能够得出，涉案专利的化合物与最接近现有技术结构差异较大，并且相关证据均表明面对证据3的苄脒抑制剂，本领域技术人员选择改进的位点并不是使用其他基团替换苄脒，而是在保持该结构的基础上对其他结构进行改进，此外，公知常识性证据也没有给出相应结构改进的技术启示。因此，在现有证据基础上，涉案专利请求保护的化合物具备创造性。 本案中，双方当事人对于涉案专利化合物与最接近现有技术之间结构是否接近的判断产生较大分歧，因此得出了截然相反的创造性结论。无效决定从化合物最接近现有技术的寻找出发，探讨了药物化合物发明起点问题，并且详细分析了本案化合物的必需结构基团以及与现有技术化合物的结构差异和构效关系，并基于进行这种结构改造所获得的用途和/或效果确定发明实际解决的技术问题，以此确定涉案专利相对于现有技术的技术贡献，该部分内容构建了创造性三步法中阐述化合物具有突出的实质性特点的关键基础。 启示与思考本案阐释了三步法在化合物创造性评价过程中的具体思路。对于机械比对化合物结构是否接近的误区，进一步明确了在化合物的创造性判断中，构效关系的分析是确定发明实际解决的技术问题以及分析现有技术是否存在相应技术启示的关键内容。不难看出，在三步法指导下的化合物创造性评价中，能够尽量避免机械对比化合物结构是否接近产生的主观臆断，据此得出的结论也更为客观。 药品专利纠纷早期解决机制刚刚实施，对于药物化合物的专利挑战越来越成为各药企面临的重要课题。本案对于化合物创造性的审查思路和评价方式，既为仿制药企业在专利挑战中的证据准备提供了借鉴，也为原研药企业在专利申请过程如何维护其合法利益提供了参考。","link":"/Patent-Reexamination-and-Invalidation/2020-10.html"},{"title":"留言板","text":"「有事请留言，本人将在看到消息后的第一时间进行回复。」","link":"/message/index.html"},{"title":"About Me","text":".heimu { color: #000; background-color: #000; } .heimu:hover { color: #fff; } 大家好，我是练习时长两年半的“知产练习生”Chen，不喜欢唱跳rap，目前在上海工作，爱好包括摄影、骑行和写作，对数据科学、计算机、量子力学、宇宙天文学比较感兴趣。 写作本人的写作能力很差，目前来看也并没有多少输出内容的能力，可能只有对于“生活”、“工作”或者“爱好”产生了新的思考时，才会偶尔输出一两篇文章。对于写作，我并不希望这成为一种自我“画地为牢”的约束，只是单纯因为觉得有趣，所以何时更新全凭个人喜好。 本站本站基于Hexo搭建，同时托管于Github服务器和GItee服务器中，算得上“完全免费”。后来随着图片资源的变多，为提升加载速度，图床改用了阿里云对象存储OSS，目前暂未接入CDN。如果本站访问异常，请尝试访问部署于Github中的同步镜像地址https://pigpeq.github.io/。 鉴于本人有限的个人积累，目前对该博客空间的定位仅局限于“教程”、“笔记”、“分享”等，可能更多的是一些输出给自己观看或者记忆的内容，还请见谅。当然，本人也希望能与大家共同学习进步，提升写作水平。如果本站中的这些内容能够帮助到你，那将不胜荣幸。 工作“如何向身边的人解释我的工作”是一个困扰我已久的问题，“做知识产权（IP，intellectual property）的”，亦或者“写专利的”？可能后者才是为大众普遍认知的，当然也许他们并不知道专利（patent）是什么。我是一个科技爱好者，相比于枯燥而又让人头秃的“机器语言”，我可能更喜欢用严谨的“逻辑”来理解这些科技产品。 “逻辑”是什么？从代码层面可以理解为代码片段的注释，从客观规律层面可以理解为解决问题的“方法论”。而专利则是结合法律知识，并通过客观严谨地描述这种“逻辑”，从而对技术形成保护且具备法律效力的文献，所以从知产从业人员的工作内容上来看，其职业定位应是界定于“科技工作者”、“法治工作者”以及“市场工作者”三者之间。","link":"/about/index.html"},{"title":"专利案件","text":"声明：以下案件均已公告或公示，仅用于学习与参考。 CN113656652A-医保违规行为的检测方法、装置、设备及存储介质 CN113268239A-桌面应用的视图构建方法、装置、设备及存储介质 CN113268609A-基于知识图谱的对话内容推荐方法、装置、设备及介质 CN113656652A-调度任务的监控方法、装置、设备及存储介质","link":"/patent/index.html"},{"title":"My Friends","text":"本站信息 MSpace https://jschenliang.gitee.io 简介: 不念过去，不畏将来！ 申请友链须知 原则上只和技术类博客交换，但不包括含有和色情、暴力、政治敏感的网站。 不和剽窃、侵权、无诚信的网站交换，优先和具有原创作品的网站交换。 申请链接前请先添加本博链接，通过留言或邮件告知。 申请请提供：logo 或头像、站点名称、站点链接、站点描述、。 友情链接下面的友情链接顺序不分先后，每次刷新都会随机排序； 如您需要交换友链，请先添加本站信息后在评论区留言。","link":"/friend/index.html"}],"posts":[{"title":"【转载】2020年度专利复审无效十大案件","text":"国家知识产权局官网在复审无效专栏中公布了2020年度复审无效十大案件，本人重新对其排版布局后转载于个人博客，便于阅读和学习。 案例 1-“β-阻断剂在制备用于治疗血管瘤药物中的用途”发明专利权无效宣告请求案 案例 2-“利用直流/DC电源的分布式功率收集系统”发明专利权无效宣告请求系列案 案例 3-“板材上下料装置及手机玻璃加工中心”发明专利权无效宣告请求案 案例 4-“一种驱动液态镜头的音圈马达及其镜头组”实用新型专利权无效宣告请求案 案例 5-“无线通信系统”发明专利权无效宣告请求案 案例 6-“用于移动通信终端的图形用户界面”外观设计专利权无效宣告请求案 案例 7-“丁苯酞环糊精或环糊精衍生物包合物及其制备方法和用途”发明专利权无效宣告请求案 案例 8-“一种移动电源的租借方法、系统及租借终端”发明专利权无效宣告请求案 案例 9-“平针针织机”发明专利权无效宣告请求案 案例 10-“取代的噁唑烷酮和其在血液凝固领域中的应用”发明专利权无效宣告请求案 以上来自官方的解读，同时分享来自微信公众号徐师付的知产主义的复审无效案件学习心得系列文章，作者对其中部分案件的审查进行了解读，基于各案的决定要点，提炼了其中所体现的合议组的审查观点，并将其与专利代理师的日常代理实践相结合。","link":"/2022/7bbedc9637be/"},{"title":"庞加莱回归：宿命注定你我终将再次重逢！","text":"总有一天， 整个宇宙会回归到他最初的样子， 尘埃会燃烧成太阳， 废墟会立起高楼， 骸骨会覆盖上血肉， 而我们会再次相逢， 并告别。 春节期间想起同事随口提到的网剧《开端》，从他们口中听说很好看哎，于是花了两天时间去刷了一下这部剧。该剧主要讲述了游戏架构师肖鹤云和大学生李诗情遭遇公交车爆炸后却又一次次地死而复生，在时间循环中并肩作战，努力阻止爆炸、寻找真相的故事。剧情紧凑，没有拖泥带水，豆瓣也给出7.9分的评价，这种泛科幻色彩的悬疑剧在国内应该还是挺受网友好评的，没有传统悬疑剧的压抑紧张，还有猪脚开局自带金手指的爽点，年轻人谁不爱呢。 这部剧让我想起了之前刷过的一部网络科幻小说《复活帝国》，绝症患者猪脚开局一台冷冻仓，陌生星球的荒山野岭中，莫名奇妙领了盒饭后又重开了，接下来就是他行走于时间的缝隙中，反抗这个不公平的世界，重建世界的秩序。不过这两个故事都告诉了我们一个道理——即使我们可以重来多次，做到“完美”的概率也微乎其微。 对于故事中的“时间循环”现象是一个很让人感兴趣的话题，作者在书中将猪脚的金手指解释为“庞加莱回归”现象，庞加莱是19世纪后四分之一和二十世纪初的领袖数学家，他不仅是代数拓扑学的开创者，而且他对电子理论的研究成果为爱因斯坦的相对论奠定理论基础。 终有一天，你会与你最重要的人再次重逢。 “在一个封闭系统中，任何粒子在经过一个漫长的时间之后必然能回到其无限接近其初始位置的位置，（但是不能回到原来位置，只能无限接近），尽管这个时间的长度远远超出我们所能想，但是它必然会实现。这样一个周期就称为一个庞加莱回归（Poincaré recurrence theorem）”。这是百度百科中对于“庞加莱回归”的完整解释，《经典力学的数学方法》中给出了证明过程👇。而就在2018年3月。维也纳大学的研究人员成功在一套多粒子量子系统中证实了一种“庞加莱回归”现象。研究结果已在《科学》期刊上发表。 对于“庞加莱回归”的概念定义很容易理解，例如我们日常打扑克，在打扑克这个封闭的系统中，扑克的数量是有限的，只要时间足够长，总有一次我们会再次摸到与之前某次完全相同的牌，对于时间有限的前提下来说，“庞加莱回归”现象是概率性事件，而对于时间永恒的前提下来说，“庞加莱回归”则是一个必然性事件，发生该现象只是时间长短的问题。当然对于这个简单的封闭系统（一维空间）而言，其中粒子（即扑克）的数量不是特别多，所以说发生该现象所需的时间应该不会特别长。 提到打扑克这个例子，让我想起某博主分享过的还原魔方的奇葩故事。该故事的主人公却是一个魔方新手，他想试一下随心所欲地拧魔方究竟能不能将魔方还原，最终和一个魔方整整杠了26年😂： 英国《每日邮报》报道，英格兰汉普郡波特切斯特的建筑工人帕克从1983年买下魔方开始，一直在为解开魔方努力，历经26年、2.7万个小时后，终于成功。 帕克说：“这些年我就像被魔方施了咒，整个生活都围着它转。”为解开魔方，帕克忍受腕部伤病、背部疼痛以及无数个失眠的夜晚，但他的决心从未动摇。 “我会因为待在家玩魔方缺席很多重要场合，还会整宿不睡，思考解开它的方法。”最终，帕克得以登上自己心中的“珠穆朗玛峰”。放下魔方那刻他长舒一口气，感觉到多年未有的轻松，认为“一切都值得”。帕克说：“当转完最后一块，看到每一面都是相同颜色时，我哭了。我无法向你形容这种成功的欣慰。” 魔方就像“第三者”帕克现在已经是一个孩子的父亲，妻子珍妮说自己和帕克常常因为他对魔方的痴迷吵架，让这段婚姻一度紧张。珍妮承认，有时她甚至觉得过去26年中，他们夫妻中间像有“第三者”插足。 “我遇见帕克时他已经对魔方着迷，每天都有好几个小时用在这上面，”珍妮说，“我常常想让这一切早点结束，但我知道他解开之前是不会罢休的，谢天谢地他终于完成了。”朋友们也替帕克着急，想帮助他解决这个难题，但都被他拒绝。 帕克说：“我也知道网上能找到解魔方的方法，但是我一定要独立完成。” 众所周知，还原魔方都是有公式口诀的，盲拧大概率只会浪费时间。当然对于魔方高手而言，还是可以轻松做到盲拧，对于他们而言，所谓的“盲拧”只是由肉眼上观察的方式转变为脑部记忆的方式，本质还是按照一定的规则来还原魔方的，而并不是像帕克这样采用“随机游走策略”，对于随机游走策略在二维空间内是有较高概率回归到起始位置的，而对于魔方这样的三维空间，这种概率则会进一步得到降低。 值得一提的是，在上述扑克系统和魔方系统中，仅需要考虑每张扑克或者魔方块对应的值这一维变量。倘若将宇宙作一个完整的动力系统，对于“庞加莱回归”应用于现实世界将会涉及到更多维的变量（即系统内每个粒子的属性状态），而相空间则是一个用于表示出系统内所有可能状态的极大维空间，相空间中的每个点都对应某一时刻下整个系统中所有粒子的物理态信息集合（如位置、动量坐标），例如其中的A点对应上一秒的宇宙，B点对应下一秒的宇宙，当然，这里的时间单位肯定远比“秒”更加精确，只要宇宙中有微观粒子发生了物理态的变化，这一刻的宇宙都可以在相空间以一个相应的点进行表示。 生命在内的宇宙万物都是由难以计数的微观粒子构成，这就意味着，我们在现在的这一瞬间所感受的一切，其实都是这些微观粒子的一种特定的随机组合形式，而微观粒子则不断地在运动，随着时间的推移，这种随机组合形式的数量不断增加，宇宙动力系统对应的相空间中点也随之而变多，发生像《开端》或《复活帝国》中这样的时间循环现象的概率的分母只会呈指数级上升，所需时间甚至超过了宇宙诞生以来所存在的时间，在宇宙寿命有限的提前下，则会从概率性事件沦为不可能事件，也并不可能像剧中那样频繁地发生回归。当然这或许就是人文作品的魅力所在吧，人类总是对未来抱有无限的期望与憧憬，坚信事物总会往好的方向发展，正如当初人们难以接受令人痛苦绝望的宇宙热寂论[1]（theory of heat death）一样。他们都会渴望宿命中存在的“来生”，哪怕是位“无神论者”。 基于热力学第二定律[2]（second law of thermodynamics）的熵增定律指出：在不被外界干扰的情况下，一个孤立系统的“熵”总是会有增加的趋势，直到其混乱程度达到最大。“熵”就是指一个系统的混乱程度，“熵”越高其混乱程度就越高。如果将热力学第一定律[3]（the first law of thermodynamics）和热力学第二定律推广到宇宙，宇宙能量守恒且熵恒增，宇宙终将会随着时间的流逝走向热寂。而“庞加莱回归”定理的证明，推翻了熵增定律的不可逆性，其并不适用于微观粒子，进而否定了据其导出的宇宙热寂论猜想，同时复辟了热一定律（即能量守恒定律）才是通用于宏观粒子和微观粒子的真理。 而得到谱线红移现象、各种天体年龄均小于200亿年的观测事实等支持的现代大爆炸宇宙学理论，其也与宇宙热寂论相左，其认为宇宙产生于一场规模巨大的爆炸且不断从热到冷在膨胀；宇宙作为自引力系统，是不稳定的热力学系统，并不像静态宇宙模型所设想的那样具有平衡态，因而其熵亦无最大值，即热寂并不存在。 至于宇宙中会不会发生所谓的“庞加莱回归”现象，根本取决于“宇宙是否为一个有限的空间体以及宇宙是否永恒”，这些人类还无从得知。随着暗物质加速宇宙的不断膨胀，而膨胀到一个临界值后，爆炸撕裂论认为宇宙中的一切最终会随宇宙一起被撕裂，而坍塌奇点论认为其会开始向内坍塌收缩，最终收缩为一个“奇点”并再次演化为一个全新的宇宙。 “世界上并没有完全相同的两片叶子”，即使宇宙真的永恒存在，粒子也不能完全回归到原来的位置，只能是无限接近。那么同样由原子组成的你，在你死后的哪些原子经漫长岁月后重组了“你”，你能确定那还是你吗？或许那只是平行宇宙中的另一个你。 猜想：如果相空间中的A点（粒子集合）对应某一刻的宇宙，那么有没有可能所谓的平行宇宙只是同一相空间中A点经漫长岁月后发生了多次“庞加莱回归”的一系列宇宙，即相空间中的多个点（粒子集合），这些点在时间上呈线性关系？而我们当前所在的宇宙可能是经过了多次”庞加莱回归“的平行宇宙，这样来讲也能解释得通熵恒增定律了。 1.猜想宇宙终极命运的一种假说。根据热力学第二定律，作为一个“孤立”的系统，宇宙的熵会随着时间的流异而增加，由有序向无序，当宇宙的熵达到最大值时，宇宙中的其他有效能量已经全数转化为热能，所有物质温度达到热平衡，这时一切变化都不会发生了，宇宙处于死寂的永恒状态。 ↩2.能量不能从低温物体传向高温物体，而不引起其它变化。 ↩3.能量不会凭空产生，也不会凭空消失，它只会从一种形式转化为另一种形式，或者从一个物体转移到其它物体，转换过程中，能量总量不变，也即能量守恒定律。 ↩","link":"/2022/18f2ac0888fa/"},{"title":"Markdown写作与进阶","text":"Markdown为简单而生，它是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。由于Markdown的轻量化、易读易写特性，并且对于图片，图表、数学式都有支持，许多网站都广泛使用Markdown来撰写帮助文档或是用于论坛上发表消息，如GitHub、Reddit、Diaspora、Stack Exchange、OpenStreetMap 、SourceForge、简书等，甚至还能被使用来撰写电子书。 基础语法分级标题Markdown支持6种级别的标题，字号依级递减。123456# 1级标题## 2级标题### 3级标题#### 4级标题##### 5级标题###### 6级标题 字体 加粗 斜体 下划线 删除线 Hello World! Hello World! Hello World! Hello World! 1234567891011# 加粗**Hello World!**# 斜体*Hello World!*# 下划线&lt;u&gt;Hello World!&lt;/u&gt;# 删除线~~Hello World!~~ 引用 Markdown为简单而生，它是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。 1&gt; Markdown为简单而生，它是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。 文本概括 这是概括标题，点击展开标题对应内容。 One day, it’s sunny and warm. Some birds are singing in the trees. “What do you want to be when you grow up?’’ asks Tim. a toy box or a baseball bat. I like children.”“What do you want to be when you grow up?” asks Alan. 点击查看语法 >folded1234&lt;details&gt;&lt;summary&gt;这是概括标题，点击展开标题对应内容。&lt;/summary&gt;One day, it’s sunny and warm. Some birds are singing in the trees. “What do you want to be when you grow up?’’ asks Tim. a toy box or a baseball bat. I like children.”“What do you want to be when you grow up?” asks Alan. &lt;/details&gt; 列表无序列表 One day, it’s sunny and warm. Some birds are singing in the trees. “What do you want to be when you grow up?’’ asks Tim. a toy box or a baseball bat. I like children.”“What do you want to be when you grow up?” asks Alan. 1234# 注意：以上“-”与内容之间有空格，“-”可采用“+”、“*”替代.- One day, it’s sunny and warm. Some birds are singing in the trees. - “What do you want to be when you grow up?’’ asks Tim. - a toy box or a baseball bat. I like children.”“What do you want to be when you grow up?” asks Alan. 有序列表 One day, it’s sunny and warm. Some birds are singing in the trees. “What do you want to be when you grow up?’’ asks Tim. a toy box or a baseball bat. I like children.”“What do you want to be when you grow up?” asks Alan. 1234# 注意：以下序号与内容之间有空格.1. One day, it’s sunny and warm. Some birds are singing in the trees. 2. “What do you want to be when you grow up?’’ asks Tim. 3. a toy box or a baseball bat. I like children.”“What do you want to be when you grow up?” asks Alan. 列表使用过程中的注意事项 当在一个列表中出现多个段落时，首字母必须缩进一次以保证正常渲染，四个空格或者一个制表符代表一次缩进。 第一段落 第二段落 第一段落 第二段落 1234- 第一段落 第二段落- 第一段落 第二段落 分割线 12---*** 插入链接或图片 「📌点击下载 Hello Markdown」 12345# 插入链接[点击获取Hello Markdown.jpg](https://xxx.../Hello Markdown.jpg)# 插入图片![Hello Markdown](https://xxx.../Hello Markdown.jpg) 表格 Title1 Title2 Title3 1row-1column 1row-2column 1row-3column 2row-1column 2row-2column 2row-3column 表格的语法稍微有点复杂点击查看语法 >folded1234| Title1 | Title2 | Title2 || :----------: | :----------: | :----------: || 1row-1column | 1row-2column | 1row-3column || 2row-1column | 2row-2column | 2row-3column | 表格的对齐方式 左对齐 右对齐 居中对齐 1row-1column 1row-2column 1row-3column 2row-1column 2row-2column 2row-3column 点击查看语法 >folded1234| 左对齐 | 右对齐 | 居中对齐 || :---------- | ----------: | :----------: || 1row-1column | 1row-2column | 1row-3column || 2row-1column | 2row-2column | 2row-3column | 插入代码块段落中插入代码nextTickWork中调用process.nextTick(work)，其中函数work又调用了nextTickWork。 1`nextTickWork`中调用`process.nextTick(work)`，其中函数`work`又调用了`nextTickWork`。 代码块12345678910111213class Solution { public int countKDifference(int[] nums, int k) { int[] cnts = new int[110]; int n = nums.length, ans = 0; for (int i = 0; i &lt; n; i++) { int t = nums[i]; if (t - k &gt;= 1) ans += cnts[t - k]; if (t + k &lt;= 100) ans += cnts[t + k]; cnts[t]++; } return ans; }} 点击查看语法 >folded123456789101112131415​```javaclass Solution { public int countKDifference(int[] nums, int k) { int[] cnts = new int[110]; int n = nums.length, ans = 0; for (int i = 0; i &lt; n; i++) { int t = nums[i]; if (t - k &gt;= 1) ans += cnts[t - k]; if (t + k &lt;= 100) ans += cnts[t + k]; cnts[t]++; } return ans; }}​``` 其他语法脚注使用 Markdown[1]可以效率的书写文档。 123使用 Markdown[1]可以效率的书写文档。[^1]:Markdown是一种纯文本标记语言 注释 1&lt;!--这是注释内容--&gt; 在Hexo中可以用&lt;!-- more --&gt;来分隔文章的简介和正文。 锚点锚点能够实现文章页内的超链接点击跳转至列表内容 12&lt;a href='#list'&gt;&lt;button class=&quot;button is-info&quot;&gt;点击跳转至列表内容&lt;/button&gt;&lt;/a&gt;&lt;a name='list'&gt;锚点&lt;/a&gt; 公式 使用提醒 请配合MathJax插件在页面中渲染显示TeX公式。当使用Tex语法时，请使用$或\\\\(与\\\\)包裹行内公式，$$或\\\\[与\\\\]标签对包裹块状公式； 或者使用LaTeX环境。 行内公式：\\(ax^2+bx+c=0\\) 块状公式1：$$\\displaystyle \\frac{1}{\\Bigl(\\sqrt{\\phi \\sqrt{5}}-\\phi\\Bigr) e^{\\frac25 \\pi}} =1+\\frac{e^{-2\\pi}} {1+\\frac{e^{-4\\pi}} {1+\\frac{e^{-6\\pi}}{1+\\frac{e^{-8\\pi}} {1+\\cdots} } } }$$ 块状公式2：\\[f(x) = \\int_{-\\infty}^\\infty\\hat f(\\xi)e^{2 \\pi i \\xi x}d\\xi\\] 使用\\(\\LaTeX\\)环境：\\begin{equation}A =\\begin{bmatrix} a &amp; b \\\\ c &amp; c\\end{bmatrix}\\end{equation} 点击查看语法 >folded123456789101112131415161718行内公式：\\\\(ax^2+bx+c=0\\\\)块状公式1：$$\\displaystyle \\frac{1}{\\Bigl(\\sqrt{\\phi \\sqrt{5}}-\\phi\\Bigr) e^{\\frac25 \\pi}} = 1+\\frac{e^{-2\\pi}} {1+\\frac{e^{-4\\pi}} {1+\\frac{e^{-6\\pi}} {1+\\frac{e^{-8\\pi}} {1+\\cdots} } } }$$块状公式2：\\\\[f(x) = \\int_{-\\infty}^\\infty\\hat f(\\xi)e^{2 \\pi i \\xi x}d\\xi\\\\]使用\\\\(\\LaTeX\\\\)环境：\\\\begin{equation}A =\\\\begin{bmatrix} a &amp; b \\\\\\\\ c &amp; c\\\\end{bmatrix}\\\\end{equation} LateX公式的详细语法，请参考以下内容。 流程图 流程图直观地描述一个工作过程的具体步骤图，它使用图形表示流程思路 点击查看语法 >folded12345678910st=&gt;start: 开始节点in=&gt;inputoutput: 输入e=&gt;end: 结束节点op=&gt;operation: 操作节点cond=&gt;condition: 条件节点sub=&gt;subroutine: 子例程out=&gt;inputoutput: 输出st(right)-&gt;in-&gt;op-&gt;condcond(yes,right)-&gt;out-&gt;econd(no)-&gt;sub 画廊 Icarus的画廊插件同时包含了lightGallery与Justified Gallery两种插件。 若要启用画廊插件，请将主题配置中plugins &gt; gallery的值设置为true。如果你使用的是Markdown语法来引用图片的话，请在HTML标签和Markdown之间添加空行使其生效。 点击查看语法 >folded12345678910111213&lt;div class=&quot;justified-gallery&quot;&gt;![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/1.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/3.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/4.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/5.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/6.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/7.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/8.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/9.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/10.jpeg)&lt;/div&gt; Bulma Bulma 是一个基于 Flexbox 的现代化的 CSS 框架，设计的初衷就是移动优先（Mobile First），模块化设计，可以轻松用来实现各种简单或者复制的内容布局。本站主题Icarus即采用了该样式框架，在基于Markdown语法同时可搭配Bulma进行写作。注意，在使用Bulma之前，请确认是否已引入Bulma.css文件。 以下内容均参考自iMaeGoo的活用 Bulma 美化 Icarus 文章 彩色突出按钮 Info Success Warning Danger 点击查看语法 >folded123456&lt;div class=&quot;buttons&quot;&gt; &lt;button class=&quot;button is-info&quot;&gt;Info&lt;/button&gt; &lt;button class=&quot;button is-success&quot;&gt;Success&lt;/button&gt; &lt;button class=&quot;button is-warning&quot;&gt;Warning&lt;/button&gt; &lt;button class=&quot;button is-danger&quot;&gt;Danger&lt;/button&gt;&lt;/div&gt; 进度条 点击查看语法 >folded12345&lt;progress class=&quot;progress is-info&quot; value=&quot;20&quot; max=&quot;100&quot;&gt;&lt;/progress&gt;&lt;progress class=&quot;progress is-success&quot; value=&quot;40&quot; max=&quot;100&quot;&gt;&lt;/progress&gt;&lt;progress class=&quot;progress is-warning&quot; value=&quot;60&quot; max=&quot;100&quot;&gt;&lt;/progress&gt;&lt;progress class=&quot;progress is-danger&quot; value=&quot;80&quot; max=&quot;100&quot;&gt;&lt;/progress&gt;&lt;progress class=&quot;progress is-info&quot; max=&quot;100&quot;&gt;&lt;/progress&gt; 文本块 Markdown为简单而生，它是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。由于Markdown的轻量化、易读易写特性，并且对于图片，图表、数学式都有支持，许多网站都广泛使用Markdown来撰写帮助文档或是用于论坛上发表消息。如GitHub、Reddit、Diaspora、Stack Exchange、OpenStreetMap 、SourceForge、简书等，甚至还能被使用来撰写电子书。 点击查看语法 >folded123{% raw %}&lt;div class=&quot;notification is-success&quot;&gt;{% endraw %}Markdown为简单而生，它是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。由于Markdown的轻量化、易读易写特性，并且对于图片，图表、数学式都有支持，许多网站都广泛使用Markdown来撰写帮助文档或是用于论坛上发表消息。如[GitHub](https://baike.baidu.com/item/GitHub/10145341)、[Reddit](https://baike.baidu.com/item/Reddit/1272010)、[Diaspora](https://baike.baidu.com/item/Diaspora/10726893)、[Stack Exchange](https://baike.baidu.com/item/Stack)、[OpenStreetMap](https://baike.baidu.com/item/OpenStreetMap/3171606) 、[SourceForge](https://baike.baidu.com/item/SourceForge/6562141)、[简书](https://baike.baidu.com/item/简书/5782216)等，甚至还能被使用来撰写[电子书](https://baike.baidu.com/item/电子书/346054)。{% raw %}&lt;/div&gt;{% endraw %} Markdown为简单而生，它是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。由于Markdown的轻量化、易读易写特性，并且对于图片，图表、数学式都有支持，许多网站都广泛使用Markdown来撰写帮助文档或是用于论坛上发表消息。如GitHub、Reddit、Diaspora、Stack Exchange、OpenStreetMap 、SourceForge、简书等，甚至还能被使用来撰写电子书。 点击查看语法 >folded123{% raw %}&lt;article class=&quot;message is-success&quot;&gt;&lt;div class=&quot;message-body&quot;&gt;{% endraw %}Markdown为简单而生，它是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。由于Markdown的轻量化、易读易写特性，并且对于图片，图表、数学式都有支持，许多网站都广泛使用Markdown来撰写帮助文档或是用于论坛上发表消息。如[GitHub](https://baike.baidu.com/item/GitHub/10145341)、[Reddit](https://baike.baidu.com/item/Reddit/1272010)、[Diaspora](https://baike.baidu.com/item/Diaspora/10726893)、[Stack Exchange](https://baike.baidu.com/item/Stack)、[OpenStreetMap](https://baike.baidu.com/item/OpenStreetMap/3171606) 、[SourceForge](https://baike.baidu.com/item/SourceForge/6562141)、[简书](https://baike.baidu.com/item/简书/5782216)等，甚至还能被使用来撰写[电子书](https://baike.baidu.com/item/电子书/346054)。{% raw %}&lt;/div&gt;&lt;/article&gt;{% endraw %} Markdown写作与进阶 Markdown为简单而生，它是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。由于Markdown的轻量化、易读易写特性，并且对于图片，图表、数学式都有支持，许多网站都广泛使用Markdown来撰写帮助文档或是用于论坛上发表消息。如GitHub、Reddit、Diaspora、Stack Exchange、OpenStreetMap 、SourceForge、简书等，甚至还能被使用来撰写电子书。 点击查看语法 >folded12345{% raw %}&lt;article class=&quot;message is-success&quot;&gt;&lt;div class=&quot;message-header&quot;&gt;{% endraw %}Markdown写作与进阶{% raw %}&lt;/div&gt;&lt;div class=&quot;message-body&quot;&gt;{% endraw %}Markdown为简单而生，它是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。由于Markdown的轻量化、易读易写特性，并且对于图片，图表、数学式都有支持，许多网站都广泛使用Markdown来撰写帮助文档或是用于论坛上发表消息。如[GitHub](https://baike.baidu.com/item/GitHub/10145341)、[Reddit](https://baike.baidu.com/item/Reddit/1272010)、[Diaspora](https://baike.baidu.com/item/Diaspora/10726893)、[Stack Exchange](https://baike.baidu.com/item/Stack)、[OpenStreetMap](https://baike.baidu.com/item/OpenStreetMap/3171606) 、[SourceForge](https://baike.baidu.com/item/SourceForge/6562141)、[简书](https://baike.baidu.com/item/简书/5782216)等，甚至还能被使用来撰写[电子书](https://baike.baidu.com/item/电子书/346054)。{% raw %}&lt;/div&gt;&lt;/article&gt;{% endraw %} 标签页 Pictures Music Videos Documents 网易云音乐 是一款专注于发现与分享的音乐产品,依托专业音乐人、DJ、好友推荐及社交功能,为用户打造全新的音乐生活。 哔哩哔哩 是国内知名的视频弹幕网站,这里有最及时的动漫新番,最棒的ACG氛围,最有创意的Up主。大家可以在这里找到许多欢乐。 石墨文档 是全新一代云 Office 办公软件,支持多人在线协作编辑文档和表格,独有内容级安全,全过程留痕可追溯。PC 端和移动端全覆盖,随时随地远程办公。即写即存… .content .tabs ul { margin: 0; } .tab-content { display: none; } function onTabClick (event) { var tabTitle = $(event.currentTarget).children('span:last-child').text(); $('.article .content .tab-content').css('display', 'none'); $('.article .content .tabs li').removeClass('is-active'); $('#' + tabTitle).css('display', 'block'); $(event.currentTarget).parent().addClass('is-active'); } 点击查看语法 >folded123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960&lt;div class=&quot;tabs is-toggle&quot;&gt;&lt;ul&gt;&lt;li class=&quot;is-active&quot;&gt;&lt;a onclick=&quot;onTabClick(event)&quot;&gt;&lt;span class=&quot;icon is-small&quot;&gt;&lt;i class=&quot;fas fa-image&quot; aria-hidden=&quot;true&quot;&gt;&lt;/i&gt;&lt;/span&gt;&lt;span&gt;Pictures&lt;/span&gt;&lt;/a&gt;&lt;/li&gt;&lt;li&gt;&lt;a onclick=&quot;onTabClick(event)&quot;&gt;&lt;span class=&quot;icon is-small&quot;&gt;&lt;i class=&quot;fas fa-music&quot; aria-hidden=&quot;true&quot;&gt;&lt;/i&gt;&lt;/span&gt;&lt;span&gt;Music&lt;/span&gt;&lt;/a&gt;&lt;/li&gt;&lt;li&gt;&lt;a onclick=&quot;onTabClick(event)&quot;&gt;&lt;span class=&quot;icon is-small&quot;&gt;&lt;i class=&quot;fas fa-film&quot; aria-hidden=&quot;true&quot;&gt;&lt;/i&gt;&lt;/span&gt;&lt;span&gt;Videos&lt;/span&gt;&lt;/a&gt;&lt;/li&gt;&lt;li&gt;&lt;a onclick=&quot;onTabClick(event)&quot;&gt;&lt;span class=&quot;icon is-small&quot;&gt;&lt;i class=&quot;far fa-file-alt&quot; aria-hidden=&quot;true&quot;&gt;&lt;/i&gt;&lt;/span&gt;&lt;span&gt;Documents&lt;/span&gt;&lt;/a&gt;&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;{% raw %}&lt;div id=&quot;Pictures&quot; class=&quot;tab-content&quot; style=&quot;display: block;&quot;&gt;{% endraw %}&lt;div class=&quot;justified-gallery&quot;&gt;![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/1.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/3.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/4.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/5.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/6.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/7.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/8.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/9.jpeg)![](https://chenspace.oss-cn-shanghai.aliyuncs.com/gallery/food/10.jpeg)&lt;/div&gt;{% raw %}&lt;/div&gt;{% endraw %}{% raw %}&lt;div id=&quot;Music&quot; class=&quot;tab-content&quot;&gt;{% endraw %}[网易云音乐](https://music.163.com/) 是一款专注于发现与分享的音乐产品,依托专业音乐人、DJ、好友推荐及社交功能,为用户打造全新的音乐生活。{% raw %}&lt;/div&gt;{% endraw %}{% raw %}&lt;div id=&quot;Videos&quot; class=&quot;tab-content&quot;&gt;{% endraw %}[哔哩哔哩](https://www.bilibili.com/) 是国内知名的视频弹幕网站,这里有最及时的动漫新番,最棒的ACG氛围,最有创意的Up主。大家可以在这里找到许多欢乐。{% raw %}&lt;/div&gt;{% endraw %}{% raw %}&lt;div id=&quot;Documents&quot; class=&quot;tab-content&quot;&gt;{% endraw %}[石墨文档](https://shimo.im/) 是全新一代云 Office 办公软件,支持多人在线协作编辑文档和表格,独有内容级安全,全过程留痕可追溯。PC 端和移动端全覆盖,随时随地远程办公。即写即存...{% raw %}&lt;/div&gt;{% endraw %}&lt;style type=&quot;text/css&quot;&gt;.content .tabs ul { margin: 0; }.tab-content { display: none; }&lt;/style&gt;&lt;script&gt;function onTabClick (event) { var tabTitle = $(event.currentTarget).children('span:last-child').text(); $('.article .content .tab-content').css('display', 'none'); $('.article .content .tabs li').removeClass('is-active'); $('#' + tabTitle).css('display', 'block'); $(event.currentTarget).parent().addClass('is-active');}&lt;/script&gt; 文字黑幕 .heimu { color: #000; background-color: #000; } .heimu:hover { color: #fff; } 📱：👉 有内鬼，终止交易！ 👈 点击查看语法 >folded12345678{% raw %}&lt;style type=&quot;text/css&quot;&gt;.heimu { color: #000; background-color: #000; }.heimu:hover { color: #fff; }&lt;/style&gt;{% endraw %}📱：{% raw %}&lt;span class=&quot;heimu&quot;&gt;有内鬼，终止交易！&lt;/span&gt;{% endraw %} 图片来源 &nbsp;&nbsp;Hello Markdown 点击查看语法 >folded12345&lt;img src=&quot;https://chenspace.oss-cn-shanghai.aliyuncs.com/uPic/Hello%20Markdown.jpg&quot; /&gt;&lt;a class=&quot;tag is-dark is-medium&quot; href=&quot;https://chenspace.oss-cn-shanghai.aliyuncs.com/uPic/Hello%20Markdown.jpg&quot; target=&quot;_blank&quot;&gt;&lt;span class=&quot;icon&quot;&gt;&lt;i class=&quot;fas fa-camera&quot;&gt;&lt;/i&gt;&lt;/span&gt;&amp;nbsp;&amp;nbsp;Hello Markdown&lt;/a&gt; 特别提醒 以上部分的语法代码块中可能省略了展示时的图片缩放、文字大小等样式调整，并不影响语法的学习，请具体以实际调试的结果为准。 Markdown写一个简历 以下简历内容来自互联网，本文用Markdown语法编辑为该简历样式。 DonaldNo.67, Lane123, Job Road, Job District, Shanghai, ChinaT:(+86) 138-0013-8000 E:service@test.comSkype:qiaobujianli JOB OBJECTIVE Commercial Officer EDUCATION Shanghai University of Finance and Economics GPA:3.6/4 2009.09-2013.06 Bachelor of Science in economic management, expected July 2013 e-commerce Shanghai Second prize Scholarship (awarded to the top 10%) PROFESSIONAL EXPERIENCE KUKA Robotics China Co. Ltd 2012.10-Present Intern, Order Processing Officer Shanghai Be responsible for the overall processing, following-up and coordinating of Sales Order Act as liaison between Sales and Production Finance on various order management issues Keepromo Shanghai Co. Ltd 2011.07-2012.10 Customer Service Intern Shanghai Foreign trade English customer service Communicate with foreign customers of the product/order/inquiry via email and telephone Collect the feedback of customers about the products and the market ENGLISH SKILLS “Outlook English Talent Competition” in Shanghai area Third prize College English Test Band 6 (CET 6) Excellent Financial English Certificate Test (FECT) Level A Excellent in written and verbal communication in English ACTIVITIES Shanghai World Expo volunteers Team Leader Won the “advanced collective” award, and won the “excellent organizer” Recruitment &amp; Publicity, volunteer training Dealing with emergencies, management organization and coordination OTHER INFORMATION Excellent Student Leader (only **student can get this honor) Fluent at MS Office Psychology, Pedagogic, Music, Dancing, Literature st=>start: 开始节点 in=>inputoutput: 输入 e=>end: 结束节点 op=>operation: 操作节点 cond=>condition: 条件节点 sub=>subroutine: 子例程 out=>inputoutput: 输出 st(right)->in->op->cond cond(yes,right)->out->e cond(no)->sub{\"scale\":1,\"line-width\":2,\"line-length\":50,\"text-margin\":10,\"font-size\":12} var code = document.getElementById(\"flowchart-0-code\").value; var options = JSON.parse(decodeURIComponent(document.getElementById(\"flowchart-0-options\").value)); var diagram = flowchart.parse(code); diagram.drawSVG(\"flowchart-0\", options);1.Markdown是一种纯文本标记语言 ↩","link":"/2022/37b6648aea4c/"},{"title":"华为专利质量标准","text":"华为在国内甚至全球都属于专利领域的领军企业，每年研发费用占比高达营收的10%-15%，近年来的专利申请量稳居世界第一，同样其对于专利的质量要求也很严格，在其公布的专利质量标准中包括已经或较大可能影响到权利要求中技术方案的清楚性、完整性、可实现性、保护范围、保护全面性等23项实质问题，7项形式问题。该文档资源搜集于互联网，整理后仅供参考和学习。 摘要标准 问题 原因说明 超过300字（包括标点符号） 不符合审查指南关于说明书摘要不超过300个字的规定。 缺少发明名称、所属技术领域、所要解决的技术问题、技术方案的要点以及主要用途中的一项或多项内容 不符合审查指南关于说明书摘要应该包括发明名称、所属技术领域、所要解决的技术问题及技术方案要点、主要用途的规定。 有商业性宣传用语 不符合审查指南关于说明书摘要不应使用商业性宣传用语的规定。 权利要求书标准实质问题 问题 原因说明 一个独立权利要求不能实现其在发明内容中的发明目的；或者技术方案与发明本身要保护的主题不一致或不合适 1、发明目的是指独立权利要求的技术方案能达到的发明目的，如果独立权利要求的技术方案不能实现或只能部分地实现发明目的，那么审查员极有可能认为该独立权利要求缺少必要技术特征或不完整；2、保护主题确定不正确时，也有可能导致技术方案缺少必要技术特征或包括非必要技术特征。 权利要求不清楚，语言晦涩或有歧义，造成权利要求保护范围不确定 专利法第26条第四款明确规定：权利要求应当以说明书为依据，说明发明或者实用新型的技术特征，清楚并简要地表述请求保护的范围。 充分理解技术方案，句式建议采用短句，词语建议采用具有普通意义的用语，满足“通俗易懂”原则。 独立权利要求相对现有技术没有区别技术特征，缺乏新颖性 1、专利授权的条件是：具有新颖性、创造性和实用性；2、撰写权利要求时，应当重点考虑新颖性和创造性。独立权利要求至少满足如下要求：（1）至少有一个发明点；（2）保证有新颖性；（3）使创造性有60分即可；（4）使创造性有70分、80分、100分的技术特征应该放在从属权利要求中来界定。该原则能保证一个独立权利要求达到合理范围内的最大保护范围。 独立权利要求包括和实现其发明目的不必要的技术特征，导致范围被不合理地缩小 专利法实施细则21条第2款规定：独立权利要求应当从整体上反映发明或者实用新型的技术方案，记载解决技术问题的必要技术特征。 在判断某一技术特征是否为所述必要的技术特征时，应当从所要解决的技术问题及达到的发明目的出发并考虑说明书描述的整体内容，不应简单地将实施例中的技术特征直接认定为所述必要的技术特征。 对独立权利要求，没有在保证其具有新颖性的前提下，将多个实施例进行上位概念，或者对一些技术特征采用不适当的上位词，没有有效地保护发明点，即没有从字面侵权的角度来写 1、虽然在很多国家，在判断侵权时，等同原则都适用，但是，在适用等同原则时，或多或少地都存在一些限制，且近年来，所述的限制越来越多；2、在美国，如果实施例公开的技术方案没有被权利要求字面覆盖，则视专利权人主动放弃对该部分的保护；专利权人是不能利用等同原则将权利要求的保护范围扩大到其放弃的部分。 独立权利要求的布局不合理，没有包括必要的方法、系统、关键装置和/或关键部件的独权，即不符合产业链布局原则，制造侵权优先原则，方法与装置并重的原则 1、专利申请的最终目的不是获得授权，而是授权后的使用。所以，在申请专利时，一定要从产业链的角度重点考虑独立权利要求的覆盖对象，覆盖范围，否则将会使专利的价值降低；2、直接写装置权利要求，可以使制造者形成制造侵权，所以，对于发明点在于方法的发明，一定要基于方法发明构建产品或虚拟装置权利要求。产业链包括但不限于：芯片或器件-单板或模块-设备-系统-网络及相应方法、用途，配套的制造工艺/设备、测试方法/设备。 没有适当的功能单元构成的装置权利要求和/或产品权利要求 根据现行审查指南的规定：在发明点为方法的申请中，如果实施例中只有方法的实施例，则布局装置独立权利要求时，只能布局一个和方法一一对应的装置权利要求，且根据当前审查员的意见：该装置权利要求的保护范围不会扩大到硬件实体。 [指导]：1、首先，根据方法实施例，从功能的角度构建一个以功能单元构成的装置实施例；并根据方法的实施例构建一个实际产品的实施例；在构建以功能单元构成的装置或产品实施例时，应当尽可能地详细和清楚，详细和清楚的程度以最小组成部分是现有技术为准。且在撰写实施例时，对于最小组成部分的现有技术，也要尽可能地给出一个或多个具体的例子；2、然后根据构建的实施例来撰写独立权利要求，通常来讲，独立权利要求可以包括四种类型：A、方法独立权利要求；B、和方法权利要求一一对应虚拟装置权利要求；C、不和方法权利要求步骤一一对应的以功能单元构成的装置权利要求；D、实际产品权利要求。3、在实际处理时，要注意二点：第一、优先构建实际产品权利要求；第二、要根据具体的案子，来决定权利要求的种类和数量。 独立权利要求没有针对性，没有一个主体能构成直接侵权 当一个独立权利要求没有针对性，尤其是没有一个主体能构成直接侵权者时，基本上意味着这个独立权利要求的实际意义就很低了。因为，通常来讲，间接侵权是以直接侵权为前提的（在美国，更是如此），所以，一般情况下，如果没有直接侵权，就意味着没有间接侵权，显然，这样的独立权利要求对于专利权人来讲，意义已经很小了。 某项从属权利要求中的技术方案不完整或者包括了本可以分成多个从属权利要求的技术方案 1、每个从属权利要求也有自己的有益效果，所以每个从属权利要求也应该包括所有实现其有益效果的必要技术特征，如果缺少必要技术特征，就会导致技术方案不完整；2、每个从属权利要求在增加新的技术特征时，一定要满足最少原则，即：在满足从属权利要求能够实现其发明目的、技术方案、完整的前提下，所增加的技术特征越少越好。否则，在无效过程中，可能会出现因合并权利要求而出现保护范围不合理缩小的情况。 从属权利要求包括和实现其有益效果不必要的技术特征，导致范围被不合理地缩小 1、对于从属权利要求，有其对应的有益效果，所以，每个从属权利要求只包括实现其有益效果的技术特征即可；2、如果一个从属权利要求记载了和实现其有益效果不必要的技术特征，由于对有益效果没有贡献，所以没有必要记载在该权利要求中。 对于方法独立权利要求，在步骤之前加上没有必要的执行主体 1、方法独立权利要求保护的是工艺、流程、操作步骤等，所以，只需要在方法独立权利要求中公开为满足发明目的需要做哪些步骤；2、至于每个步骤是由谁执行的，在很多方法中，不是使技术方案清楚、完整的必要技术特征，所以，在很多方法中，都没有必要写执行主体，除非区别技术特征仅仅在于执行主体。 方法权利要求中出现没有必要的逻辑关系限制，如在方法步骤之前用编号 对于方法权利要求中的步骤，在很多案子中，步骤间的逻辑关系不是很严格的，所以，如果加上不必要逻辑关系限制，则会不合理地缩小保护范围。 除非与现有技术的区别仅仅在于步骤的次序。 权利要求的撰写不符合相应的权利要求类型的撰写风格，如：对于方法独立权利要求，在其从属权利要求中将重点放在方法中涉及的设备：对于产品独立权利要求，在其从属权利要求中将重点放在产品中涉及的方法或处理步骤 产品权利要求和方法权利要求的保护对象是不一样的，这种保护对象的不同，产品权利要求关注产品的各个组成部件及各组成部件间的关系，而方法权利要求关注为达到发明目的，必需做哪些步骤；审查指南中也有规定，对于产品权利要求，一般情况下，不建议用方法特征来进行限定，除非是方法特征的限定更有利于说清楚发明技术方案时。 对于创造性很高或较高的发明，从属权利要求的引用关系不是并列式为主，而是以链式为主； 对创造性低的发明，不是以链式为主，而是以并列式为主 • 并列式，如权2引用权1，权3引用权1；• 链式，如权2引用权1，权3引用权2；• 并列式的从属权利要求的保护范围要比链式的大，保护的角度多；反之，链式的从属权利要求保护范围相对较小，最后有归向实施例的趋势；对于创造性较高的发明，如果采用链式，则在无效过程中，由于只能对权利要求进行合并或删除，所以可能会出现将一些不必要技术特征合并到独立权利要求中的情况；反之，对于创造性较低的发明，如果采用并列式，则可能由于创造性很低，而使专利的授权或稳定性受到影响。 多个独立权利要求明显没有单一性 1、判断多个独立权利要求间，是否存在相同的或相应的特定技术特征，并根据判断结果决定是否具有单一性；2、如果有单一性有问题，且其中每个技术方案都很重要，则应该分案申请。 出现了不必要的从属权利要求。不必要的含义是指：将从属权利要求的技术特征 从属权利要求最大的作用就是为独立权利要求提供防护墙，通过布局从属权利要求，可以使专利在授权和使用过程中，通过逐渐缩小范围的方式来增加专利的有效性。所以，如果一个从属权利要求中限定的技术特征没有使专利性增加，则该从属权利要求就基本没有存在的意义了。 • 当从权是进一步限定方式时，在保证可以增加所引用权利要求的新颖性和创造性前提下，应该加上对应从权以支持上位概念。• 当从权是补充方式时，应该判断该从权能否带来有益效果，如果是，则是必要；如果不，则是不必要。 不适当地对应用领域进行限制，致使保护范围太小，或不适当地用特定领域的名词造成的事实上领域限制 1、权利要求中每个字都是用来解释权利要求的保护范围，所以，当应用领域不是发明的唯一发明点或者主要发明点时，则不应该将应用领域写入，否则会造成权利要求保护范围的不适当缩小。2、虽然没有在权利要求中明确指出技术的应用领域，但通过特定领域的名词也可造成事实的领域限制，进而将权利要求保护范围不适当地缩小，如：因用RNC而限制在WCDMA领域，用BSC而限制在GSM领域； 3、一般情况下，都没有必要将应用领域写入独立权利要求中；4、如果发明点主要是将一个技术领域的技术转移到另外一个技术领域，且在转移的过程中没有引起物理结构、逻辑结构或流程上的明显变化，应用领域成为了主要的发明点，此时，则应该在写独立权利要求时加入应用领域，使之成为技术方案的一部分；5、将特定领域名词替换成通用技术术语。 对于发明点涉及数据结构、信令结构及算法的发明，没有将数据结构、信令结构及算法的应用保护起来，而是直接保护数据结构或信令结构或算法本身 1、 应该在权利要求中保护数据结构、信令结构及算法的应用方案。2、 应用方案的创造性判断具体为：（1）如果数据或信令结构的改变没有带来流程步骤地增加或减少，或引起流程步骤的改变，一般情况下创造性是不够的，除非有意想不到的效果；（2）如果数据或信令结构改变带来了流程的增加或减少，或引起流程改变，则可以申请专利，但在写权利要求时，一定要将流程的改变体现出来。 3、从保护应用方案的角度写独立权利要求，将算法有机地融入到权利要求中，使其成为权利要求的一部分。 功能性限定使用不得当 1、产品权利要求应当尽量避免使用功能特征来限定发明。只有在某一技术特征无法用结构特征来限定，或者结构特征限定不如用功能限定恰当，而且该功能是能通过说明书中规定的实验或者操作或者所属技术领域的惯用手段直接和肯定地验证的情况下，使用功能或者效果特征来限定产品才被允许；2、 如果采用了功能性限定，则要求对于功能部分的描述在实施例中要有至少一个具体的实施例；3、 美国对功能限定的立场，美国专利法112条明确规定了功能性限定，即在美国，可以根据自己的需要用功能性限定来写权利要求，但同样112条也规定，对于用功能性限定的权利要求，其保护范围为实施例中的范围及在申请日当时对于普通技术人员来讲的等同范围。[指导]： 1. 总的原则：由于审查指南中不提倡用功能限定，所以务必小心和谨慎的使用 ；2. 在下述几种情况下，可以用功能性限定： A、限定的对象是现有技术；B、限定的对象是发明点，但在说明书中至少有两个实施例，但用功能性限定比用技术特征限定好；3. 在调整权利要求的过程中，需要将功能性限定和逻辑关系限定区分开来，前者重点在限定结果，后者重点在限定过程；4. 只有在转用发明的情况下，才能用纯功能性限定。 对于纯软件类或业务类的权利要求，没有结合技术点来写，而只是保护概念或规则，使得权利要求中的方案偏向于智力活动规则 1、基本上所有国家都不对智力活动规则提供专利保护，但对于智力活动规则的技术实现方案是提供专利保护的；2、纯软件类或业务类的发明，通常都是将人的思想或处理规则通过技术手段来实现，所以，在处理此类专利申请时，一定要将所述的思想或处理规则结合技术手段来撰写说明书和权利要求书。 从引用关系上讲或从技术方案的逻辑关系上讲，权利要求间的关系不正确 1、每个权利要求都应该是清楚完整的技术方案，对于从属权利要求，其技术方案是指新加或进一步限定的技术特征加上其引用权利要求的技术特征的总和，所以，一旦引用关系或技术特征间的逻辑关系不准确，就会导致权利要求技术方案的不清楚、不完整，甚至出现错误。 2、认真检查从属权利要求间的引用关系，并通过制作权利要求树来检验引用关系是否有错误，如果有错误，则根据技术逻辑关系对从属权利要求的引用关系进行调整。 权利要求中出现了语气很强硬的词，如：“只有”、”就是“、” 仅仅“、“ 最好是”、“ 核心思想”、“ 必要”、“ 唯一”等 1、语气很强硬的词的限制性特别强，但专利有二十年生命周期，所以，这种限制极有可能将后续出现的等同物排除在保护范围之外。 2、超过90%的情况是没有必要保留此类词。 出现“例如”、“最好是”、“尤其是……必要时”、“等”、“或类似物”、“约”、“接近”等类似用词 审查指南明确规定：权利要求中不得出现“例如”、“最好是”、“尤其是”、“必要时”等类似用语。因为这类用语会在一项权利要求中限定出不同的保护范围，导致保护范围不清楚。在一般情况下，权利要求中不得使用“约”、“接近”、“等”、“或类似物”等类似的用语，因为这类用语通常会使权利要求的范围不清楚。 形式问题 问题 原因说明 使用表格 审查指南明确规定：权利要求中通常不允许使用表格，除非使用表格能够更清楚地说明发明或者实用新型要求保护的主题。 出现多项引用多项获间接多项引用多项 审查指南明确规定：一项引用两项以上权利要求的多项从属权利要求不得作为另一项多项从属权利要求的引用基础。 出现形式上是从属权利要求，但实质上是独立权利要求 从属权利要求应该在其引用的权利要求基础上进行补充或进一步限定，如果既不是补充，也不是进一步限定，则该从属权利要求应该就是个实质上的独立权利要求。这可能导致两个结果：A、基于上述从属权利要求没有引用到真正想引用的独立权利要求；B、可能存在单一性问题。C、侵权时可能有麻烦，具体为：权2引用权1，表面是个从权，实质是个独权，如果别人产品侵犯了权2，别人会辩解说：权2引用权1，所以权2中的技术方案包括权1中的技术特征，而我产品中却没有权1中的技术特征，所以，不侵权。 权利要求中的附图标记没有括号 审查指南明确规定：权利要求中的技术特征可以引用说明书附图中相应的标记，以帮助理解权利要求所记载的技术方案。但是，这些标记应当用括号括起来，放在相应的技术特征后面。 在不影响权利要求清楚性前提下，尽量不使用附图标记。 非附图标记加上括号 在权利要求中，对于非附图标记，是不需要加上括号的。 权利要求的发明主题中出现了“算法、程序、商业方法、数据结构、信令（格式）、帧（结构）”等 在中国，对于算法、程序、商业方法、数据结构、信令（格式）、帧结构等都不直接提供保护。所以，一旦在发明主题中出现这些词时，很有可能在审查过程中被驳回。 说明书标准发明名称 问题 原因说明 发明名称体现出的保护主题错误或保护类型错误 审查指南明确规定：发明名称应该清楚、简要、全面地反映要求保护的发明或者实用新型的主题和类型（产品或者方法），以利于专利申请的分类。 问题：1. 与权利要求不同；2. 采用上位概念。 包含有过小的技术应用领域 1、 不管过小的技术应用领域是不是发明点之一，都不建议将其写在发明名称中，因为现在中国和美国都有案例表明，技术领域都有可能成为权利要求直接或间接的限制条件之一。 2、 将发明名称中的过小技术领域删除，不过，对于大的技术领域的描述，可以保留。 包含发明点 由于发明点都比较具体，所以，如果在发明名称中包含发明点，有可能对保护的范围构成限制。 包含有不清楚的词语 不清楚的词语会导致保护主题不清楚或不明确。 包含有英文名称 已经有审查意见，要求对发明名称的英文名称删除。 超过25个字 审查指南明确规定：说明书中的发明或者实用新型的名称于请求书中的名称应当一致，一般不得超过25个字，特殊情况下，例如，化学领域的某些申请，允许最多到40个字。 包含有商业性的宣传用语、商标、产品名称 审查指南明确规定：不得使用人名、地名、商标、型号或者商品名称等，也不得使用商业性宣传用语。 技术领域 问题 原因说明 技术领域不恰当，包括：太宽或太窄 1、一方面由于有些发明涉及通用技术，如：平台类技术、视音频技术，如果技术领域太窄，则很有可能会限制权利要求的保护范围；2、另一方面在通信领域，有很多发明就是将一个领域的技术应用到另一个技术领域中，如果技术领域太宽，则创造性可能会降低。 3、在实际中，将技术领域写的宽一些问题不大，通常来讲，不需要进行修改，除非太宽；4、现在遇到的问题是“写得太窄”，需要确认实际的应用领域，然后根据确认结果对技术领域作调整。 包括发明点 1、由于发明点都比较具体，所以，如果在技术领域中包含发明点，极有可能直接或间接地对保护的范围构成限制。 2、技术领域能体现发明所属技术领域即可。 背景技术 问题 原因说明 背景技术中包含发明点 1、根据审查指南规定：背景技术公开的应该是现有技术，所以，如果将发明点公开在背景技术中，则意味着发明人或申请人自己承认所述发明点是现有技术，这一点在美国特别突出。2、将发明点从现有技术中区别出来，然后将发明点从背景技术中删除。 包括了没有必要的现有技术或背景技术过于冗长 1、背景技术如果包括了没有必要的现有技术，则会导致背景技术的描述在逻辑层次上不清楚、显得混乱，不利于理解本发明的技术方案，没有和后面的说明书和权利要求书做到前后呼应；2、背景技术过于冗长，会使得说明书篇幅过于长，会增加后续的附加费和进入国外申请时的翻译费。3、对必要的现有技术做到清楚完整地介绍，使得现有技术的描述有助于别人理解现有技术，理解现有技术存在的问题，理解发明的技术方案。 包括公司的没有公开的专利申请或其它技术资料 1、背景技术公开的应该是现有技术，所以，如果将公司没有公开的专利申请或其它技术资料公开在背景技术中，会被认为是现有技术。 2、如果对于实施例中技术方案是必须的或是有助于理解发明技术方案的，则应该在实施例部分说明。 包含本发明也不能解决的现有技术问题 1、背景技术部分中应客观地指出背景技术中存在的问题和缺点，但是，仅限于涉及由发明或者实用新型的技术方案所解决的问题和缺点。2、将本发明不能解决的技术问题从背景技术中删除。 背景技术中一对一地指出了现有技术方案及其出处 1、由于有些发明基于的现有技术可能为：竞争对手的专利、国际标准、竞争对手的论文等，如果公开了现有技术的具体出处，可能会给别人一些蛛丝马迹，以证明我司的产品的有侵权的可能。2、在美国如果针对一现有技术就写对应的出处，且在描述技术方案或技术问题描述出现错误时，在诉讼时，被人会说你错误评价现有技术，如果成立，一方面会给陪审团留下不好的影响；另一方面，如果能证明这种错误评价是有意的，则构成欺骗，进而可能导致专利无效。 没有在描述背景技术问题之前加上“在实现本发明过程中，发明人发现现有技术中至少存在如下问题”类似意思的句子 1、 考虑到我们的重要专利基本都会进入美国申请，单在美国，写在背景技术部分中的一切都被认为是现有技术，如果我们将发明人付出了创造性劳动才发现的现有技术的问题及存在原因写入背景技术，则我们的美国专利可能会因创造性问题而不被授权。2、考虑到美国专利的特点，同时，也考虑到中国专利的要求，建议在背景技术中加入如下一段话：在实现本发明过程中，发明人发现现有技术中至少存在如下问题或类似意思的话。 对现有技术的问题描述不准确或加入了主观评价 1、背景技术部分中，客观地指出背景技术中存在的问题和缺点，但是，仅限于涉及由发明或者实用新型的技术方案所解决的问题和缺点。2、将不准确的描述调整成准且的描述或将主观评价从背景技术中删除。 发明内容 问题 原因说明 对于单个独立权利要求，发明目的确定得不恰当，如：太多或太具体，进而不能被对应独立权利要求中的技术方案实现或只是部分地实现 1、发明内容中的发明目的是指独立权利要求中技术方案能达到的发明目的，所以，如果发明目的写的太多或不准确，导致独立权利要求中技术方案不能实现或只能部分地实现，那么审查员极有可能会认为：独立权利要求中技术方案缺少必要技术特征或不完整。 2、一个独立权利要求可对应一个或多个发明目的，但通常来讲，应该使发明目的对应技术方案满足：A、有新颖性；B、包括的发明点尽量少； 发明内容部分包括了从属权利要求的内容 1、美国专利诉讼中，法官已经过在多个案例中，使用发明内容中的非独立权利要求内容作为因素之一来限制权利要求的保护范围；2、审查指南规定：在技术方案这一部分，至少应反映包含全部必要技术特征的独立权利要求的技术方案，还可以给出包含其它附加技术特征的进一步改进的技术方案。可见，从属权利要求中的技术特征是可以不包括在发明内容中的。 在引出发明内容时，用“本发明提供了一种方法或系统或装置”的格式 1、在美国“本发明”是指权利要求中技术方案，所以在美国专利诉讼中，法官已经在多个案例中，使用“本发明”这几个字作为因素之一限制权利要求的保护范围；2、中国没有明确规定必须用本发明。3、用“一方面，提供了一种方法或系统或装置”或“另一方面，提供了一种发法或系统或装置”或“再一方面，提供了一种方法或系统或装置”类似的格式，即：要强调发明内容中提供的仅仅是一个实施例，而不是发明本身。 在描述技术效果时，用“本发明的技术方案具有如下优点或有益效果”的格式 1、用“上述技术方案中的一个技术方案具有如下优点或有益效果”或“上述技术方案中的另一个技术方案具有如下优点或有益效果”类似的格式，即：要强调发明内容中提供的效果仅仅是实施例的效果，而不是发明所有的全部效果。 没有有益效果的描述，或者描述不全，有益效果没有覆盖发明目的 1、审查指南明确规定：说明书应当清楚、客观地写明发明或者实用新型与现有技术相比所具有的有益效果。有益效果是指由构成发明或者实用新型的技术特征直接带来的，或者是由所述的技术特征必然产生的技术效果。2、 将该技术效果写入或补充进发明内容的技术效果描述部分。 有益效果描述中只有效果，没有结合技术特征和所要解决的技术问题进行描述 1、审查指南明确规定：有益效果可以通过对发明或者使用新型结构特点的分析和理论说明相结合，或者通过列出实验数据的方式予以说明，不得只断言发明或者实用新型具有有益效果，都应当与现有技术进行比较，指出发明或者实用新型与现有技术的区别。2、建议写成“因为采用什么技术手段，所以克服了什么技术问题，进而达到了什么技术效果”这种三段式的描述方式。 发明目的用负面用语来描述 1、审查指南明确规定：用正面的、尽可能简洁的语言客观而有根据的地反映发明或者实用新型要解决的技术问题，也可以进一步说明其技术效果。2、尽量用正面描述说明发明目的。 有“如权利要求…….所述….”和“其特征在于”类似的用语 通常来讲， “如权利要求…….所述….”和“其特征在于”类似的用语只有在权利要求中才会出现，如果出现在说明书中，则不是很符合说明书的语言习惯。 发明内容没有随独立权利要求的修改而做适应性修改 1、发明内容中的技术方案应该和独立权利要求中技术方案保持一致。2、在审核专利的过程中，如果对独立权利要求有增加、删除、修改或重写，则应该对发明内容作相应的调整，使二者保持一致。 附图说明 问题 原因说明 在附图说明中，没有正确地说明，附图是现有技术还是本发明的实施例附图 1、如果将包含发明点的附图描述成现有技术，一方面说明专利申请撰写人对发明并没有真正地理解；另一方面可能会因申请人自己将发明点承认为现有技术而使权利要求创造性降低。2、将现有技术和发明区分开，然后正确地描述附图是现有技术还是发明的实施例附图。需要特别注意的是：一定不要将发明的实施例附图描述成现有技术附图。 发明方案附图前面没有说明是“本发明…实施例的…图”的格式 用“本发明…实施例的…图”或类似的格式，即：要强调附图只是一个实施例，而不是发明的全部。 现有技术图前面没有说是现有技术 在附图说明中，明确将现有技术的附图指出来。 在图有引用关系时，没有说清楚引用关系 如果附图有引用关系，说明其附图中技术方案有技术上的关系，所以，如果没有说清楚引用关系，则极有可能导致实施例说明时，技术方案出现不清楚或错误。 实施例 问题 原因说明 实施例描述过于简单或是一个不完整的、不清楚的技术方案 1、实施例应该清楚、完整，特别是发明点部分，尤其需要详细地公开；2、公开的详细程度，应该到所公开的最小的每一部件或步骤都是现有技术。 在权利要求有概括或上位时，实施例中只有一个实施例（实施例包括：技术方案、技术点、技术术语） 1、审查指南明确规定：当权利要求（尤其是独权）覆盖的保护范围较宽，其概括不能从一个实施列中找到依据时，应当给出一个以上的不同实施例，以支持要求保护的范围。2、可见，不管有没有概括，或概括的高度怎么样，如果有两个或以上的实施例，总是有好处的。3、可以基于已有实施例通过简单的变化和调整方式来构建其他实施例。 没有将产品和方法的实施例分开撰写 1、现在有些代理人在写实施例时，将产品和方法混写在一起，虽然不一定不支持，但在以后需要证明支持时，会比较麻烦。2、对于发明点在方法的发明，都要求大家写虚拟的装置权利要求，实际对应产品权利要求，方法权利要求，此时，如果仅仅在实施例中有方法的实施例，则虚拟的装置权利要求保护范围就会被限缩在软件实现的范围内。 没有将有助于理解本发明的现有技术或必不可少的现有技术写入实施例中 1、专利法第26条第3款明确规定：说明书应当对发明或者实用新型作出清楚、完整的说明，以所属技术领域的技术人员能够实现为准。2、审查指南明确规定：为了方便专利审查，也为了帮助公众更直接地理解发明或者实用新型，对于那些就满足专利法第26条第3款的要求而言必不可少的内容，不能采用引证其他文件的方式撰写，而应当将其具体内容写入说明书。3、在通信领域，由于发明的技术方案普遍来讲，要比机械类或家用电子产品类复杂，所以即使是现有技术，审查员或律师或法官也不一定知道，所以从这个角度来讲，也是有必要将必不可少的现有技术公开在实施例中。 实施例中，在描述具体的技术方案时，直接用“本发明”来限定 用“本发明的一个实施例”或类似的格式，即：要强调提供的仅仅是实施例，而不是发明的所有。 当发明是软件发明，且该软件可以作为独立的产品销售或使用时，在实施例中没有指出该发明对应的软件可以存储在一个计算机可读取存储介质中 1、虽然在中国现在不保护计算机可读取存储介质，但在欧洲和美国都保护，未来中国也可能保护，所以为了使此类专利在进入美国和欧洲后可以享受保护，在中国申请应该在实施例中加上相应的描述，以为后续进入美国和欧洲加计算机可读取存储介质权利要求作铺垫。2、在说明书中加入一段类似的话“本领域普通技术人员可以理解实现上述实施例方法中的全部或部分步骤是可以通过程序来指令相关的硬件来完成，所述的程序可以存储于一计算机可读取存储介质中，该程序在执行时，包括如下步骤：（方法的步骤），所述的存储介质，如：ROM/RAM、磁碟、光盘等。” 当有方法实施例时，没有适当地构建能实现方法的装置实施例 1、根据现行审查指南规定：方法申请中，如果实施例中只有方法实施例，则布局装置权利要求时，只能根据方法权利要求虚拟布局一个和方法一一对应的以功能单元构成的装置权利要求。2、根据方法实施例，从功能角度构建一个以功能单元构成的装置实施例；并根据方法实施例中的步骤和产品的关系构建一个实际产品的实施例；在构建功能单元构成的装置或产品实施例时，应该尽可能地详细和清楚，详细和清楚的程度以最小组成部分是实现有技术为准。3、实体产品的实施例优先，在实体产品实施例无法构建时，才构建方法步骤对应的以功能单元构成的装置实施例。 实施例中出现了语气很强硬的词，如：只有、就是、仅仅、最好是、核心思想、必要、唯一等 1、语气很强硬的词的限制性特别强，但专利有二十年生命周期，所以，这种限制极有可能将后续出现的等同物排除在保护范围之外。2、注意：超过90%的情况是没有必要保留此类词。 没有在每个实施例的最后集中地对该实施例所能达到的技术效果进行集中描述 1、技术效果是证明创造性存在的强有力因素之一，如果发明技术方案本身所具有的技术效果未写入实施例中，则在后续进行补充时，不管是主动修改还是被动修改，都或多或少存在修改超范围的可能。2、在每个实施例的后面，说明该实施例所能达到的技术效果。 对应每条权利要求，没有一个或多个实施例支持；或，每条权利要求中公开的内容在实施例中没有或不对应 1、出现这种情况，极有可能被认为是权利要求得不到说明书的支持。2、确保实施例能够完全支持权利要求。 描述同一部件在前后用不同的术语 技术特征不一致，可能会导致技术方案不清楚，甚至出现错误。 说明书中没有尽量用短句，而是使用已经或可能导致意思表达不清楚或有歧义的长句 1、专利是给非技术人员看的，所以我们应该遵循通俗易懂原则，尽量使用短句，尽量使用规范的易懂的术语。2、采用“通俗易懂”的原则，尽量用短句。 有附图，但在实施例中却没有说明和相对应的描述 1、通常来讲，附图的表达准确度和清楚度还是不如文字的，另外，附图也不能体现技术效果及解决技术问题的细节。2、在实施例中加上附图的文字说明，包括但不限于：技术方案、技术效果的描述。 用大量的软件语言来代替自然语言的文字描述 1、审查指南明确规定：说明书中应当以所给出的计算机程序流程为基础，按照该流程的时间顺序，以自然语言对该计算机程序的各步骤进行描述。2、在附图中增加软件语言所对应的流程图；3、在实施例中结合流程图，用自然语言对流程图进行描述。 实施例中的附图标记与附图中不一致 根据审查指南的规定：实施例中的附图标记应该与附图中的一致。 附图标记有括号 审查指南明确规定：对照附图描述发明或者实用新型的优选的具体实施方式时，使用的附图标记或者符号应当与附图中所示的一致，并放在相应的技术名称的后面，不加括号。 包括有“如权利要求……所述…”和“其特征在于”的类似用语 “如权利要求……所述…”和“其特征在于”类似的用语，通常来讲，只有在权利要求中才会出现，如果出现在说明书中，则不符合说明书的语言习惯。 第一次出现英语缩写时没有英语全文和中文翻译 审查指南明确规定：在说明书中第一次使用非中文技术名词时，应当用中文译文加以注释或者使用中文给予说明。给出中文译文和英文全称。 出现可以避免的商品名称、型号等 商品名称和型号对于说明书的清楚、完整、公开充分等没有任何的帮助，且公开之后，反而会透露一些我们产品信息。 附图中的描述文字与说明书不一致 附图中的描述文字如果和说明书中不一致，则可能使附图对说明书的辅助说明作用受到影响，有时还可能使技术方案发生不清楚或错误。 说明书附图 问题 原因说明 附图有不必要的文字说明 审查指南明确规定：附图中除了必需的词语外，不应当含有其他的注释；但对于流程图、框图一类的附图，应当在其框内给出必要的文字或符号。 对不同的部件用同一个附图标记 审查指南明确规定：一件专利申请有多幅附图时，在用于表示同一实施方式的各幅图中，表示同一组成部分（同一技术特征或者同一对象）的附图标记应当一致。 多个图用一个附图编号 审查指南明确规定：对于附图，应该按顺序进行编号，不能多个图用同一个附图编号。 流程图中的英文没有翻译 对于中文的专利申请，不管是说明书文字部分还是附图部分，都应该尽量用中文来描述。 说明 1、如果在整个说明书和说明书附图中，上述的形式问题出现少于3处，则表明该代理人在态度上是好的，且在写案子时是认真的，可以建议代理人进行修改。2、如果在整个说明书和说明书附图中，上述的形式问题出现超过5处，则表明该代理人在态度上有问题，同时也能在一定程度上反映出该代理人的水平较低，这时为了提高代理人的水平和保证专利申请的质量，还是强制要求代理人进行修改。 PDF悦读和下载 &nbsp;&nbsp; Huawe Logo","link":"/2021/dc9432549345/"},{"title":"使用Anki高效记忆","text":"Anki是什么？Anki是一款记忆闪卡应用，它所采用算法SuperMemory2是一种拟人记忆曲线的算法，能够针对用户的刷题记录进行降频复习，从而减少无必要的二次复盘。例如你刷到了一题你已经感觉基本掌握的试题，在你为该题选择“犹豫/想起”的标签时就决定该题的简易度，目前的最高简易度为130%，Anki初次以2天为间隔为你推送一次该试题，如果你觉得还是很ok，该题的推送间隔会被继续拉长，如4天，并降低该题的保留度。 为什么使用Anki艾宾浩斯遗忘曲线遗忘曲线显示了大脑对新信息的记忆是如何衰退的，保留率下降速度最快的地方是在20分钟后，曲线在一天后趋于平稳。学习曲线则与遗忘曲线相反，它说明了我们学习新信息的速度。 间隔效应 尝试将学习知识的过程分布在多个分散的时间区间里，我们反而能够更好地回想起这些知识。当我们使用间隔重复来学习时，遗忘曲线就会发生一定的变化。 如何用好AnkiAnki支持windows、Mac os、Android、IOS，用户可以将牌组资源上传到账号空间，并共享给来自全世界各地的Anki用户！Anki官方地址(https://apps.ankiweb.net/)，当然你也可以访问(Anki中国)。 如果你想深入了解Anki更多的用法，那么这一篇长达三万字的长文 量子物理学家是如何使用 Anki 的？你值得一阅，原文是 Augmenting Long-term Memory ，其作者 Michael Nielsen 是量子物理学家、科学作家、编程研究者，现供职于 Y Combinator Research 。他在《自然》等期刊发表过多篇高引论文，他写作的量子力学和深度学习教材也广受欢迎。作者在该文记录了用 Anki 增强科研和生活中长期记忆的经验，同时也写了他对广义上的记忆软件的深刻思考。 Anki卡片支持录入 语音 视频 文本(填空、选择) ORC 图片 Anki的基本用法：选择题闪卡的批量制作本教程的可行性不局限于windows(作者使用的是Mac os)，以下是教程需要的支持工具列表： Microsoft Word Microsoft Excel 记事本(文本编辑) Anki 制卡思路 思路很重要，在开始详细的教程之前，我们首先需要明确的是我们的整体制卡流程，一套科学严谨的制卡规范能够带来更高的制卡效率： 在Microsoft Word中规范化试题格式。 将文本转换表格后拷贝到Microsoft Excel。 单元格整合，符合卡片模板：问题（1列）+ 选项（1列）+ 答案（1列）+ 解析（1列）。 拷贝到UTF-8格式的文本文件。 将文本文件导入到Anki中。 如果你理解了如上所述的制卡流程，那么恭喜你基本已经掌握如何制做记忆卡片的核心了，至于为什么提了这么多，是因为下面的“试题格式规范化”、“单元格整合”步骤看起来很繁琐，各种公式会让你眼花缭乱，理解起来可能也很困难。 制卡流程这里准备了一套2017年司法考试真题，为了方便展示，我截选了其中的前十道题，题干部分包含了问题、选项、答案和解析四个部分；本方法参考了(anki|批量制作选择题的又一种思路 - 黄河的六一的文章 - 知乎)，并在作者方法的基础上加以拓展和补充；本教程中选用的Anki模板：NetTeel：【Anki模板】Monokai风格之随机选项多功能模板1.0（单选、多选二合一）。 规范化试题格式 清除无关数据信息，题目中仅需保留题干、答案及解析部分，其余信息一概删除，包括答案标签和解析标签，这两部分我会在规范化过程中利用换行符将其替换。 清除所有空格、制表符(^t)和换行符(^p) 用换行符替换所有题号(^#.)、选项号(^$.)、答案标签(“试题答案”)、解析标签(“试题解析”) 规范格式试题样本。 文本转换表格 在Microsoft Word中，全选文字→菜单栏→插入→将文字转化为表格。 可以看到转化为了一个10行7列的表格，10行代表了10道题，7列分别代表题目、选项(ABCD)、答案、解析。 将表格全部复制到Excel中。 单元格整合 Excel中的视图： 如上图所示，在H1中填入公式=B1&amp;CHAR(10)&amp;C1&amp;CHAR(10)&amp;D1&amp;CHAR(10)&amp;E1将B1至E1合并，其中 CHAR(10) 的意思是自动换行，所以H1中的内容是不连续的。 H1合并完成后下拉，保证该列都是B至E的合并项。 在I列输入{{c1::____}}，该组合在Anki中时挖空的标签，在闪卡正面会显示一个下划线。在J1输入A1&amp;I1，即问题加下划线的组合。 columns contents J 记忆的卡片正面的问题部分 H 选项组合，由ABCD四个选项加换行符组成 F 试题答案 G 试题解析 结构上一目了然，将J、H、F、H列全部复制后以值的形式保存到新的四列，题目模板制作完成。 Excel → txt(UTF-8) 打开记事本或者文本编辑器，复制粘贴表格的内容，最终以UTF-8的纯文本格式保存到本地。 导入Anki打开Anki，选择一个已存在的记忆库或者新建一个记忆库，导入UTF-8的文本文件。 注意以下情况会导致制卡失败或显示异常： Excel表中拷贝到文本编辑器中的数据不是值的形式。 最终表数据一定从A1开始，否则导入到文本编辑器中的样式不符合模板要求。 左侧为错误文本样式，右侧为正确文本样式。尽管左边的样式可能看起来更工整一些，但还是右侧的符合模板要求。 补充 很多情况下试题答案和题干是分开的，这种情况需要将题干与答案分开处理，将试题答案部分单独拷贝到一个文档中并对其进行格式规范化，其次将题干文字转化的表格在右侧插入一列，将规范化的试题答案部分拷贝在这一列中，后续步骤与上述一致。 自建Anki同步服务器 由于Anki官方的服务器在国外，所以账户上的卡组向手机同步数据时速度很慢，科学上网的效果也仍然不是很理想，所以自己动手在还未到期Aliyun服务器中搭建一个数据服务器来方便个人数据的同步。 服务器安装ankisyncd服务器安装依赖： python3 pip3 git 1.进入云主机，如果没安装相应版本，请先安装环境。2.环境检查没问题后，从github上clone服务器源码： 1git clone https://github.com/tsudoko/anki-sync-server.git 3.安装git子模块和python模块环境 123456# anki-sync-server目录下git submodule update --init# anki-bundled目录下pip install -r requirements.txtpip install webob 服务器配置1.安装完成后，如果有需要可以更改服务器的配置文件ankisyncd.conf。 host对应服务器的监听地址，默认0.0.0.0表示接受所有IP请求，如果设置为127.0.0.1，那么将无法接受外网的请求； port对应监听服务器的端口； data_root对应同步数据的保存目录； base_url对应基本的卡组文本数据目录； base_media_url对应媒体文件目录； base_media_url对应媒体文件目录。 2.添加服务器用户，并为其设定密码。 1./ankisyncctl.py adduser &lt;username&gt; 服务器运行在anki-sync-server目录下后台启动服务器，即ankisyncd文件。 1nohup python -m ankisyncd &amp; 或者使用screen： 12345# 新建窗口Screen -S anki# 运行服务器python -m ankisyncd# 看到下面这个窗口时，ctrl A + D关闭窗口，保持后台运行 在网页中输入你的主机IP+端口号出现Anki Sync Server，说明服务器创建运行成功，如果没有显示，请检查。 Anki PC端配置在Anki组件添加下打开插件安装目录addons21，在其目录下创建文件夹ankisyncd，在ankisyncd文件夹下创建文件_ ini _.py，然后重启anki后点击同步，输入之前添加的服务器用户及密码，添加卡组文件，完成pc端的文件上传。 点击展开代码 >folded1234567import anki.sync, anki.hooks, aqtaddr = &quot;http://127.0.0.1:27701/&quot; # 你的服务器地址和端口号anki.sync.SYNC_BASE = &quot;%s&quot; + addrdef resetHostNum(): aqt.mw.pm.profile['hostNum'] = Noneanki.hooks.addHook(&quot;profileLoaded&quot;, resetHostNum) 注意，如果你需要更改端口号必须保证在安全组中放行了该端口。 Anki 安卓端配置(暂不支持ios)在手机上打开anki，点击设置–高级设置–自定义同步服务器，填写相应的地址后，刷新同步按钮，输入服务器用户及密码，选择从AnkiWeb上传或下载卡组资源。","link":"/2021/11b276091416/"},{"title":"分享给正在努力的你！","text":"与其说我们选择了命运，倒不如说命运选择了我们。不要觉得自己伟大，也不要觉得自己渺小，认识到人类的有限性，接受事与愿违，不念过去，不畏将来，做好当下的自己。本篇致谢出自中科大博士黄国平的博士毕业论文，当你弥留迷茫虚无之际，建议反复观看，希望看完后能够救赎到Emo的你。 致谢我走了很远的路，吃了很多的苦，才将这份博士学位论文送到你的面前。二十二载求学路，一路风雨泥泞，许多不容易。如梦一场，仿佛昨天一家人才团聚过。 出生在一个小山坳里，母亲在我十二岁时离家。父亲在家的日子不多，即便在我病得不能自己去医院的时候，也仅是留下勉强够治病的钱后又走了。我十七岁时，他因交通事故离世后，我哭得稀里糊涂，因为再得重病时没有谁来管我了。同年，和我住在一起的婆婆病故，真的无能为力。她照顾我十七年，下葬时却仅是一副薄薄的棺材。另一个家庭成员是老狗小花，为父亲和婆婆守过坟，后因我进城上高中而命不知何时何处所终。如兄长般的计算机启蒙老师邱浩没能看到我的大学录取通知书，对我照顾有加的师母也在不惑之前匆匆离开人世。每次回去看他们，这一座座坟茔都提示着生命的每一分钟都弥足珍贵。 人情冷暖，生离死别，固然让人痛苦与无奈，而贫穷则可能让人失去希望。家徒四壁，在煤油灯下写作业或者读书都是晚上最开心的事。如果下雨，保留节目就是用竹笋壳塞瓦缝防漏雨。高中之前的主要经济来源是夜里抓黄鳝、周末钓鱼、养小猪崽和出租水牛。那些年里，方圆十公里的水田和小河都被我用脚测量过无数次。被狗和蛇追，半夜落水，因蓄电瓶进水而摸黑逃回家中;学费没交，黄鳝却被父亲偷卖了，然后买了肉和酒，都是难以避免的事。 人后的苦尚且还能克服，人前的尊严却无比脆弱。上课的时候，因拖欠学费而经常被老师叫出教室约谈。雨天湿漉着上课，屁股后面说不定还是泥。夏天光着脚走在滚烫的路上。冬天穿着破旧衣服打着寒颤穿过那条长长的过道领作业本。这些都可能成为压垮骆驼的最后一根稻草。如果不是考试后常能从主席台领奖金，顺便能贴一墙奖状满足最后的虚荣心，我可能早已放弃。 身处命运的漩涡，耗尽心力去争取那些可能本就是稀松平常的东西，每次转折都显得那么的身不由己。幸运的是，命运到底还有一丝怜惜。进入高中后，学校免了全部学杂费，胡叔叔一家帮助解决了生活费。进入大学后，计算机终于成了我一生的事业与希望，胃溃疡和胃出血也终与我作别。 从家出发坐大巴需要两个半小时才能到县城，一直盼着走出大山。从炬光乡小学、大寅镇中学、仪陇县中学、绵阳市南山中学，到重庆的西南大学，再到中科院自动化所，我也记不清有多少次因为现实的压力而觉得自己快扛不下去了。这一路，信念很简单，把书念下去，然后走出去，不枉活一世。世事难料，未来注定还会面对更为复杂的局面。但因为有了这些点点滴滴，我已经有勇气和耐心面对任何困难和挑战。理想不伟大，只愿年过半百，归来仍是少年，希望还有机会重新认识这个世界，不辜负这一生吃过的苦。 最后如果还能做出点让别人生活更美好的事，那这辈子就赚了。 PDF悦读和下载","link":"/2021/cb264ff3c451/"},{"title":"WinToGo口袋系统","text":"口袋系统WinToGo是一款简单、易用且免费的安装Win 10到U盘、移动硬盘软件。主要为便携、临时替代、节约空间而生；如果你经常出差，把Windows安装到U盘，带上U盘即可；系统不能启动，用WinToGo快速替代，不影响工作；苹果电脑直接把Windows安装到U盘，节省本地磁盘空间，方便管理。本文为在外部存储介质中为Mac os安装windows系统的教程，帮助缓解本地存储空间的压力。 准备阶段在系统安装之前，你需要准备以下工具和软件： 硬盘 *1，硬盘盒 *1 win10镜像 VMware虚拟机 WinToGo工具 WindowsSupport驱动工具包 硬盘微软官方对WinToGo的要求为：接口为 USB 2.0及以上，容量为 32 G 及以上，为了良好的用户体验，毋庸置疑，我们需要准备一块性能优异的硬盘。对于硬盘的选择，如果您的预算有限，请偏向小容量SSD（固态硬盘）或者高性能机械硬盘，虽然官方没有为这些硬盘进行认证，不过这影响不大，你仍然可以照常安装 WTG到这些硬盘里，并且实际体验效果也不差。以下是我在本教程中使用选择： Samsung SSD 750 EVO 120GB 某宝的硬盘盒 win10镜像镜像ISO文件可以在官方地址下载，也可以通过其他途径获取。 注意，镜像要求为win10专业版！ VMware虚拟机VMware[官方下载地址][2]，如果是第一次使用，可以免费试用15天；如果无试用机会，请购买支持正版软件或者网上下载VMware keygen注册机，将注册机生成的注册码输入到许可认证栏中实现注册激活。 1.下载完成后打开VMware应用程序。 2.以下载好的windows 10的镜像文件作为安装文件创建新的虚拟机。 3.window 10虚拟机安装成功 WTG工具通过此功能，你可以将 Windows 「浓缩」到一个 USB 存储设备上并随身携带，并且由于是储存在外置设备中，所以不用担心本机的容量问题。这对那些对 Windows 有短暂需求而又不想装 Boot Camp和虚拟机的 Mac 用户来说可谓非常友好了 ，[跳转下载地址][3]。 WindowsSupport工具包WindowsSupport是在windows系统下支持Mac硬件驱动支持包，包括键盘、Touch Bar、触控板、声卡等驱动，在Boot Camp下可以下载当前Mac支持的驱动包文件。 打开Boot Camp应用程序 菜单栏 → 操作 → 下载windows支持软件 安装阶段 在Mac os中使用磁盘工具初始化准备的硬盘。 重新插拔硬盘，选择连接到windows。 在磁盘管理中格式化硬盘。 为虚拟机连接CD/DVD驱动器。 打开共享文件夹下的win to usb应用程序并安装。 （可选）破解win to usb。 将文件夹中的破解补丁拷贝到win to usb的安装目录下 断网状态下打开破解补丁，点击patch，出现patching done说明补丁成功。 断网状态下打开win to usb应用程序，输入注册码 LJXBH443-EK4FX4TN-4G4R3X9W-WGZ4N4SK-U7MF6TG4-ZJZUQFFR 后，输入任意数字，提示激活成功需要重新打开软件。 在win to usb中选择来自CD/DVD的镜像文件。 选择window 10 专业版 等待安装完成 将WindowsSupport驱动包拷贝到目标磁盘中。 重新启动电脑，在苹果logo出现的界面长按option按键，选择EFI Boot，接下来只需要静心等待系统初始化结束。 系统初始化的过程中有一个小问题需要注意一下：系统要求输入用户名，注意这时候我们的键盘、触控板、TouchBar都是无法使用的，可以观察到键盘背光和TouchBar都是不亮的，推荐使用屏幕键盘或者外置键盘，完成用户信息录入。 windows 10系统初始化完毕后，下一步需要安装WindowsSupport驱动包从而让键盘、触控板等支持windows 10，打开WindowsSupport文件夹，运行setup安装程序，安装成功后重启系统。 至此windows 10已经成功安装，重新启动后系统会自动装载部分驱动：蓝牙、声卡、Intel显卡，这需要一些时间，但不影响系统的正常使用。","link":"/2019/90c05ca29adc/"},{"title":"魔改终端","text":"ZSHShell是Linux/Unix系统的外壳，Mac OS系统中也采用了shell，负责外界与内核之间的交互，将用户的命令转化为内核语言传递给内核，内核根据指令进行工作并将结果反馈于窗口上。简单的说就是通过一串简洁的指令执行一套逻辑可能很复杂的任务，从而提升人们的工作效率。目前常用的Linux系统和OS X中的shell默认采用了bash命令行，而在Mac OS中其实还预装了zsh命令行，这款shell非常的强大，它支持的功能比bash等丰富许多。 你可以通过以下指令查询当前系统中装载了哪些shell，其实就是查看/etc目录下的shells文件： 1cat etc/shells 知道了自己的系统中已装载了哪些shell后，我们就可以去查看当前使用的shell并去切换它： 12echo $SHELLS //输出环境变量SHELLSchsh -s /bin/zsh //切换zsh 输入用户的密码后shell就切换为zsh了，可以输入echo $SHELLS检查一下是否切换成功 iTerm2相比于Mac OS自带的终端，iTerm2对用户可是友好多了。iTerm2能够支持主题选择、声明高亮、自动填充建议、隐藏用户名和主机名、分屏效果等。 配置主题iTerm2安装好后我们可以为其自定义一个主题，主题包可额外下载导入，这里安利一款好看的主题：Solarized，点击进入开源项目地址。 如果你已经安装了git，可以直接使用以下命令安装： 1$ git clone git://github.com/altercation/solarized.git 打开preference，选择colors，点击右下角的Color Presets，从下拉框中选择一个主题或者import一个主题包,比如Solarized主题，打开解压的文件夹，选择其中的iterm2-colors-solarized文件夹中的文件。 配置背景图片点击preference，选择windows，在bakcground-image栏下enable复选框选中后，从本地文件中选择一张图片作为背景，左侧的Transparency可以设置图片的透明度。 oh my zshoh my zsh是对zsh主题的拓展，不仅可以使你的终端界面更加炫酷，而且还支持更丰富的插件功能。 安装oh my zsh12345# curl安装sh -c &quot;$(curl -fsSL https://raw.githubusercontent.com/robbyrussell/oh-myzsh/master/tools/install.sh)&quot;# wget安装sh -c &quot;$(wget https://raw.githubusercontent.com/robbyrussell/oh-my-zsh/master/tools/install.sh -O -)&quot; 如果见到下面这个界面时，说明安装成功。 在确保当前shell已经切换为zsh的前提下，打开配置文件~/.zshrc 1234567vim ~/.zshrc#或者直接用记事本打开open ~/.zshrc#配置完成后生效配置文件source ~/.zshrc 修改主题ZSH_THEME=&quot;agnoster&quot;，agnoster是最花哨的主题之一，主题库目录位于 ~/.oh-my-zsh/themes下。 更多主题请参考https://github.com/ohmyzsh/ohmyzsh/wiki/Themes 添加插件plugins=(xxx)，同时引入插件资源source xxx.zsh 更多主题请参考https://github.com/ohmyzsh/ohmyzsh/wiki/Plugins 添加代码高亮12345# .zshrc文件配置plugins=(zsh-syntax-highlighting) #使用插件# 引入插件资源source /Users/peggy/.oh-my-zsh/zsh-syntax-highlighting/zsh-syntax-highlighting.zsh zsh-syntax-highlighting插件的开源地址 添加命令建议、补全和历史记忆12345678# .zshrc文件配置plugins=(zsh-autosuggestions) #使用插件# 引入插件资源source ~/.zsh/zsh-autosuggestions/zsh-autosuggestions.zsh # fg:字体颜色，默认为8，可设置数字0-7 bg:背景色，粗体，下划线ZSH_AUTOSUGGEST_HIGHLIGHT_STYLE=&quot;fg=4,bg=cyan,bold,underline&quot; zsh-autosuggestions插件的开源地址 Homebrewhomebrew是一款Mac OS或linux系统下的软件包管理工具，通过一串简单的指令实现直接软件包安装，而不需要手动点击安装包，设置安装地址，繁琐地去安装软件。Homebrew会将软件包安装到独立目录，并将其文件软链接至 /usr/local。 安装1/bin/bash -c &quot;$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install.sh)&quot; 如果安装过慢或失败，请采用以下步骤： 1.将官网的安装文件或取下来 1curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install &gt;&gt; brew_install 2.打开brew_install文件，切换脚本中的资源镜像链接 1234567vi brew_install # 替换BREW_REPO为以下地址BREW_REPO = “https://mirrors.ustc.edu.cn/brew.git “.freeze # 替换CORE_TAP_REPO为以下地址CORE_TAP_REPO = “https://mirrors.ustc.edu.cn/homebrew-core.git“.freeze 3.运行安装脚本 1ruby brew_install 4.安装检测 1brew -v 资源仓库设定 到此步骤为止，homebrew应该是安装成功了，下面的步骤并非必要性步骤，如果发现使用brew install [formula..]安装过慢，请继续参考该步骤。因为homebrew默认的仓库源是在github上的，访问速度较慢，所以可以切换为国内的源。 12345678cd &quot;$(brew --repo)&quot;git remote set-url origin https://mirrors.ustc.edu.cn/brew.gitcd &quot;$(brew --repo)/Library/Taps/homebrew/&quot;rm -rf ./*git clone https://mirrors.ustc.edu.cn/homebrew-core.gitgit clone https://mirrors.ustc.edu.cn/homebrew-cask.gitbrew update 更换homebrew-bottles镜像(影响下载速度)1234567# 如果你的shell使用的bashecho 'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.tuna.tsinghua.edu.cn/homebrew-bottles' &gt;&gt; ~/.bash_profilesource ~/.bash_profile# 如果你的shell使用的zshecho 'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.tuna.tsinghua.edu.cn/homebrew-bottles' &gt;&gt; ~/.zshrcsource ~/.zshrc 常用命令 12345678# brewbrew install formula... # 安装brew search [TEXT|/REGEX/] #查找brew list # 查看已安装的包brew update # 更新homebrewbrew uninstall formula... # 卸载brew info [formula...] # 查看软件包信息brew help # 查看帮助 brew cask是brew的拓展，主要负责带有GUI的软件包安装。 安装 1brew install brew-cask-completion 使用 123brew cask install # 安装软件包...brew cask help # 与brew命令差不多，具体请查看帮助 一键装机 学会使用用homebrew安装软件后，我们甚至可以编写一个脚本来一键安装需要的软件，这对于一个新的系统或者系统重置之后安装软件更加便捷，只需要运行脚本即可一键进行装机。 1vi brewInstaller.sh 12345678#!/bin/bash# Promgram:# This script installs softwares which you needbrew cask install wechatbrew install mysqlbrew cask install qq...echo &quot;安装已完成&quot; 1sh brewInstaller.sh","link":"/2019/250c39b7a1f4/"},{"title":"Js引擎级别的执行","text":"js是一门单线程的脚本语言，但是可以利用单线程去模拟多线程机制，当前最流行的是Chrome的v8引擎，该引擎主要由两部分组成内存堆（Memory Heap）和调用栈（Call Stack）组成。其中，Memory Heap分配内存的区域，Call Stack负责代码执行区域。 执行上下文执行上下文是评估和执行 js代码的环境的抽象概念，js代码都是在执行上下文中运行的。具体包括三种类型的执行上下文：全局执行上下文、函数执行上下文以及eval执行上下文。 上下文的分类全局执行上下文，即任何不在函数中的代码都是全局执行上下文，并且一个程序中只有一个全局执行上下文。它会执行两个事件：1.创建全局的window对象；2.实现this绑定这个全局对象。 函数执行上下文，即每个函数被调用时都会创建一个函数上下文，函数上下文可以有多个。 eval执行上下文，即执行eval函数内部的代码也会有它属于自己的执行上下文。 上下文的创建在js代码执行之前，执行上下文将经历创建阶段，创建阶段包括以下三个步骤： 1.This绑定 在全局执行上下文中，this的值指向全局对象；在函数执行上下文中，this的值指向调用函数的对象，如果没有该函数调用的对象，那么this的值将指向全局对象或者undefined（严格模式下）。 2.词法环境 词法环境是一种持有标识符-变量映射的结构。其内部有两个组件：环境记录器和外部环境的引用。环境记录器用来记录变量和函数的具体位置；外部环境引用意味着作用域。 3.变量环境 变量环境同样也是以一种词法环境，其环境记录器持有变量声明语句在执行上下文中创建的绑定关系。 在 ES6 中，词法环境组件和变量环境的一个不同就是前者被用来存储函数声明和变量（let 和 const）绑定，而后者只用来存储 var 变量绑定。 调用栈调用栈是一种后进先出的数据结构，又称为执行栈，是用来追踪函数执行流的一种机制，当执行环境中调用了多个函数时，通过这种机制，我们能够追踪到哪个函数正在执行，执行的函数体中又调用了哪个函数。 每调用一个函数，解释器就会把该函数添加进调用栈并开始执行。 正在调用栈中执行的函数还调用了其它函数，那么新函数也将会被添加进调用栈，一旦这个函数被调用，便会立即执行。 当前函数执行完毕后，解释器将其清出调用栈，继续执行当前执行环境下的剩余的代码。 当分配的调用栈空间被占满时，会引发“堆栈溢出”。 点击展开代码 >folded1234567891011121314let a = 'hello everybody';function first() { console.log('this is first'); second(); console.log('this is first again');}function second() { console.log('this is second');}first();console.log('today is Friday'); 当程序开始执行的时候，调用栈是空的，然后，步骤如下，其中每一个进入调用栈的都称为“调用帧”： 当上述代码在浏览器加载时，JavaScript 引擎创建了一个全局执行上下文并把它压入当前执行栈。当遇到 first() 函数调用时，JavaScript 引擎为该函数创建一个新的执行上下文并把它压入当前执行栈的顶部。 当从 first() 函数内部调用 second() 函数时，JavaScript 引擎为 second() 函数创建了一个新的执行上下文并把它压入当前执行栈的顶部。当 second() 函数执行完毕，它的执行上下文会从当前栈弹出，并且控制流程到达下一个执行上下文，即 first() 函数的执行上下文。 当 first() 执行完毕，它的执行上下文从栈弹出，控制流程到达全局执行上下文。一旦所有代码执行完毕，JavaScript 引擎从当前栈中移除全局执行上下文。 堆栈溢出：当你达到调用栈最大的大小的时候就会发生这种情况，而且这相当容易发生，特别是在你写递归的时候却没有全方位的测试它。 事件循环由于js是单线程语言，所以一个个任务的执行需要排队，就像银行的窗口一样，一个客户办完一个业务才能轮到下一个客户去办理业务，如果前一个用户办理用时过长，那么后一个用户必须等待。下面用一个流程图清晰展示事件执行的机制，在此之前，我们将事件分为两类：同步任务和异步任务。在执行栈中，同步任务总是优先执行。 同步和异步任务分别进入不同的执行”场所”，同步的进入主线程，异步的进Event Table并注册函数。 当指定的事情完成时，Event Table会将这个函数移入Event Queue。 主线程内的任务执行完毕为空，会去Event Queue读取对应的函数，进入主线程执行。 上述过程会不断重复，也就是常说的Event Loop(事件循环)。 那么如何知道主线程中是否为空呢？在v8引擎中存在一个monitoring process进程，会持续不断的检查主线程执行栈是否为空，一旦为空，就会去Event Queue那里检查是否有等待被调用的函数。 举例 Ajax 点击展开代码 >folded123456789let data=data;$.ajax({ url:www.sdhsab.com; data:data; success:()=&gt;{ console.log(&quot;发送成功&quot;)}})console.log('代码执行结束'); 上述是一段简易的ajax请求，其中： ajax进入Event Table中，注册回调函数success； 注册完后进入Event Queue中，等待执行； 执行console.log('代码执行结束'); 主线程从Event Queue中读取回调success执行 setTimeOut 点击展开代码 >folded12setTimeOut(()=&gt;{new()},1000);sleep(100000) 上述代码是怎么运行的： new()进入Event table并注册，开始计时； 执行sleep()函数，计时仍在继续； 计时时间到，计时事件setTimeout完成，但是sleep()函数仍在执行，只能继续等待； sleep()终于执行结束，new()进入主线程执行。 setinterval setInterval与setTimeOut类似，区别点在于setInterval在注册函数之后会指定时间间隔不断地将函数注入到Event Queue中。一旦setInterval的回调函数fn执行时间超过了延迟时间，那么就完全看不出来有时间间隔了。 我们经常还会遇到setOutTime(Fn,0)，它的意思是在能够执行Fn的第一时间去执行它，更通俗一点的说，如果有主线程中同步任务在执行，那么在同步任务执行结束时立刻将Fn调入主线程中执行，也就是说它同样也需要为同步任务让路。 宏任务与微任务除了广义的同步任务与异步任务，我们对任务还有更精细的划分： 宏任务（macro-task）：包括整体代码Script、setTimeOut、setInterval 微任务（micro-task）：Promise的then()，process.nextTick process.nextTick类似node.js版的setTimeOut 事件循环中宏任务与微任务的执行机制如下图所示： 首先整个代码片段会作为一个宏任务执行，执行过程中将具体的任务划分为宏任务与微任务，当整体执行后开始执行划分的所有微任务，所有微任务执行结束，开始执行下一个宏任务。下面看一段比较复杂的代码： 点击展开代码 >folded123456789101112131415161718192021222324252627282930313233343536console.log('1');setTimeout(function() { console.log('2'); process.nextTick(function() { console.log('3'); }) new Promise(function(resolve) { console.log('4'); resolve(); }).then(function() { console.log('5') })})process.nextTick(function() { console.log('6');})new Promise(function(resolve) { console.log('7'); resolve();}).then(function() { console.log('8')})setTimeout(function() { console.log('9'); process.nextTick(function() { console.log('10'); }) new Promise(function(resolve) { console.log('11'); resolve(); }).then(function() { console.log('12') })}) 第一轮事件循环流程分析： 整体代码作为一个宏任务进入主线程中开始执行，遇到console.log('1')直接输出1； 遇到setTimeOut划分为一个宏任务，我们把第一个宏任务记为setTimeOut1； 再往下执行，遇到process.nextTick，划分为一个微任务，记为process1； 遇到Promise直接输出7，.then发布到微任务Event Queue中，记为then1； 又遇到了setTimeOut，划分为第二个宏任务，记为setTimeOut2； 到此为止第一轮事件循环结束，我们看一下宏任务Event Queue与微任务Event Queue的情况： 宏任务Event Queue 微任务Event Queue setTimeOut1 process1 setTimeOut2 then1 第一轮宏任务执行完毕，开始执行所有的微任务，依次分别输出process1和then1，输出6和8，第一轮的输出结果是1,7,6,8。 第二轮事件循环流程分析： 主线程中开始执行下一个宏任务setTimeOut1； 遇到console.log('2')直接输出2； 遇到process.nextTick划分为微任务process2； 遇到Promise直接输出4，.then记为微任务then2； 到此为止第一轮事件循环结束，我们看一下宏任务Event Queue与微任务Event Queue的情况： 宏任务Event Queue 微任务Event Queue setTimeOut2 process2 then2 第二轮宏任务执行完毕，开始执行所有微任务，依次分别输出process2和then2，输出3和5，第二轮的输出结果是2,4,3,5。 第三轮事件循环流程分析： 主线程开始执行最后一个宏任务setTimeOut2； 遇到 console.log('9')直接输出9； 遇到 process.nextTick记为微任务process3； 遇到Promise直接输出11，.then记为微任务then3； 到此为止第三轮事件循环结束，我们看一下宏任务Event Queue与微任务Event Queue的情况： 宏任务Event Queue 微任务Event Queue process3 then3 第三轮宏任务执行完毕，开始执行所有微任务，依次分别输出process3和then3，输出10和12，第二轮的输出结果是9,11,10,12。 到此为止，整段代码执行结束，最后的输出结果为：1,7,6,8,2,4,3,5,9,11,10,12。最后注意，node环境下的事件监听依赖libuv与前端环境不完全相同，输出顺序可能会有误差。","link":"/2019/e7a52f913357/"},{"title":"中华人民共和国网络安全法","text":"《中华人民共和国网络安全法》是为保障网络安全，维护网络空间主权和国家安全、社会公共利益，保护公民、法人和其他组织的合法权益，促进经济社会信息化健康发展制定。由全国人民代表大会常务委员会于2016年11月7日发布，自2017年6月1日起施行。 中文名：中华人民共和国网络安全法 外文名：People’s Republic of China Network Security Law 发布机构：全国人民代表大会常务委员会 发布日期：2016年11月7日 实施日期：2017年6月1日 第一章 总 则 第二章 网络安全支持与促进 第三章 网络运行安全 第一节 一般规定 第二节 关键信息基础设施的运行安全 第四章 网络信息安全 第五章 监测预警与应急处置 第六章 法律责任 第七章 附 则 第一章 总 则第一条 为了保障网络安全，维护网络空间主权和国家安全、社会公共利益，保护公民、法人和其他组织的合法权益，促进经济社会信息化健康发展，制定本法。 第二条 在中华人民共和国境内建设、运营、维护和使用网络，以及网络安全的监督管理，适用本法。 第三条 国家坚持网络安全与信息化发展并重，遵循积极利用、科学发展、依法管理、确保安全的方针，推进网络基础设施建设和互联互通，鼓励网络技术创新和应用，支持培养网络安全人才，建立健全网络安全保障体系，提高网络安全保护能力。 第四条 国家制定并不断完善网络安全战略，明确保障网络安全的基本要求和主要目标，提出重点领域的网络安全政策、工作任务和措施。 第五条 国家采取措施，监测、防御、处置来源于中华人民共和国境内外的网络安全风险和威胁，保护关键信息基础设施免受攻击、侵入、干扰和破坏，依法惩治网络违法犯罪活动，维护网络空间安全和秩序。 第六条 国家倡导诚实守信、健康文明的网络行为，推动传播社会主义核心价值观，采取措施提高全社会的网络安全意识和水平，形成全社会共同参与促进网络安全的良好环境。 第七条 国家积极开展网络空间治理、网络技术研发和标准制定、打击网络违法犯罪等方面的国际交流与合作，推动构建和平、安全、开放、合作的网络空间，建立多边、民主、透明的网络治理体系。 第八条 国家网信部门负责统筹协调网络安全工作和相关监督管理工作。国务院电信主管部门、公安部门和其他有关机关依照本法和有关法律、行政法规的规定，在各自职责范围内负责网络安全保护和监督管理工作。县级以上地方人民政府有关部门的网络安全保护和监督管理职责，按照国家有关规定确定。 第九条 网络运营者开展经营和服务活动，必须遵守法律、行政法规，尊重社会公德，遵守商业道德，诚实信用，履行网络安全保护义务，接受政府和社会的监督，承担社会责任。 第十条 建设、运营网络或者通过网络提供服务，应当依照法律、行政法规的规定和国家标准的强制性要求，采取技术措施和其他必要措施，保障网络安全、稳定运行，有效应对网络安全事件，防范网络违法犯罪活动，维护网络数据的完整性、保密性和可用性。 第十一条 网络相关行业组织按照章程，加强行业自律，制定网络安全行为规范，指导会员加强网络安全保护，提高网络安全保护水平，促进行业健康发展。 第十二条 国家保护公民、法人和其他组织依法使用网络的权利，促进网络接入普及，提升网络服务水平，为社会提供安全、便利的网络服务，保障网络信息依法有序自由流动。任何个人和组织使用网络应当遵守宪法法律，遵守公共秩序，尊重社会公德，不得危害网络安全，不得利用网络从事危害国家安全、荣誉和利益，煽动颠覆国家政权、推翻社会主义制度，煽动分裂国家、破坏国家统一，宣扬恐怖主义、极端主义，宣扬民族仇恨、民族歧视，传播暴力、淫秽色情信息，编造、传播虚假信息扰乱经济秩序和社会秩序，以及侵害他人名誉、隐私、知识产权和其他合法权益等活动。 第十三条 国家支持研究开发有利于未成年人健康成长的网络产品和服务，依法惩治利用网络从事危害未成年人身心健康的活动，为未成年人提供安全、健康的网络环境。 第十四条 任何个人和组织有权对危害网络安全的行为向网信、电信、公安等部门举报。收到举报的部门应当及时依法作出处理；不属于本部门职责的，应当及时移送有权处理的部门。有关部门应当对举报人的相关信息予以保密，保护举报人的合法权益。 第二章 网络安全支持与促进第十五条 国家建立和完善网络安全标准体系。国务院标准化行政主管部门和国务院其他有关部门根据各自的职责，组织制定并适时修订有关网络安全管理以及网络产品、服务和运行安全的国家标准、行业标准。国家支持企业、研究机构、高等学校、网络相关行业组织参与网络安全国家标准、行业标准的制定。 第十六条 国务院和省、自治区、直辖市人民政府应当统筹规划，加大投入，扶持重点网络安全技术产业和项目，支持网络安全技术的研究开发和应用，推广安全可信的网络产品和服务，保护网络技术知识产权，支持企业、研究机构和高等学校等参与国家网络安全技术创新项目。 第十七条 国家推进网络安全社会化服务体系建设，鼓励有关企业、机构开展网络安全认证、检测和风险评估等安全服务。 第十八条 国家鼓励开发网络数据安全保护和利用技术，促进公共数据资源开放，推动技术创新和经济社会发展。国家支持创新网络安全管理方式，运用网络新技术，提升网络安全保护水平。 第十九条 各级人民政府及其有关部门应当组织开展经常性的网络安全宣传教育，并指导、督促有关单位做好网络安全宣传教育工作。大众传播媒介应当有针对性地面向社会进行网络安全宣传教育。 第二十条 国家支持企业和高等学校、职业学校等教育培训机构开展网络安全相关教育与培训，采取多种方式培养网络安全人才，促进网络安全人才交流。第三章 网络运行安全 第一节 一般规定第二十一条 国家实行网络安全等级保护制度。网络运营者应当按照网络安全等级保护制度的要求，履行下列安全保护义务，保障网络免受干扰、破坏或者未经授权的访问，防止网络数据泄露或者被窃取、篡改：（一）制定内部安全管理制度和操作规程，确定网络安全负责人，落实网络安全保护责任；（二）采取防范计算机病毒和网络攻击、网络侵入等危害网络安全行为的技术措施；（三）采取监测、记录网络运行状态、网络安全事件的技术措施，并按照规定留存相关的网络日志不少于六个月；（四）采取数据分类、重要数据备份和加密等措施；（五）法律、行政法规规定的其他义务。 第二十二条 网络产品、服务应当符合相关国家标准的强制性要求。网络产品、服务的提供者不得设置恶意程序；发现其网络产品、服务存在安全缺陷、漏洞等风险时，应当立即采取补救措施，按照规定及时告知用户并向有关主管部门报告。网络产品、服务的提供者应当为其产品、服务持续提供安全维护；在规定或者当事人约定的期限内，不得终止提供安全维护。网络产品、服务具有收集用户信息功能的，其提供者应当向用户明示并取得同意；涉及用户个人信息的，还应当遵守本法和有关法律、行政法规关于个人信息保护的规定。 第二十三条 网络关键设备和网络安全专用产品应当按照相关国家标准的强制性要求，由具备资格的机构安全认证合格或者安全检测符合要求后，方可销售或者提供。国家网信部门会同国务院有关部门制定、公布网络关键设备和网络安全专用产品目录，并推动安全认证和安全检测结果互认，避免重复认证、检测。 第二十四条 网络运营者为用户办理网络接入、域名注册服务，办理固定电话、移动电话等入网手续，或者为用户提供信息发布、即时通讯等服务，在与用户签订协议或者确认提供服务时，应当要求用户提供真实身份信息。用户不提供真实身份信息的，网络运营者不得为其提供相关服务。国家实施网络可信身份战略，支持研究开发安全、方便的电子身份认证技术，推动不同电子身份认证之间的互认。 第二十五条 网络运营者应当制定网络安全事件应急预案，及时处置系统漏洞、计算机病毒、网络攻击、网络侵入等安全风险；在发生危害网络安全的事件时，立即启动应急预案，采取相应的补救措施，并按照规定向有关主管部门报告。 第二十六条 开展网络安全认证、检测、风险评估等活动，向社会发布系统漏洞、计算机病毒、网络攻击、网络侵入等网络安全信息，应当遵守国家有关规定。 第二十七条 任何个人和组织不得从事非法侵入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的活动；不得提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序、工具；明知他人从事危害网络安全的活动的，不得为其提供技术支持、广告推广、支付结算等帮助。 第二十八条 网络运营者应当为公安机关、国家安全机关依法维护国家安全和侦查犯罪的活动提供技术支持和协助。 第二十九条 国家支持网络运营者之间在网络安全信息收集、分析、通报和应急处置等方面进行合作，提高网络运营者的安全保障能力。有关行业组织建立健全本行业的网络安全保护规范和协作机制，加强对网络安全风险的分析评估，定期向会员进行风险警示，支持、协助会员应对网络安全风险。 第三十条 网信部门和有关部门在履行网络安全保护职责中获取的信息，只能用于维护网络安全的需要，不得用于其他用途。 第二节 关键信息基础设施的运行安全第三十一条 国家对公共通信和信息服务、能源、交通、水利、金融、公共服务、电子政务等重要行业和领域，以及其他一旦遭到破坏、丧失功能或者数据泄露，可能严重危害国家安全、国计民生、公共利益的关键信息基础设施，在网络安全等级保护制度的基础上，实行重点保护。关键信息基础设施的具体范围和安全保护办法由国务院制定。国家鼓励关键信息基础设施以外的网络运营者自愿参与关键信息基础设施保护体系。 第三十二条 按照国务院规定的职责分工，负责关键信息基础设施安全保护工作的部门分别编制并组织实施本行业、本领域的关键信息基础设施安全规划，指导和监督关键信息基础设施运行安全保护工作。 第三十三条 建设关键信息基础设施应当确保其具有支持业务稳定、持续运行的性能，并保证安全技术措施同步规划、同步建设、同步使用。 第三十四条 除本法第二十一条的规定外，关键信息基础设施的运营者还应当履行下列安全保护义务：（一）设置专门安全管理机构和安全管理负责人，并对该负责人和关键岗位的人员进行安全背景审查；（二）定期对从业人员进行网络安全教育、技术培训和技能考核；（三）对重要系统和数据库进行容灾备份；（四）制定网络安全事件应急预案，并定期进行演练；（五）法律、行政法规规定的其他义务。 第三十五条 关键信息基础设施的运营者采购网络产品和服务，可能影响国家安全的，应当通过国家网信部门会同国务院有关部门组织的国家安全审查。 第三十六条 关键信息基础设施的运营者采购网络产品和服务，应当按照规定与提供者签订安全保密协议，明确安全和保密义务与责任。 第三十七条 关键信息基础设施的运营者在中华人民共和国境内运营中收集和产生的个人信息和重要数据应当在境内存储。因业务需要，确需向境外提供的，应当按照国家网信部门会同国务院有关部门制定的办法进行安全评估；法律、行政法规另有规定的，依照其规定。 第三十八条 关键信息基础设施的运营者应当自行或者委托网络安全服务机构对其网络的安全性和可能存在的风险每年至少进行一次检测评估，并将检测评估情况和改进措施报送相关负责关键信息基础设施安全保护工作的部门。 第三十九条 国家网信部门应当统筹协调有关部门对关键信息基础设施的安全保护采取下列措施：（一）对关键信息基础设施的安全风险进行抽查检测，提出改进措施，必要时可以委托网络安全服务机构对网络存在的安全风险进行检测评估；（二）定期组织关键信息基础设施的运营者进行网络安全应急演练，提高应对网络安全事件的水平和协同配合能力；（三）促进有关部门、关键信息基础设施的运营者以及有关研究机构、网络安全服务机构等之间的网络安全信息共享；（四）对网络安全事件的应急处置与网络功能的恢复等，提供技术支持和协助。 第四章 网络信息安全第四十条 网络运营者应当对其收集的用户信息严格保密，并建立健全用户信息保护制度。 第四十一条 网络运营者收集、使用个人信息，应当遵循合法、正当、必要的原则，公开收集、使用规则，明示收集、使用信息的目的、方式和范围，并经被收集者同意。网络运营者不得收集与其提供的服务无关的个人信息，不得违反法律、行政法规的规定和双方的约定收集、使用个人信息，并应当依照法律、行政法规的规定和与用户的约定，处理其保存的个人信息。 第四十二条 网络运营者不得泄露、篡改、毁损其收集的个人信息；未经被收集者同意，不得向他人提供个人信息。但是，经过处理无法识别特定个人且不能复原的除外。网络运营者应当采取技术措施和其他必要措施，确保其收集的个人信息安全，防止信息泄露、毁损、丢失。在发生或者可能发生个人信息泄露、毁损、丢失的情况时，应当立即采取补救措施，按照规定及时告知用户并向有关主管部门报告。 第四十三条 个人发现网络运营者违反法律、行政法规的规定或者双方的约定收集、使用其个人信息的，有权要求网络运营者删除其个人信息；发现网络运营者收集、存储的其个人信息有错误的，有权要求网络运营者予以更正。网络运营者应当采取措施予以删除或者更正。 第四十四条 任何个人和组织不得窃取或者以其他非法方式获取个人信息，不得非法出售或者非法向他人提供个人信息。 第四十五条 依法负有网络安全监督管理职责的部门及其工作人员，必须对在履行职责中知悉的个人信息、隐私和商业秘密严格保密，不得泄露、出售或者非法向他人提供。 第四十六条 任何个人和组织应当对其使用网络的行为负责，不得设立用于实施诈骗，传授犯罪方法，制作或者销售违禁物品、管制物品等违法犯罪活动的网站、通讯群组，不得利用网络发布涉及实施诈骗，制作或者销售违禁物品、管制物品以及其他违法犯罪活动的信息。 第四十七条 网络运营者应当加强对其用户发布的信息的管理，发现法律、行政法规禁止发布或者传输的信息的，应当立即停止传输该信息，采取消除等处置措施，防止信息扩散，保存有关记录，并向有关主管部门报告。 第四十八条 任何个人和组织发送的电子信息、提供的应用软件，不得设置恶意程序，不得含有法律、行政法规禁止发布或者传输的信息。电子信息发送服务提供者和应用软件下载服务提供者，应当履行安全管理义务，知道其用户有前款规定行为的，应当停止提供服务，采取消除等处置措施，保存有关记录，并向有关主管部门报告。 第四十九条 网络运营者应当建立网络信息安全投诉、举报制度，公布投诉、举报方式等信息，及时受理并处理有关网络信息安全的投诉和举报。网络运营者对网信部门和有关部门依法实施的监督检查，应当予以配合。 第五十条 国家网信部门和有关部门依法履行网络信息安全监督管理职责，发现法律、行政法规禁止发布或者传输的信息的，应当要求网络运营者停止传输，采取消除等处置措施，保存有关记录；对来源于中华人民共和国境外的上述信息，应当通知有关机构采取技术措施和其他必要措施阻断传播。 第五章 监测预警与应急处置第五十一条 国家建立网络安全监测预警和信息通报制度。国家网信部门应当统筹协调有关部门加强网络安全信息收集、分析和通报工作，按照规定统一发布网络安全监测预警信息。 第五十二条 负责关键信息基础设施安全保护工作的部门，应当建立健全本行业、本领域的网络安全监测预警和信息通报制度，并按照规定报送网络安全监测预警信息。 第五十三条 国家网信部门协调有关部门建立健全网络安全风险评估和应急工作机制，制定网络安全事件应急预案，并定期组织演练。负责关键信息基础设施安全保护工作的部门应当制定本行业、本领域的网络安全事件应急预案，并定期组织演练。网络安全事件应急预案应当按照事件发生后的危害程度、影响范围等因素对网络安全事件进行分级，并规定相应的应急处置措施。 第五十四条 网络安全事件发生的风险增大时，省级以上人民政府有关部门应当按照规定的权限和程序，并根据网络安全风险的特点和可能造成的危害，采取下列措施：（一）要求有关部门、机构和人员及时收集、报告有关信息，加强对网络安全风险的监测；（二）组织有关部门、机构和专业人员，对网络安全风险信息进行分析评估，预测事件发生的可能性、影响范围和危害程度；（三）向社会发布网络安全风险预警，发布避免、减轻危害的措施。 第五十五条 发生网络安全事件，应当立即启动网络安全事件应急预案，对网络安全事件进行调查和评估，要求网络运营者采取技术措施和其他必要措施，消除安全隐患，防止危害扩大，并及时向社会发布与公众有关的警示信息。 第五十六条 省级以上人民政府有关部门在履行网络安全监督管理职责中，发现网络存在较大安全风险或者发生安全事件的，可以按照规定的权限和程序对该网络的运营者的法定代表人或者主要负责人进行约谈。网络运营者应当按照要求采取措施，进行整改，消除隐患。 第五十七条 因网络安全事件，发生突发事件或者生产安全事故的，应当依照《中华人民共和国突发事件应对法》、《中华人民共和国安全生产法》等有关法律、行政法规的规定处置。 第五十八条 因维护国家安全和社会公共秩序，处置重大突发社会安全事件的需要，经国务院决定或者批准，可以在特定区域对网络通信采取限制等临时措施。 第六章 法律责任第五十九条 网络运营者不履行本法第二十一条、第二十五条规定的网络安全保护义务的，由有关主管部门责令改正，给予警告；拒不改正或者导致危害网络安全等后果的，处一万元以上十万元以下罚款，对直接负责的主管人员处五千元以上五万元以下罚款。关键信息基础设施的运营者不履行本法第三十三条、第三十四条、第三十六条、第三十八条规定的网络安全保护义务的，由有关主管部门责令改正，给予警告；拒不改正或者导致危害网络安全等后果的，处十万元以上一百万元以下罚款，对直接负责的主管人员处一万元以上十万元以下罚款。 第六十条 违反本法第二十二条第一款、第二款和第四十八条第一款规定，有下列行为之一的，由有关主管部门责令改正，给予警告；拒不改正或者导致危害网络安全等后果的，处五万元以上五十万元以下罚款，对直接负责的主管人员处一万元以上十万元以下罚款：（一）设置恶意程序的；（二）对其产品、服务存在的安全缺陷、漏洞等风险未立即采取补救措施，或者未按照规定及时告知用户并向有关主管部门报告的；（三）擅自终止为其产品、服务提供安全维护的。 第六十一条 网络运营者违反本法第二十四条第一款规定，未要求用户提供真实身份信息，或者对不提供真实身份信息的用户提供相关服务的，由有关主管部门责令改正；拒不改正或者情节严重的，处五万元以上五十万元以下罚款，并可以由有关主管部门责令暂停相关业务、停业整顿、关闭网站、吊销相关业务许可证或者吊销营业执照，对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款。 第六十二条 违反本法第二十六条规定，开展网络安全认证、检测、风险评估等活动，或者向社会发布系统漏洞、计算机病毒、网络攻击、网络侵入等网络安全信息的，由有关主管部门责令改正，给予警告；拒不改正或者情节严重的，处一万元以上十万元以下罚款，并可以由有关主管部门责令暂停相关业务、停业整顿、关闭网站、吊销相关业务许可证或者吊销营业执照，对直接负责的主管人员和其他直接责任人员处五千元以上五万元以下罚款。 第六十三条 违反本法第二十七条规定，从事危害网络安全的活动，或者提供专门用于从事危害网络安全活动的程序、工具，或者为他人从事危害网络安全的活动提供技术支持、广告推广、支付结算等帮助，尚不构成犯罪的，由公安机关没收违法所得，处五日以下拘留，可以并处五万元以上五十万元以下罚款；情节较重的，处五日以上十五日以下拘留，可以并处十万元以上一百万元以下罚款。单位有前款行为的，由公安机关没收违法所得，处十万元以上一百万元以下罚款，并对直接负责的主管人员和其他直接责任人员依照前款规定处罚。违反本法第二十七条规定，受到治安管理处罚的人员，五年内不得从事网络安全管理和网络运营关键岗位的工作；受到刑事处罚的人员，终身不得从事网络安全管理和网络运营关键岗位的工作。 第六十四条 网络运营者、网络产品或者服务的提供者违反本法第二十二条第三款、第四十一条至第四十三条规定，侵害个人信息依法得到保护的权利的，由有关主管部门责令改正，可以根据情节单处或者并处警告、没收违法所得、处违法所得一倍以上十倍以下罚款，没有违法所得的，处一百万元以下罚款，对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款；情节严重的，并可以责令暂停相关业务、停业整顿、关闭网站、吊销相关业务许可证或者吊销营业执照。违反本法第四十四条规定，窃取或者以其他非法方式获取、非法出售或者非法向他人提供个人信息，尚不构成犯罪的，由公安机关没收违法所得，并处违法所得一倍以上十倍以下罚款，没有违法所得的，处一百万元以下罚款。 第六十五条 关键信息基础设施的运营者违反本法第三十五条规定，使用未经安全审查或者安全审查未通过的网络产品或者服务的，由有关主管部门责令停止使用，处采购金额一倍以上十倍以下罚款；对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款。 第六十六条 关键信息基础设施的运营者违反本法第三十七条规定，在境外存储网络数据，或者向境外提供网络数据的，由有关主管部门责令改正，给予警告，没收违法所得，处五万元以上五十万元以下罚款，并可以责令暂停相关业务、停业整顿、关闭网站、吊销相关业务许可证或者吊销营业执照；对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款。 第六十七条 违反本法第四十六条规定，设立用于实施违法犯罪活动的网站、通讯群组，或者利用网络发布涉及实施违法犯罪活动的信息，尚不构成犯罪的，由公安机关处五日以下拘留，可以并处一万元以上十万元以下罚款；情节较重的，处五日以上十五日以下拘留，可以并处五万元以上五十万元以下罚款。关闭用于实施违法犯罪活动的网站、通讯群组。单位有前款行为的，由公安机关处十万元以上五十万元以下罚款，并对直接负责的主管人员和其他直接责任人员依照前款规定处罚。 第六十八条 网络运营者违反本法第四十七条规定，对法律、行政法规禁止发布或者传输的信息未停止传输、采取消除等处置措施、保存有关记录的，由有关主管部门责令改正，给予警告，没收违法所得；拒不改正或者情节严重的，处十万元以上五十万元以下罚款，并可以责令暂停相关业务、停业整顿、关闭网站、吊销相关业务许可证或者吊销营业执照，对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款。电子信息发送服务提供者、应用软件下载服务提供者，不履行本法第四十八条第二款规定的安全管理义务的，依照前款规定处罚。 第六十九条 网络运营者违反本法规定，有下列行为之一的，由有关主管部门责令改正；拒不改正或者情节严重的，处五万元以上五十万元以下罚款，对直接负责的主管人员和其他直接责任人员，处一万元以上十万元以下罚款：（一）不按照有关部门的要求对法律、行政法规禁止发布或者传输的信息，采取停止传输、消除等处置措施的；（二）拒绝、阻碍有关部门依法实施的监督检查的；（三）拒不向公安机关、国家安全机关提供技术支持和协助的。 第七十条 发布或者传输本法第十二条第二款和其他法律、行政法规禁止发布或者传输的信息的，依照有关法律、行政法规的规定处罚。 第七十一条 有本法规定的违法行为的，依照有关法律、行政法规的规定记入信用档案，并予以公示。 第七十二条 国家机关政务网络的运营者不履行本法规定的网络安全保护义务的，由其上级机关或者有关机关责令改正；对直接负责的主管人员和其他直接责任人员依法给予处分。 第七十三条 网信部门和有关部门违反本法第三十条规定，将在履行网络安全保护职责中获取的信息用于其他用途的，对直接负责的主管人员和其他直接责任人员依法给予处分。网信部门和有关部门的工作人员玩忽职守、滥用职权、徇私舞弊，尚不构成犯罪的，依法给予处分。 第七十四条 违反本法规定，给他人造成损害的，依法承担民事责任。违反本法规定，构成违反治安管理行为的，依法给予治安管理处罚；构成犯罪的，依法追究刑事责任。 第七十五条 境外的机构、组织、个人从事攻击、侵入、干扰、破坏等危害中华人民共和国的关键信息基础设施的活动，造成严重后果的，依法追究法律责任；国务院公安部门和有关部门并可以决定对该机构、组织、个人采取冻结财产或者其他必要的制裁措施。 第七章 附 则第七十六条 本法下列用语的含义：（一）网络，是指由计算机或者其他信息终端及相关设备组成的按照一定的规则和程序对信息进行收集、存储、传输、交换、处理的系统。（二）网络安全，是指通过采取必要措施，防范对网络的攻击、侵入、干扰、破坏和非法使用以及意外事故，使网络处于稳定可靠运行的状态，以及保障网络数据的完整性、保密性、可用性的能力。（三）网络运营者，是指网络的所有者、管理者和网络服务提供者。（四）网络数据，是指通过网络收集、存储、传输、处理和产生的各种电子数据。（五）个人信息，是指以电子或者其他方式记录的能够单独或者与其他信息结合识别自然人个人身份的各种信息，包括但不限于自然人的姓名、出生日期、身份证件号码、个人生物识别信息、住址、电话号码等。 第七十七条 存储、处理涉及国家秘密信息的网络的运行安全保护，除应当遵守本法外，还应当遵守保密法律、行政法规的规定。 第七十八条 军事网络的安全保护，由中央军事委员会另行规定。 第七十九条 本法自2017年6月1日起施行。","link":"/2019/2675e9671c97/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/e323eb21ed88/"}],"tags":[{"name":"IP","slug":"IP","link":"/tags/IP/"},{"name":"无效","slug":"无效","link":"/tags/%E6%97%A0%E6%95%88/"},{"name":"复审","slug":"复审","link":"/tags/%E5%A4%8D%E5%AE%A1/"},{"name":"Js","slug":"Js","link":"/tags/Js/"},{"name":"v8","slug":"v8","link":"/tags/v8/"},{"name":"少数派","slug":"少数派","link":"/tags/%E5%B0%91%E6%95%B0%E6%B4%BE/"},{"name":"装机","slug":"装机","link":"/tags/%E8%A3%85%E6%9C%BA/"},{"name":"操作系统","slug":"操作系统","link":"/tags/%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/"},{"name":"hero","slug":"hero","link":"/tags/hero/"},{"name":"励志","slug":"励志","link":"/tags/%E5%8A%B1%E5%BF%97/"},{"name":"分享","slug":"分享","link":"/tags/%E5%88%86%E4%BA%AB/"},{"name":"Anki","slug":"Anki","link":"/tags/Anki/"},{"name":"Memory","slug":"Memory","link":"/tags/Memory/"},{"name":"动力学","slug":"动力学","link":"/tags/%E5%8A%A8%E5%8A%9B%E5%AD%A6/"},{"name":"遍历理论","slug":"遍历理论","link":"/tags/%E9%81%8D%E5%8E%86%E7%90%86%E8%AE%BA/"},{"name":"奇思妙想","slug":"奇思妙想","link":"/tags/%E5%A5%87%E6%80%9D%E5%A6%99%E6%83%B3/"},{"name":"shell","slug":"shell","link":"/tags/shell/"},{"name":"Mac","slug":"Mac","link":"/tags/Mac/"},{"name":"zsh","slug":"zsh","link":"/tags/zsh/"},{"name":"Markdown","slug":"Markdown","link":"/tags/Markdown/"},{"name":"Bulma","slug":"Bulma","link":"/tags/Bulma/"},{"name":"LateX","slug":"LateX","link":"/tags/LateX/"},{"name":"writing","slug":"writing","link":"/tags/writing/"},{"name":"法律法规","slug":"法律法规","link":"/tags/%E6%B3%95%E5%BE%8B%E6%B3%95%E8%A7%84/"},{"name":"网络安全","slug":"网络安全","link":"/tags/%E7%BD%91%E7%BB%9C%E5%AE%89%E5%85%A8/"},{"name":"信息安全","slug":"信息安全","link":"/tags/%E4%BF%A1%E6%81%AF%E5%AE%89%E5%85%A8/"},{"name":"华为","slug":"华为","link":"/tags/%E5%8D%8E%E4%B8%BA/"},{"name":"专利","slug":"专利","link":"/tags/%E4%B8%93%E5%88%A9/"}],"categories":[{"name":"知产","slug":"知产","link":"/categories/%E7%9F%A5%E4%BA%A7/"},{"name":"计算机编程","slug":"计算机编程","link":"/categories/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BC%96%E7%A8%8B/"},{"name":"教程","slug":"教程","link":"/categories/%E6%95%99%E7%A8%8B/"},{"name":"其他","slug":"其他","link":"/categories/%E5%85%B6%E4%BB%96/"},{"name":"数据科学","slug":"数据科学","link":"/categories/%E6%95%B0%E6%8D%AE%E7%A7%91%E5%AD%A6/"},{"name":"物理","slug":"物理","link":"/categories/%E7%89%A9%E7%90%86/"}]}